{"id":5052,"unique_id":"5052-3207","author":{"id":8056,"username":"Xvius","avatar":"https://crafatar.com/avatars/477c4aa7b68d442186fd8523e5033962?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"\u003cspan\u003e\u003cspan\u003eSo as the thread title says, we are going to be doing a bit of \"myth-busting\" regarding hacked clients. To any educated human being, things like this *should* be apparent, but anyway I shall continue on.\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003eBackground\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eThis is just some background as to why I'm doing this. People in chat all the time say \"Omg he 1 hit me, he hacks\" or \"He has diamond armor as a recruit, he haxs.\" Now, i know, this is just a young one who doesn't know much about what is and is not possible on a Minecraft Multiplayer Bukkit Server. It is just quite sickening, getting the same thing over and over in chat, its like a broken record and quiet honestly ruins the fun on a server when that's all you read.\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003eWhat is a hacked client?\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eA Minecraft \"hacking\" client as they are called, are used to gain a Variety of advantages over other players, through the use of malicious mods, that most call \"hacks\". Such hacks include BUT are not limited to\u003cbr\u003e\u003cbr\u003e\u003cb\u003eKill-Aura\u003c/b\u003e\u0026nbsp;- Better known from the hacked client Nodus as Force-field. This is an auto-attacking hack, being able to hit out of range of normal distance, and at speeds not possible.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eNuker\u0026nbsp;\u003c/b\u003e- Basically an auto-block breaker, but breaks blocks at a faster rate.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eSprint \u003c/b\u003e-\u0026nbsp;\u0026nbsp;While not all people who sprint hack, if they stand still, or constantly sprint (as in stop-go motions) this is apparent. This sprint while not technically game breaking, can be used for laziness and also to gain a speed boost (in Nodus their is a sprint mode for fast, which makes your run slightly faster than normally possible)\u003cbr\u003e\u003cbr\u003e\u003cb\u003eCriticals\u0026nbsp;\u003c/b\u003e- This hack is quite hard to detect at most times, but is apparent if the user always deals Critical hits while barely jumping or even not jumping at all. Nodus never had this feature, so it was nothing they never needed to worry about.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eNoKnockback\u0026nbsp;\u003c/b\u003e- If you cant guess what this is, the user does not take any knockback damage when hit. Pretty obvious.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eFullbright\u0026nbsp;\u003c/b\u003e-\u0026nbsp;Makes it so their is no darkness\u003cbr\u003e\u003cbr\u003e\u003cb\u003eXray\u0026nbsp;\u003c/b\u003e- Renders only ores user wants to see, mainly used for finding diamonds or chests.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eTracers/ESP\u0026nbsp;\u003c/b\u003e- Draws a line from user to a player from the middle of the users curser. and ESP just highlights a box around other players.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eNameTags\u0026nbsp;\u003c/b\u003e- Makes name tags bigger for the user to find players easier.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eTeleport hack -\u0026nbsp;\u003c/b\u003e\u0026nbsp;Teleports user to a specific area that was designated ***PATCHED BY BUKKIT AROUND 1.3***\u003cbr\u003e\u003cbr\u003e\u003cb\u003eGodmode\u0026nbsp;\u003c/b\u003e- ERMERGERD WUT? Not what your thinking, with godmode, once toggled, your player is frozen in place, and just sends keepAlive packets to the server and denys hit packets. Luckily, NoCheatPlus caught up and patched this hack, so even toggleing this, the user will be frozen, and will take hits every few seconds if continuously hit.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eRegen\u0026nbsp;\u003c/b\u003e- This hack practically makes someone invulnerable. It acts as a fast-heal and heals the player when not hit. NC+ has affectively blocked this hack, but at one point it was possible.Mainly Private clients had this, and was not a big feature in Nodus or any Public client until up and around 1.5.2, at which point, the hack was blocked.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eNoSlowDown\u0026nbsp;\u003c/b\u003e- This hack is not actually a Sprint hack and what your seeing is Nodus Sprint hack (as I've explained Nodus keeps you running). NoSlowdown is Bassicly not slowing down for Cobwebs, in water, or on soul sand. This hack is indeed nerfed, so even using it, you throw checks by NC+. The Sprint and hit is also blocked by NC+ under the \"Improbable: player has failed the improbable more than expected\" check.\u003cbr\u003e***Thanks Source_Of_Storms for this hack inclusion!***\u003cbr\u003e\u003cbr\u003e\u003cb\u003eVClip \u003c/b\u003e- The short name for Vertical clipping, is bassicly like a NoClip but only on the Y axis. This worked for quiet some time on bukkit servers without NC+ but is since patched by both NC+ and the Bukkit server itself, setting an alert off that a player made an illegal movement. This hack used to be used to clip into peoples bases, steal their items, and leave.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eFreecam\u0026nbsp;\u003c/b\u003e- This acts as an \"out of body experience\" allowing the player to fly/wander around within their render distance without actually moving or being known that they are their. Sadly this is unpatchable as it is all client sided. This in conjunction to cavefinder helps hackers find bases.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eStep\u0026nbsp;\u003c/b\u003e- This hack allows players to hop up one high blocks without clicking the space bar. This hack was patched within the Nodus client, but other clients that have it have a somewhat bypass to it. Though slightly useless this hack allows players to gain a slight upperhand while climbing long hills.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eWaypoints\u0026nbsp;\u003c/b\u003e- This hack allows the hacker to pinpoint an area and have a client sided tracer (sometimes designated with a specific color) added while this hack is enabled, allowing them to easily find where they are going.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eFastplace and Speedmine\u0026nbsp;\u003c/b\u003e- Im going to kill two birds with one stone on this one. These two hacks do exactly what they say, enable the player to fastly placed blocks (somewhat checked by NoCheatPlus!) and SpeedMine, which allows players to break blocks slightly faster than the normal. Vanilla has blocked the ability to speedmine to an extent, and in conjunction with NoCheatPlus, makes speedmine pretty much patched (hackers are still able to break blocks faster, depending on their minespeed they set, but eventually is caught by how NoCheatPlus handles the check, which is check minespeed over X ammount of blocks and comparing it to what should normally happen.)\u003cbr\u003eSneak- This hack allows the player to be sneaking, but move at normal speed. NC+ has patched this version of sneak, and the only other sneak makes it like your holding sneak, sort of like the Better Sprint Mod, but with sneak. The \"bypassed\" version is unpatchable as its simple just making you hold shift when your not, while the other NC+ blocks because of the fact you move faster then you should be, falling under their speedhack check.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eSTP\u0026nbsp;\u003c/b\u003e\u0026nbsp;- This hack is a new one, that is quite interesting to say the least. The Initials stand for \"SpawnTeleport\" and does such. I'm not sure about the inner workings of this one, but at the moment, when a player types that in as \".stp\" in a client, it will kick the player for the message \"Nope!\" and spawn them back at the spawn point. This doesn't seem like such a big deal, except it bypasses PvP logging plugins and makes the timer for teleportation useless.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eBowAimbot\u003c/b\u003e\u0026nbsp;- This hack takes advanced calculations into effect, importing the equation the vanilla minecraft gives for Projectiles, and makes it so you lock on to an entity, then aim just the right amount above them to beable to hit them (in Nodus it was silent, so it just kind of did its own thing). This hack is one of the more useless ones suprisingly, because moving around completely breaks this, along with the fact that the Aimbot included in such hacks, aim for the middle of an entity, so hidding partially behind a block breaks this hack also.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eDerp/Retard Mode\u003c/b\u003e\u0026nbsp;- This hack is one that makes your player go all well... retarded. It sends random hit/look packets to make your player \"spaz out\" (on everyone elses screen) but on your screen it looks normal. There are versions of this hack that are specific, Such as: turning your head inside out, Stare (Ingame you will be looking one way, but on your screen your not) and ones that just make you \"spaz out\" for lack of a better term. This hack really is not game breaking, and is more of a \"why not\" kind of hack, and can be easily replicated without the use of Nodus or any other client that has a retard mode in it.\u003cbr\u003e*** Thanks to DystopianCupcake for this hack inclusion!***\u003cbr\u003e\u003cbr\u003e\u003cb\u003eEnderport\u003c/b\u003e\u0026nbsp;- This hack I personally have only seen in one client, and it made it so when you got hit (or were about to get hit, something along those lines) you would be teleported behind said player. This hack is mainly a PvP hack, and i would assume NoCheatPlus blocks this hack, because of the teleportation part of the hack.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eLSD\u003c/b\u003e\u0026nbsp;- This hack is client-sided and makes your screen go all crazy, whether its just making the screen flash different colors, to zooming in randomly/crazily, to actually changing the colors of blocks themselves randomly. This hack is pure uesless and is mainly added because developers of clients get bored and want to add something stupid in.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eRadar \u003c/b\u003e- This hack allows players to know where other players are (assuming said player is within Render Distance of the user!) and know exactly how far away they are. This hack would be sort of game-breaking because of the fact if your hiding, they would know where you are, and how to locate say a base of some sort. There is no practical way to patch this, as its just getting entitys within the renderdistance and getting the location of said players\u003cbr\u003e\u003cbr\u003e\u003cb\u003eNametags\u003c/b\u003e\u0026nbsp;- This hack (mainly seen within Nodus, but can be seen in other clients) allows the user to know where other players are by increasing nametag size, so you can see their nametag outside of Vanilla range. Most Nametags have a built in option that shows if the player is sneaking (by changing their nametag to say red (or something along those lines). This, like radar, is practically unpatchable because it is client sided and theres not much you can do about that.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eCreative Control -\u003c/b\u003e Imagine this as bassicly automated destruction. What this does is allow people to select two areas to create a region, and makes the player automatically destroy everything in that area until that area becomes air. This hack doesn't bypass NC+ in the one client that it is in at the moment so their is no reason to fear it.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eInvsee\u0026nbsp;\u003c/b\u003e- Normally a moderation tool, lately clients have been able to tweak the system and gain access to what players have in there hand and what they area wearing ( so instead of seeing someone in enchanted diamond, and he says he has full IV and a sharp V sword) said player can .invsee him and see what his sword, and his armor really hold. The thing about this, is that it does not allow people to see what is in the rest of the inventory, only what the server sends to the client (so in laymans terms, what they are holding, and their armor)\u003cbr\u003e\u003cbr\u003e\u003cb\u003eAutosoup\u0026nbsp;\u003c/b\u003e- With the addition of your KitPvP server, i thought this would be a great thing to add, so people know what to watch for, though if im incorrect, you guys had the plugin the entire time. Anyway, this hack allows players to bassicly do nothing and beable to fight as the client soups for them, making them have a HUGE advantage over normal players. This hack is pretty easy to detect as if a moderator /invsee's you it will show your soup being used from your inventory. This hack allows players on a KitPvP server with soup to become practically unkillable, and is normally combined with Killaura and an Autosword/Autotool to become a killing machine. its quite easy to notice because if you go up and hit someone and they instantly soup, you can assume they are using the hack.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eTeleportation V2\u003c/b\u003e: Recently through the hacking community people have found a simple way to bypass the way Bukkit/NoCheat patched teleportation. Needless to say NoCheat blocked this method (as thy do) but its still out there. They did this by placing a boat and sending the teleportation packet then instantly breaking the boat they were in. Recommended update of NC+ to newest version ASAP.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eTrigger Bot\u003c/b\u003e\u0026nbsp;- This hack is pretty much a \"legit\" kill aura. It will only attack players your crosshair is looking at, unlike the most killauras, it will not attack surrounding players.\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003eExploits\u003cbr\u003e\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cb\u003eFaction Finding Exploit\u003c/b\u003e: Yes, there is one, and yes, it is opperational. I actually know quite a bit about this exploit, but I won't be going over much of the specifics other than this exploit allows for quick teleportation to around the map while using the /f map function of factions to be able to map out factions VERY quickly.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003e---What Hacked Clients Cannot Do---\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eGiven certain circumstances are true, yes a hacked client can spawn items in (if the player is OP'ed and so on and so forth, but for this example, we will be using Recruits or the Default rank of a server)\u003cbr\u003e\u003cbr\u003e\u003cb\u003e*Force-Op\u0026nbsp;\u003c/b\u003e- No, their is no such thing as a force-op hack, but with the assistance of a poisoned plug-in (a plug-in that was coded and designed to read chat messages, so for example if i had a plugin that reads chat for #opme and i say that, the plugin will run the command, but other than that, you cannot just force op your name on that) Notch made sure of that.\u003cbr\u003e\u003cbr\u003e\u003cb\u003e*Spawn items in hack\u0026nbsp;\u003c/b\u003e- While there are mods like TMI, NEI, CJB and all those good things, that allow for a quick select of blocks to be spawned in, each one requires Operator status on a minecraft server, because they are simply macros for the command /give (insert player name) (insert id that was clicked on) (insert amount) *default 64 stack*\u003cbr\u003e\u003cbr\u003e\u003cb\u003e*Enchantment Hack\u003c/b\u003e - This one is a bit rough. Yes, there are actually enchantment hacks out there, but they all require Creative mode to use, mainly because of the way Creative works you can do whatever you want to an item, however you want. In Vanilla/Bukkit Survival Multiplayer no, its not possible to use an enchantment hack. Sorry fellas :c\u003cbr\u003e\u003cbr\u003e\u003cb\u003e*One Hit hack\u0026nbsp;\u003c/b\u003e- Ah the infamous 1 hit hack. No, such thing is not possible, as damage is dealt server-side or as MyPictures (one othe the developers of NoCheatPlus) has called it, The \"safe\" side. The server will deny any attempt to deal more damage than possible, though there is an exploit roaming around about forcing and enchant through, alas, you need creative to be able to do that, as stated above in the enchantment hack portion of this sub-section\u003cbr\u003e\u003cbr\u003e\u003cb\u003e*Reach Hack\u0026nbsp;\u003c/b\u003e- This one is Iffy. Yes, a client can take advantage that the fact Bukkit only checks if the player is within about 6 blocks of an entity before hitting/interacting. but NC+ has knocked that range down to about 4.25 blocks (this is due to accounting for lag) while the vanilla fight distance i believe is at 3.5 blocks. While it is an advantage, heres the question, would you rather be whacked at 6 blocks, or 4.25 where you still have a chance. I know i would choose the latter option...\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003e---Hack Detection (by the player)---\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eMost players accuse other players of hacking for doing something out of the normal, fair enough... But what can really prove a player hacking? I have seen multiple screen-shots on this website with Screenshots, saying the user is using Aim bot/FF. Now, hold up now! a Screenshot wouldn't be enough to prove that, a video would be more appropriate.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003e---Evidence---\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\u003cb\u003eScreenshots\u0026nbsp;\u003c/b\u003e- While screenshots of Fly hacks and of Sprint hacks would be easy to point out, pictures of Kill Aura/Aimbot (as i said above) are pretty pointless because its just a player hitting you, and even if said player is out of range, who;s to say they didn't swing their arm, and you got hit from the back?\u003cbr\u003e\u003cbr\u003e\u003cb\u003eThe Skype Method\u0026nbsp;\u003c/b\u003e- Aka Screen share me. Everybody thinks by that looking on someones screen, and looking for that one button that says \"Disable Nodus\" can prove people as hackers. Their are plenty of other clients out there (Weepcraft, Kinky/Xenon, Huzuni) that are run off of chat based commands (like saying .friend add in chat would not pop up in chat, but would return client sided for that one player and he would be able to use the hacked client that way. Now your thinking, OK so he screen shares me and i have him type .help or something... *WRONG*. While this may catch some un-thinking hackers, such as the 12 year old's that use clients, some clients change command prefix's when you enter .legit mode, making it that much harder to be able to detect, and let alone that, .legit mode practically deletes any trace of there ever being a hacked client by simply looking on the screen.\u003cbr\u003e\u003cbr\u003eWhile your attempt at weeding out the hacker that way would be successful for two clients (Weepcraft and Nodus) the only sure fire way to check, would be (while they are connected to the server at the time of questioning) make sure they do not disconnect, and have them show you there .bin folder for any sort of folder labeled differently than you would normally see.\u003cbr\u003eThis folder will be called the clients name, so if a user has used Nodus, Weepcraft, Proximity, Cobalt and Huzuni there will be folders in there called \"Nodus\" \"WeepCraft\" \"Proximity\" \"Cobalt\" and \"Huzuni\"\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003e---Hack Prevention---\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eAh, what stops these hacked clients from running around and terrorizing us on the server D: . Well my good fellow readers if you made it to this point, Hack Prevention on Vanilla Minecraft was implemented (poorly, but was still implemented) and even Bukkit does not patch minor hacks as they quote on quote \"don't want to become the anti-cheat solution.\" Fear not though! NoCheatPlus, AntiCheat, and a private plug-in called KNoHaxs are out there to stop hackers in their track! While not perfect, they act as filters by the packets (how clients interact with the server) for malicious content. So by using these packets, they can basically say \"hey this user was 7 blocks away and trying to hit that entity (entity being a mob, a player, etc...) and will stop that. While Cheating will always have the advantage on these anti-cheat plugins, they can defiantly tone them down a bit, making hacking alot less \"successful\" in its endeavor to ruin a regular players game.\u003cbr\u003e\u003cbr\u003eand all of the Skydoesminecraft Servers do run NoCheatPlus, what i consider the lead in Hack Prevention. A basic List of what NoCheatPlus blocks.\u003cbr\u003e\u003cbr\u003e*Fly hacking (there is a loophole to this, but i will not say in this review, @MyPictures said they will not be checking for a certain kind of slow fall because of the ridiculous effort on NC+ (NoCheatPlus) side just to be able to patch this one thing. but you still take fall damage, so that;s why he does considers this one useless\u003cbr\u003e*Kill aura Reach\u003cbr\u003e*Improbable check (seeing if the user is sprinting while hitting an entity)\u003cbr\u003e*Forced Criticals (while on the ground, dealing damage)\u003cbr\u003e*Speed/Timer Hacks\u003cbr\u003e*NoFall\u003cbr\u003e*Jesus/Dolphin (Basically Water-Walking Hacks)\u003cbr\u003e*And much more!\u003cbr\u003e\u003cbr\u003eNoCheatPlus is used to \"fight the various flaws and exploits in Minecraft\" and they do it quite well.\u003cbr\u003e\u003cbr\u003eA link to NoCheatPlus' dev.bukkit page, incase you want to go check it out yourself and read up on all the things that it blocks!\u003cbr\u003e\u003ca target=\"_blank\" rel=\"nofollow\" href=\"http://dev.bukkit.org/bukkit-plugins/nocheatplus/\"\u003ehttp://dev.bukkit.org/bukkit-plugins/nocheatplus/\u003c/a\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003e---Conclusion---\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eWhile yes, Minecraft hacked clients are a menace, Minecraft hacked clients cannot do what some people believe are possible in game, such as enchanting, hacking accounts, force oping themselves, and all that. Nodus was a big problem because it was famous, and as of 1.6.2 is discontinued, but some people believed that it was the deadliest tool in Minecraft, being able to do things that, quiet frankly, are ridiculously impossible. Client sided hacks, are not able to be stopped by things such as Xray,ESP,tracers and all of those hacks, but the minute the client needs to send packets to the server, you can begin to fight said client in the ways it acts.\u003cbr\u003e\u003cbr\u003eWhile some hacks are possible, such as those of Killaura/Forcefield, Mini-Jump Criticals, flight, Nuker, Tracers/ESP, Sprint, and all of those ones i listed, it is NOT possible for the things i have listed under unable to be possible to be done, without the assistance from the server itself (which requires OP status on a server, or a poisoned plugin, as mentioned)\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e-Thanks for reading, hope you actually learned something :)\u003c/span\u003e\u003ca target=\"_blank\" rel=\"nofollow\"\u003e\u003c/a\u003e\u003c/span\u003e","body_tagged":"\u003cspan\u003e\u003cspan\u003eSo as the thread title says, we are going to be doing a bit of \"myth-busting\" regarding hacked clients. To any educated human being, things like this *should* be apparent, but anyway I shall continue on.\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003eBackground\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eThis is just some background as to why I'm doing this. People in chat all the time say \"Omg he 1 hit me, he hacks\" or \"He has diamond armor as a recruit, he haxs.\" Now, i know, this is just a young one who doesn't know much about what is and is not possible on a Minecraft Multiplayer Bukkit Server. It is just quite sickening, getting the same thing over and over in chat, its like a broken record and quiet honestly ruins the fun on a server when that's all you read.\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003eWhat is a hacked client?\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eA Minecraft \"hacking\" client as they are called, are used to gain a Variety of advantages over other players, through the use of malicious mods, that most call \"hacks\". Such hacks include BUT are not limited to\u003cbr\u003e\u003cbr\u003e\u003cb\u003eKill-Aura\u003c/b\u003e\u0026nbsp;- Better known from the hacked client Nodus as Force-field. This is an auto-attacking hack, being able to hit out of range of normal distance, and at speeds not possible.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eNuker\u0026nbsp;\u003c/b\u003e- Basically an auto-block breaker, but breaks blocks at a faster rate.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eSprint \u003c/b\u003e-\u0026nbsp;\u0026nbsp;While not all people who sprint hack, if they stand still, or constantly sprint (as in stop-go motions) this is apparent. This sprint while not technically game breaking, can be used for laziness and also to gain a speed boost (in Nodus their is a sprint mode for fast, which makes your run slightly faster than normally possible)\u003cbr\u003e\u003cbr\u003e\u003cb\u003eCriticals\u0026nbsp;\u003c/b\u003e- This hack is quite hard to detect at most times, but is apparent if the user always deals Critical hits while barely jumping or even not jumping at all. Nodus never had this feature, so it was nothing they never needed to worry about.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eNoKnockback\u0026nbsp;\u003c/b\u003e- If you cant guess what this is, the user does not take any knockback damage when hit. Pretty obvious.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eFullbright\u0026nbsp;\u003c/b\u003e-\u0026nbsp;Makes it so their is no darkness\u003cbr\u003e\u003cbr\u003e\u003cb\u003eXray\u0026nbsp;\u003c/b\u003e- Renders only ores user wants to see, mainly used for finding diamonds or chests.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eTracers/ESP\u0026nbsp;\u003c/b\u003e- Draws a line from user to a player from the middle of the users curser. and ESP just highlights a box around other players.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eNameTags\u0026nbsp;\u003c/b\u003e- Makes name tags bigger for the user to find players easier.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eTeleport hack -\u0026nbsp;\u003c/b\u003e\u0026nbsp;Teleports user to a specific area that was designated ***PATCHED BY BUKKIT AROUND 1.3***\u003cbr\u003e\u003cbr\u003e\u003cb\u003eGodmode\u0026nbsp;\u003c/b\u003e- ERMERGERD WUT? Not what your thinking, with godmode, once toggled, your player is frozen in place, and just sends keepAlive packets to the server and denys hit packets. Luckily, NoCheatPlus caught up and patched this hack, so even toggleing this, the user will be frozen, and will take hits every few seconds if continuously hit.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eRegen\u0026nbsp;\u003c/b\u003e- This hack practically makes someone invulnerable. It acts as a fast-heal and heals the player when not hit. NC+ has affectively blocked this hack, but at one point it was possible.Mainly Private clients had this, and was not a big feature in Nodus or any Public client until up and around 1.5.2, at which point, the hack was blocked.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eNoSlowDown\u0026nbsp;\u003c/b\u003e- This hack is not actually a Sprint hack and what your seeing is Nodus Sprint hack (as I've explained Nodus keeps you running). NoSlowdown is Bassicly not slowing down for Cobwebs, in water, or on soul sand. This hack is indeed nerfed, so even using it, you throw checks by NC+. The Sprint and hit is also blocked by NC+ under the \"Improbable: player has failed the improbable more than expected\" check.\u003cbr\u003e***Thanks Source_Of_Storms for this hack inclusion!***\u003cbr\u003e\u003cbr\u003e\u003cb\u003eVClip \u003c/b\u003e- The short name for Vertical clipping, is bassicly like a NoClip but only on the Y axis. This worked for quiet some time on bukkit servers without NC+ but is since patched by both NC+ and the Bukkit server itself, setting an alert off that a player made an illegal movement. This hack used to be used to clip into peoples bases, steal their items, and leave.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eFreecam\u0026nbsp;\u003c/b\u003e- This acts as an \"out of body experience\" allowing the player to fly/wander around within their render distance without actually moving or being known that they are their. Sadly this is unpatchable as it is all client sided. This in conjunction to cavefinder helps hackers find bases.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eStep\u0026nbsp;\u003c/b\u003e- This hack allows players to hop up one high blocks without clicking the space bar. This hack was patched within the Nodus client, but other clients that have it have a somewhat bypass to it. Though slightly useless this hack allows players to gain a slight upperhand while climbing long hills.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eWaypoints\u0026nbsp;\u003c/b\u003e- This hack allows the hacker to pinpoint an area and have a client sided tracer (sometimes designated with a specific color) added while this hack is enabled, allowing them to easily find where they are going.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eFastplace and Speedmine\u0026nbsp;\u003c/b\u003e- Im going to kill two birds with one stone on this one. These two hacks do exactly what they say, enable the player to fastly placed blocks (somewhat checked by NoCheatPlus!) and SpeedMine, which allows players to break blocks slightly faster than the normal. Vanilla has blocked the ability to speedmine to an extent, and in conjunction with NoCheatPlus, makes speedmine pretty much patched (hackers are still able to break blocks faster, depending on their minespeed they set, but eventually is caught by how NoCheatPlus handles the check, which is check minespeed over X ammount of blocks and comparing it to what should normally happen.)\u003cbr\u003eSneak- This hack allows the player to be sneaking, but move at normal speed. NC+ has patched this version of sneak, and the only other sneak makes it like your holding sneak, sort of like the Better Sprint Mod, but with sneak. The \"bypassed\" version is unpatchable as its simple just making you hold shift when your not, while the other NC+ blocks because of the fact you move faster then you should be, falling under their speedhack check.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eSTP\u0026nbsp;\u003c/b\u003e\u0026nbsp;- This hack is a new one, that is quite interesting to say the least. The Initials stand for \"SpawnTeleport\" and does such. I'm not sure about the inner workings of this one, but at the moment, when a player types that in as \".stp\" in a client, it will kick the player for the message \"Nope!\" and spawn them back at the spawn point. This doesn't seem like such a big deal, except it bypasses PvP logging plugins and makes the timer for teleportation useless.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eBowAimbot\u003c/b\u003e\u0026nbsp;- This hack takes advanced calculations into effect, importing the equation the vanilla minecraft gives for Projectiles, and makes it so you lock on to an entity, then aim just the right amount above them to beable to hit them (in Nodus it was silent, so it just kind of did its own thing). This hack is one of the more useless ones suprisingly, because moving around completely breaks this, along with the fact that the Aimbot included in such hacks, aim for the middle of an entity, so hidding partially behind a block breaks this hack also.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eDerp/Retard Mode\u003c/b\u003e\u0026nbsp;- This hack is one that makes your player go all well... retarded. It sends random hit/look packets to make your player \"spaz out\" (on everyone elses screen) but on your screen it looks normal. There are versions of this hack that are specific, Such as: turning your head inside out, Stare (Ingame you will be looking one way, but on your screen your not) and ones that just make you \"spaz out\" for lack of a better term. This hack really is not game breaking, and is more of a \"why not\" kind of hack, and can be easily replicated without the use of Nodus or any other client that has a retard mode in it.\u003cbr\u003e*** Thanks to DystopianCupcake for this hack inclusion!***\u003cbr\u003e\u003cbr\u003e\u003cb\u003eEnderport\u003c/b\u003e\u0026nbsp;- This hack I personally have only seen in one client, and it made it so when you got hit (or were about to get hit, something along those lines) you would be teleported behind said player. This hack is mainly a PvP hack, and i would assume NoCheatPlus blocks this hack, because of the teleportation part of the hack.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eLSD\u003c/b\u003e\u0026nbsp;- This hack is client-sided and makes your screen go all crazy, whether its just making the screen flash different colors, to zooming in randomly/crazily, to actually changing the colors of blocks themselves randomly. This hack is pure uesless and is mainly added because developers of clients get bored and want to add something stupid in.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eRadar \u003c/b\u003e- This hack allows players to know where other players are (assuming said player is within Render Distance of the user!) and know exactly how far away they are. This hack would be sort of game-breaking because of the fact if your hiding, they would know where you are, and how to locate say a base of some sort. There is no practical way to patch this, as its just getting entitys within the renderdistance and getting the location of said players\u003cbr\u003e\u003cbr\u003e\u003cb\u003eNametags\u003c/b\u003e\u0026nbsp;- This hack (mainly seen within Nodus, but can be seen in other clients) allows the user to know where other players are by increasing nametag size, so you can see their nametag outside of Vanilla range. Most Nametags have a built in option that shows if the player is sneaking (by changing their nametag to say red (or something along those lines). This, like radar, is practically unpatchable because it is client sided and theres not much you can do about that.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eCreative Control -\u003c/b\u003e Imagine this as bassicly automated destruction. What this does is allow people to select two areas to create a region, and makes the player automatically destroy everything in that area until that area becomes air. This hack doesn't bypass NC+ in the one client that it is in at the moment so their is no reason to fear it.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eInvsee\u0026nbsp;\u003c/b\u003e- Normally a moderation tool, lately clients have been able to tweak the system and gain access to what players have in there hand and what they area wearing ( so instead of seeing someone in enchanted diamond, and he says he has full IV and a sharp V sword) said player can .invsee him and see what his sword, and his armor really hold. The thing about this, is that it does not allow people to see what is in the rest of the inventory, only what the server sends to the client (so in laymans terms, what they are holding, and their armor)\u003cbr\u003e\u003cbr\u003e\u003cb\u003eAutosoup\u0026nbsp;\u003c/b\u003e- With the addition of your KitPvP server, i thought this would be a great thing to add, so people know what to watch for, though if im incorrect, you guys had the plugin the entire time. Anyway, this hack allows players to bassicly do nothing and beable to fight as the client soups for them, making them have a HUGE advantage over normal players. This hack is pretty easy to detect as if a moderator /invsee's you it will show your soup being used from your inventory. This hack allows players on a KitPvP server with soup to become practically unkillable, and is normally combined with Killaura and an Autosword/Autotool to become a killing machine. its quite easy to notice because if you go up and hit someone and they instantly soup, you can assume they are using the hack.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eTeleportation V2\u003c/b\u003e: Recently through the hacking community people have found a simple way to bypass the way Bukkit/NoCheat patched teleportation. Needless to say NoCheat blocked this method (as thy do) but its still out there. They did this by placing a boat and sending the teleportation packet then instantly breaking the boat they were in. Recommended update of NC+ to newest version ASAP.\u003cbr\u003e\u003cbr\u003e\u003cb\u003eTrigger Bot\u003c/b\u003e\u0026nbsp;- This hack is pretty much a \"legit\" kill aura. It will only attack players your crosshair is looking at, unlike the most killauras, it will not attack surrounding players.\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003eExploits\u003cbr\u003e\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cb\u003eFaction Finding Exploit\u003c/b\u003e: Yes, there is one, and yes, it is opperational. I actually know quite a bit about this exploit, but I won't be going over much of the specifics other than this exploit allows for quick teleportation to around the map while using the /f map function of factions to be able to map out factions VERY quickly.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003e---What Hacked Clients Cannot Do---\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eGiven certain circumstances are true, yes a hacked client can spawn items in (if the player is OP'ed and so on and so forth, but for this example, we will be using Recruits or the Default rank of a server)\u003cbr\u003e\u003cbr\u003e\u003cb\u003e*Force-Op\u0026nbsp;\u003c/b\u003e- No, their is no such thing as a force-op hack, but with the assistance of a poisoned plug-in (a plug-in that was coded and designed to read chat messages, so for example if i had a plugin that reads chat for #opme and i say that, the plugin will run the command, but other than that, you cannot just force op your name on that) Notch made sure of that.\u003cbr\u003e\u003cbr\u003e\u003cb\u003e*Spawn items in hack\u0026nbsp;\u003c/b\u003e- While there are mods like TMI, NEI, CJB and all those good things, that allow for a quick select of blocks to be spawned in, each one requires Operator status on a minecraft server, because they are simply macros for the command /give (insert player name) (insert id that was clicked on) (insert amount) *default 64 stack*\u003cbr\u003e\u003cbr\u003e\u003cb\u003e*Enchantment Hack\u003c/b\u003e - This one is a bit rough. Yes, there are actually enchantment hacks out there, but they all require Creative mode to use, mainly because of the way Creative works you can do whatever you want to an item, however you want. In Vanilla/Bukkit Survival Multiplayer no, its not possible to use an enchantment hack. Sorry fellas :c\u003cbr\u003e\u003cbr\u003e\u003cb\u003e*One Hit hack\u0026nbsp;\u003c/b\u003e- Ah the infamous 1 hit hack. No, such thing is not possible, as damage is dealt server-side or as MyPictures (one othe the developers of NoCheatPlus) has called it, The \"safe\" side. The server will deny any attempt to deal more damage than possible, though there is an exploit roaming around about forcing and enchant through, alas, you need creative to be able to do that, as stated above in the enchantment hack portion of this sub-section\u003cbr\u003e\u003cbr\u003e\u003cb\u003e*Reach Hack\u0026nbsp;\u003c/b\u003e- This one is Iffy. Yes, a client can take advantage that the fact Bukkit only checks if the player is within about 6 blocks of an entity before hitting/interacting. but NC+ has knocked that range down to about 4.25 blocks (this is due to accounting for lag) while the vanilla fight distance i believe is at 3.5 blocks. While it is an advantage, heres the question, would you rather be whacked at 6 blocks, or 4.25 where you still have a chance. I know i would choose the latter option...\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003e---Hack Detection (by the player)---\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eMost players accuse other players of hacking for doing something out of the normal, fair enough... But what can really prove a player hacking? I have seen multiple screen-shots on this website with Screenshots, saying the user is using Aim bot/FF. Now, hold up now! a Screenshot wouldn't be enough to prove that, a video would be more appropriate.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003e---Evidence---\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\u003cb\u003eScreenshots\u0026nbsp;\u003c/b\u003e- While screenshots of Fly hacks and of Sprint hacks would be easy to point out, pictures of Kill Aura/Aimbot (as i said above) are pretty pointless because its just a player hitting you, and even if said player is out of range, who;s to say they didn't swing their arm, and you got hit from the back?\u003cbr\u003e\u003cbr\u003e\u003cb\u003eThe Skype Method\u0026nbsp;\u003c/b\u003e- Aka Screen share me. Everybody thinks by that looking on someones screen, and looking for that one button that says \"Disable Nodus\" can prove people as hackers. Their are plenty of other clients out there (Weepcraft, Kinky/Xenon, Huzuni) that are run off of chat based commands (like saying .friend add in chat would not pop up in chat, but would return client sided for that one player and he would be able to use the hacked client that way. Now your thinking, OK so he screen shares me and i have him type .help or something... *WRONG*. While this may catch some un-thinking hackers, such as the 12 year old's that use clients, some clients change command prefix's when you enter .legit mode, making it that much harder to be able to detect, and let alone that, .legit mode practically deletes any trace of there ever being a hacked client by simply looking on the screen.\u003cbr\u003e\u003cbr\u003eWhile your attempt at weeding out the hacker that way would be successful for two clients (Weepcraft and Nodus) the only sure fire way to check, would be (while they are connected to the server at the time of questioning) make sure they do not disconnect, and have them show you there .bin folder for any sort of folder labeled differently than you would normally see.\u003cbr\u003eThis folder will be called the clients name, so if a user has used Nodus, Weepcraft, Proximity, Cobalt and Huzuni there will be folders in there called \"Nodus\" \"WeepCraft\" \"Proximity\" \"Cobalt\" and \"Huzuni\"\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003e---Hack Prevention---\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eAh, what stops these hacked clients from running around and terrorizing us on the server D: . Well my good fellow readers if you made it to this point, Hack Prevention on Vanilla Minecraft was implemented (poorly, but was still implemented) and even Bukkit does not patch minor hacks as they quote on quote \"don't want to become the anti-cheat solution.\" Fear not though! NoCheatPlus, AntiCheat, and a private plug-in called KNoHaxs are out there to stop hackers in their track! While not perfect, they act as filters by the packets (how clients interact with the server) for malicious content. So by using these packets, they can basically say \"hey this user was 7 blocks away and trying to hit that entity (entity being a mob, a player, etc...) and will stop that. While Cheating will always have the advantage on these anti-cheat plugins, they can defiantly tone them down a bit, making hacking alot less \"successful\" in its endeavor to ruin a regular players game.\u003cbr\u003e\u003cbr\u003eand all of the Skydoesminecraft Servers do run NoCheatPlus, what i consider the lead in Hack Prevention. A basic List of what NoCheatPlus blocks.\u003cbr\u003e\u003cbr\u003e*Fly hacking (there is a loophole to this, but i will not say in this review, @MyPictures said they will not be checking for a certain kind of slow fall because of the ridiculous effort on NC+ (NoCheatPlus) side just to be able to patch this one thing. but you still take fall damage, so that;s why he does considers this one useless\u003cbr\u003e*Kill aura Reach\u003cbr\u003e*Improbable check (seeing if the user is sprinting while hitting an entity)\u003cbr\u003e*Forced Criticals (while on the ground, dealing damage)\u003cbr\u003e*Speed/Timer Hacks\u003cbr\u003e*NoFall\u003cbr\u003e*Jesus/Dolphin (Basically Water-Walking Hacks)\u003cbr\u003e*And much more!\u003cbr\u003e\u003cbr\u003eNoCheatPlus is used to \"fight the various flaws and exploits in Minecraft\" and they do it quite well.\u003cbr\u003e\u003cbr\u003eA link to NoCheatPlus' dev.bukkit page, incase you want to go check it out yourself and read up on all the things that it blocks!\u003cbr\u003e\u003ca target=\"_blank\" rel=\"nofollow\" href=\"http://dev.bukkit.org/bukkit-plugins/nocheatplus/\"\u003ehttp://dev.bukkit.org/bukkit-plugins/nocheatplus/\u003c/a\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cb\u003e\u003cu\u003e---Conclusion---\u003c/u\u003e\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eWhile yes, Minecraft hacked clients are a menace, Minecraft hacked clients cannot do what some people believe are possible in game, such as enchanting, hacking accounts, force oping themselves, and all that. Nodus was a big problem because it was famous, and as of 1.6.2 is discontinued, but some people believed that it was the deadliest tool in Minecraft, being able to do things that, quiet frankly, are ridiculously impossible. Client sided hacks, are not able to be stopped by things such as Xray,ESP,tracers and all of those hacks, but the minute the client needs to send packets to the server, you can begin to fight said client in the ways it acts.\u003cbr\u003e\u003cbr\u003eWhile some hacks are possible, such as those of Killaura/Forcefield, Mini-Jump Criticals, flight, Nuker, Tracers/ESP, Sprint, and all of those ones i listed, it is NOT possible for the things i have listed under unable to be possible to be done, without the assistance from the server itself (which requires OP status on a server, or a poisoned plugin, as mentioned)\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e-Thanks for reading, hope you actually learned something :)\u003c/span\u003e\u003ca target=\"_blank\" rel=\"nofollow\"\u003e\u003c/a\u003e\u003c/span\u003e","created_at":"2014/08/10 04:52:40 +0000","created_at_human":"August 10, 2014 at  4:08 AM UTC","title":"Myth Busting: Hackers","replies":[{"id":60293,"unique_id":"60293-2929","author":{"id":8056,"username":"Xvius","avatar":"https://crafatar.com/avatars/477c4aa7b68d442186fd8523e5033962?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Actually, can someone move this heap of words into another discussion section. Thanks","body_tagged":"Actually, can someone move this heap of words into another discussion section. Thanks","created_at":"2014/08/10 04:54:41 +0000","created_at_human":"August 10, 2014 at  4:08 AM UTC"},{"id":60295,"unique_id":"60295-2615","author":{"id":62,"username":"BOSS_Turtle98","avatar":"https://crafatar.com/avatars/9bd206b142a24b478d96bb7effaa01f3?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Wow, that's quite the wall of text there. Too bad\u0026nbsp;just about all\u0026nbsp;of the players that need this guide will never read it. :c","body_tagged":"Wow, that's quite the wall of text there. Too bad\u0026nbsp;just about all\u0026nbsp;of the players that need this guide will never read it. :c","created_at":"2014/08/10 04:55:22 +0000","created_at_human":"August 10, 2014 at  4:08 AM UTC"},{"id":60297,"unique_id":"60297-2236","author":{"id":8056,"username":"Xvius","avatar":"https://crafatar.com/avatars/477c4aa7b68d442186fd8523e5033962?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Ok","body_tagged":"Ok","created_at":"2014/08/10 04:57:33 +0000","created_at_human":"August 10, 2014 at  4:08 AM UTC"},{"id":60304,"unique_id":"60304-2046","author":{"id":233565,"username":"Netuxx","avatar":"https://crafatar.com/avatars/6b6a0b197b5f48a1bc24e99492865be3?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"I read almost all and wow. It's perfect.\u003cbr\u003eThe format is quite poor but keeps being really awesome and seems like you take your time for it. You should make a Guide at the top of the page =)","body_tagged":"I read almost all and wow. It's perfect.\u003cbr\u003eThe format is quite poor but keeps being really awesome and seems like you take your time for it. You should make a Guide at the top of the page =)","created_at":"2014/08/10 05:31:18 +0000","created_at_human":"August 10, 2014 at  5:08 AM UTC"},{"id":60306,"unique_id":"60306-700","author":{"id":98,"username":"ImJeezus","avatar":"https://crafatar.com/avatars/20985d4520c145f7a7e9daeaf7c08c2e?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"You missed Click Aimbot, BreadCrumb, Spider, and Glide.\u003cbr\u003eEdit: Also FastConsume","body_tagged":"You missed Click Aimbot, BreadCrumb, Spider, and Glide.\u003cbr\u003eEdit: Also FastConsume","created_at":"2014/08/10 05:40:43 +0000","created_at_human":"August 10, 2014 at  5:08 AM UTC"},{"id":60312,"unique_id":"60312-3036","author":{"id":19112,"username":"Numberz_","avatar":"https://crafatar.com/avatars/e16d067223c74a02bd22965e38521c35?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"What is BreadCrumb?","body_tagged":"What is BreadCrumb?","created_at":"2014/08/10 06:01:53 +0000","created_at_human":"August 10, 2014 at  6:08 AM UTC","reply_to":{"id":60306,"unique_id":"60306-3318","author":{"id":98,"username":"ImJeezus","avatar":"https://crafatar.com/avatars/20985d4520c145f7a7e9daeaf7c08c2e?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"You missed Click Aimbot, BreadCrumb, Spider, and Glide.\u003cbr\u003eEdit: Also FastConsume","body_tagged":"You missed Click Aimbot, BreadCrumb, Spider, and Glide.\u003cbr\u003eEdit: Also FastConsume","created_at":"2014/08/10 05:40:43 +0000","created_at_human":"August 10, 2014 at  5:08 AM UTC"}},{"id":60314,"unique_id":"60314-1396","author":{"id":223106,"username":"Porkyyy","avatar":"https://crafatar.com/avatars/028806860da44ac3a62343369c73afb1?helm\u0026size=$SIZE$","color":"Gray","staff":true},"body":"It makes a trail after you wherever you go, so that you never get lost, and always find your way back to where you want to be.","body_tagged":"It makes a trail after you wherever you go, so that you never get lost, and always find your way back to where you want to be.","created_at":"2014/08/10 06:03:49 +0000","created_at_human":"August 10, 2014 at  6:08 AM UTC","reply_to":{"id":60312,"unique_id":"60312-727","author":{"id":19112,"username":"Numberz_","avatar":"https://crafatar.com/avatars/e16d067223c74a02bd22965e38521c35?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"What is BreadCrumb?","body_tagged":"What is BreadCrumb?","created_at":"2014/08/10 06:01:53 +0000","created_at_human":"August 10, 2014 at  6:08 AM UTC"}},{"id":60322,"unique_id":"60322-2041","author":{"id":318990,"username":"Puffhand","avatar":"https://crafatar.com/avatars/3bef140d2a1e46d1a425a9ae241fcd9b?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"You decided to write an essay.","body_tagged":"You decided to write an essay.","created_at":"2014/08/10 06:13:33 +0000","created_at_human":"August 10, 2014 at  6:08 AM UTC"},{"id":60323,"unique_id":"60323-1988","author":{"id":2083,"username":"HereIwas","avatar":"https://crafatar.com/avatars/d27dd245a0cd47ea90516cd075354cdc?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"I am not reading this,,. please i am not a good reader...\u003cbr\u003ewhy, indeed yes.","body_tagged":"I am not reading this,,. please i am not a good reader...\u003cbr\u003ewhy, indeed yes.","created_at":"2014/08/10 06:14:28 +0000","created_at_human":"August 10, 2014 at  6:08 AM UTC"},{"id":60324,"unique_id":"60324-2371","author":{"id":110770,"username":"Kels","avatar":"https://crafatar.com/avatars/3068b01d45fc4e8f9340ab3b77c85546?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"A popular hacked client is a kronos, a hacked client that includes crit hacks.","body_tagged":"A popular hacked client is a kronos, a hacked client that includes crit hacks.","created_at":"2014/08/10 06:18:17 +0000","created_at_human":"August 10, 2014 at  6:08 AM UTC"},{"id":60331,"unique_id":"60331-476","author":{"id":4479,"username":"Riskayyy","avatar":"https://www.gravatar.com/avatar/b7153466dc6a08f9f2ee06648e9c440c?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"Do I have permission to make the OP readable in terms of layout?","body_tagged":"Do I have permission to make the OP readable in terms of layout?","created_at":"2014/08/10 06:31:21 +0000","created_at_human":"August 10, 2014 at  6:08 AM UTC"},{"id":60376,"unique_id":"60376-756","author":{"id":8056,"username":"Xvius","avatar":"https://crafatar.com/avatars/477c4aa7b68d442186fd8523e5033962?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Sorry guys, I forgot to put the main words into bold. It maybe hard to read for some of people. Thanks.","body_tagged":"Sorry guys, I forgot to put the main words into bold. It maybe hard to read for some of people. Thanks.","created_at":"2014/08/10 09:03:09 +0000","created_at_human":"August 10, 2014 at  9:08 AM UTC"},{"id":60377,"unique_id":"60377-3807","author":{"id":8056,"username":"Xvius","avatar":"https://crafatar.com/avatars/477c4aa7b68d442186fd8523e5033962?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"jozzmccozz yes","body_tagged":"jozzmccozz yes","created_at":"2014/08/10 09:03:36 +0000","created_at_human":"August 10, 2014 at  9:08 AM UTC"},{"id":60510,"unique_id":"60510-3804","author":{"id":9529,"username":"Buster_U","avatar":"https://crafatar.com/avatars/d8af9a92cc854eb091a187669a2136a6?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"This just got Busted ;o Soz I had to say that.","body_tagged":"This just got Busted ;o Soz I had to say that.","created_at":"2014/08/10 12:56:51 +0000","created_at_human":"August 10, 2014 at 12:08 PM UTC"},{"id":60557,"unique_id":"60557-1727","author":{"id":8056,"username":"Xvius","avatar":"https://crafatar.com/avatars/477c4aa7b68d442186fd8523e5033962?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Ikr, it's like biohazard. Wtf? I don't even know. I'm busted.","body_tagged":"Ikr, it's like biohazard. Wtf? I don't even know. I'm busted.","created_at":"2014/08/10 14:37:49 +0000","created_at_human":"August 10, 2014 at  2:08 PM UTC"},{"id":60565,"unique_id":"60565-1768","author":{"id":347312,"username":"_Phyre","avatar":"https://www.gravatar.com/avatar/40d193e564da54887a49bb1cc7e65dc6?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"Idk why they have full bright... if they are 5 year olds who dont know Gamma in your MC settings, then yes........ But u can turn gamma on...\u003cbr\u003e\u003cbr\u003ePopular hacked clients:\u003cbr\u003e1.Nodus (Forgoten)\u003cbr\u003e2.Huzuni\u003cbr\u003e3.Kronos\u003cbr\u003e4.SIGMA\u003cbr\u003e5. Yodus (Better than Nodus)","body_tagged":"Idk why they have full bright... if they are 5 year olds who dont know Gamma in your MC settings, then yes........ But u can turn gamma on...\u003cbr\u003e\u003cbr\u003ePopular hacked clients:\u003cbr\u003e1.Nodus (Forgoten)\u003cbr\u003e2.Huzuni\u003cbr\u003e3.Kronos\u003cbr\u003e4.SIGMA\u003cbr\u003e5. Yodus (Better than Nodus)","created_at":"2014/08/10 14:43:23 +0000","created_at_human":"August 10, 2014 at  2:08 PM UTC"},{"id":60595,"unique_id":"60595-2353","author":{"id":376928,"username":"WordlessGeek","avatar":"https://crafatar.com/avatars/7951d6914a8c404cbf9cb26c7d0b7db2?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"No such thing as teleportation hacking.","body_tagged":"No such thing as teleportation hacking.","created_at":"2014/08/10 15:13:02 +0000","created_at_human":"August 10, 2014 at  3:08 PM UTC"},{"id":60660,"unique_id":"60660-1300","author":{"id":233565,"username":"Netuxx","avatar":"https://crafatar.com/avatars/6b6a0b197b5f48a1bc24e99492865be3?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"I forget to say there is a hack called RapidFire that shots instantly arrows with higher velocity. I have seen this like 3 times.","body_tagged":"I forget to say there is a hack called RapidFire that shots instantly arrows with higher velocity. I have seen this like 3 times.","created_at":"2014/08/10 16:20:31 +0000","created_at_human":"August 10, 2014 at  4:08 PM UTC"},{"id":60769,"unique_id":"60769-4544","author":{"id":342908,"username":"resepignev","avatar":"https://www.gravatar.com/avatar/75bbb65651fdf39379295c23e9a242d7?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"There is an new hacked client :O It's called \"Flare\". It's like Nodus but better (I don't use this, I only saw the GUI.)","body_tagged":"There is an new hacked client :O It's called \"Flare\". It's like Nodus but better (I don't use this, I only saw the GUI.)","created_at":"2014/08/10 18:07:20 +0000","created_at_human":"August 10, 2014 at  6:08 PM UTC"},{"id":60774,"unique_id":"60774-3192","author":{"id":354547,"username":"BoldAndBrash","avatar":"https://crafatar.com/avatars/5a0b55defddb448caf5070856cbf39ee?helm\u0026size=$SIZE$","color":"Gray","staff":true},"body":"Mineverse \u0026nbsp;has 80 people using that every day in op pvp....","body_tagged":"Mineverse \u0026nbsp;has 80 people using that every day in op pvp....","created_at":"2014/08/10 18:10:34 +0000","created_at_human":"August 10, 2014 at  6:08 PM UTC","reply_to":{"id":60660,"unique_id":"60660-2571","author":{"id":233565,"username":"Netuxx","avatar":"https://crafatar.com/avatars/6b6a0b197b5f48a1bc24e99492865be3?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"I forget to say there is a hack called RapidFire that shots instantly arrows with higher velocity. I have seen this like 3 times.","body_tagged":"I forget to say there is a hack called RapidFire that shots instantly arrows with higher velocity. I have seen this like 3 times.","created_at":"2014/08/10 16:20:31 +0000","created_at_human":"August 10, 2014 at  4:08 PM UTC"}},{"id":60779,"unique_id":"60779-1795","author":{"id":247917,"username":"puffytrn5751","avatar":"https://crafatar.com/avatars/bcda6b30a2fb41b3b291a32374c543a7?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"took\u0026nbsp;a while to read, but was very useful(:","body_tagged":"took\u0026nbsp;a while to read, but was very useful(:","created_at":"2014/08/10 18:12:12 +0000","created_at_human":"August 10, 2014 at  6:08 PM UTC"},{"id":60783,"unique_id":"60783-3478","author":{"id":342908,"username":"resepignev","avatar":"https://www.gravatar.com/avatar/75bbb65651fdf39379295c23e9a242d7?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"I saw someone using this on Avicus. I reported him, the reason was \"looks like he is using a machine gun\" :D It was quite funny. Killerbye was coming and asked me a\u0026nbsp;machine gun? I showed him the player and banned him for \"machine gun hacks\" :D","body_tagged":"I saw someone using this on Avicus. I reported him, the reason was \"looks like he is using a machine gun\" :D It was quite funny. Killerbye was coming and asked me a\u0026nbsp;machine gun? I showed him the player and banned him for \"machine gun hacks\" :D","created_at":"2014/08/10 18:17:39 +0000","created_at_human":"August 10, 2014 at  6:08 PM UTC","reply_to":{"id":60660,"unique_id":"60660-2964","author":{"id":233565,"username":"Netuxx","avatar":"https://crafatar.com/avatars/6b6a0b197b5f48a1bc24e99492865be3?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"I forget to say there is a hack called RapidFire that shots instantly arrows with higher velocity. I have seen this like 3 times.","body_tagged":"I forget to say there is a hack called RapidFire that shots instantly arrows with higher velocity. I have seen this like 3 times.","created_at":"2014/08/10 16:20:31 +0000","created_at_human":"August 10, 2014 at  4:08 PM UTC"}},{"id":61509,"unique_id":"61509-4490","author":{"id":8056,"username":"Xvius","avatar":"https://crafatar.com/avatars/477c4aa7b68d442186fd8523e5033962?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"LOL","body_tagged":"LOL","created_at":"2014/08/11 12:14:20 +0000","created_at_human":"August 11, 2014 at 12:08 PM UTC"},{"id":61527,"unique_id":"61527-449","author":{"id":3845,"username":"Sphrynax","avatar":"https://crafatar.com/avatars/97eb98011f844c6e87bc85e3afe32adc?helm\u0026size=$SIZE$","color":"#5D5D5D","staff":false},"body":"ermagerd, wat did I just read.\u003cbr\u003e\u003cbr\u003e0_0\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eBootiful.","body_tagged":"ermagerd, wat did I just read.\u003cbr\u003e\u003cbr\u003e0_0\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eBootiful.","created_at":"2014/08/11 12:49:23 +0000","created_at_human":"August 11, 2014 at 12:08 PM UTC"},{"id":61533,"unique_id":"61533-1222","author":{"id":209312,"username":"KalinD","avatar":"https://crafatar.com/avatars/1b0be911c39a4f9cb0689160b9b14895?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Nice work m8!","body_tagged":"Nice work m8!","created_at":"2014/08/11 13:10:56 +0000","created_at_human":"August 11, 2014 at  1:08 PM UTC"},{"id":61536,"unique_id":"61536-4663","author":{"id":347312,"username":"_Phyre","avatar":"https://www.gravatar.com/avatar/40d193e564da54887a49bb1cc7e65dc6?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"Ahem.... Reach hacks are not a thing.............\u003cbr\u003eAnd the only reach you can assign is Kill aura of the distance you want the kill aura to hit... Other than that they dont exist","body_tagged":"Ahem.... Reach hacks are not a thing.............\u003cbr\u003eAnd the only reach you can assign is Kill aura of the distance you want the kill aura to hit... Other than that they dont exist","created_at":"2014/08/11 13:14:22 +0000","created_at_human":"August 11, 2014 at  1:08 PM UTC"},{"id":61974,"unique_id":"61974-33","author":{"id":4922,"username":"FileDotZip","avatar":"https://crafatar.com/avatars/0f1d97e8df0843269cbeaba49343b2e3?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Well well well, now it seems we have some players who know quite alot about different hacks. Care to explain? xD jk","body_tagged":"Well well well, now it seems we have some players who know quite alot about different hacks. Care to explain? xD jk","created_at":"2014/08/12 03:26:33 +0000","created_at_human":"August 12, 2014 at  3:08 AM UTC"},{"id":61988,"unique_id":"61988-2160","author":{"id":6361,"username":"Emmaye","avatar":"https://www.gravatar.com/avatar/abed267c620d5e6347952892f3431f7b?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"Kronos, Weepcraft, Xenon, Nodus, Resilence, Hunzi are all clients.\u003cbr\u003eEDIT- you should include AutoJoin","body_tagged":"Kronos, Weepcraft, Xenon, Nodus, Resilence, Hunzi are all clients.\u003cbr\u003eEDIT- you should include AutoJoin","created_at":"2014/08/12 04:04:44 +0000","created_at_human":"August 12, 2014 at  4:08 AM UTC"},{"id":61996,"unique_id":"61996-4085","author":{"id":342908,"username":"resepignev","avatar":"https://www.gravatar.com/avatar/75bbb65651fdf39379295c23e9a242d7?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"(This is not advertising I think. If yes remove it pls) Look at mchacks, sooo much hacked clients :( I typed in google \"minecraft hacks 1.7.9\" such a shame, why does somebody something.. I mean coding hacked clients?","body_tagged":"(This is not advertising I think. If yes remove it pls) Look at mchacks, sooo much hacked clients :( I typed in google \"minecraft hacks 1.7.9\" such a shame, why does somebody something.. I mean coding hacked clients?","created_at":"2014/08/12 04:50:15 +0000","created_at_human":"August 12, 2014 at  4:08 AM UTC","reply_to":{"id":61988,"unique_id":"61988-3573","author":{"id":6361,"username":"Emmaye","avatar":"https://www.gravatar.com/avatar/abed267c620d5e6347952892f3431f7b?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"Kronos, Weepcraft, Xenon, Nodus, Resilence, Hunzi are all clients.\u003cbr\u003eEDIT- you should include AutoJoin","body_tagged":"Kronos, Weepcraft, Xenon, Nodus, Resilence, Hunzi are all clients.\u003cbr\u003eEDIT- you should include AutoJoin","created_at":"2014/08/12 04:04:44 +0000","created_at_human":"August 12, 2014 at  4:08 AM UTC"}},{"id":62030,"unique_id":"62030-3770","author":{"id":6361,"username":"Emmaye","avatar":"https://www.gravatar.com/avatar/abed267c620d5e6347952892f3431f7b?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"ikr +1","body_tagged":"ikr +1","created_at":"2014/08/12 06:19:10 +0000","created_at_human":"August 12, 2014 at  6:08 AM UTC","reply_to":{"id":61996,"unique_id":"61996-3571","author":{"id":342908,"username":"resepignev","avatar":"https://www.gravatar.com/avatar/75bbb65651fdf39379295c23e9a242d7?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"(This is not advertising I think. If yes remove it pls) Look at mchacks, sooo much hacked clients :( I typed in google \"minecraft hacks 1.7.9\" such a shame, why does somebody something.. I mean coding hacked clients?","body_tagged":"(This is not advertising I think. If yes remove it pls) Look at mchacks, sooo much hacked clients :( I typed in google \"minecraft hacks 1.7.9\" such a shame, why does somebody something.. I mean coding hacked clients?","created_at":"2014/08/12 04:50:15 +0000","created_at_human":"August 12, 2014 at  4:08 AM UTC"}},{"id":63193,"unique_id":"63193-4636","author":{"id":59623,"username":"Blackjack_MC","avatar":"https://crafatar.com/avatars/0103f8cdd523452484d438ce2d8bced5?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"lol here's a hacker:\u0026nbsp;\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://www.youtube.com/watch?v=Eli5x6gtgUU\u0026amp;feature=youtu.be\"\u003ehttps://www.youtube.com/watch?v=Eli5x6gtgUU\u0026amp;feature=youtu.be\u003c/a\u003e","body_tagged":"lol here's a hacker:\u0026nbsp;\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://www.youtube.com/watch?v=Eli5x6gtgUU\u0026amp;feature=youtu.be\"\u003ehttps://www.youtube.com/watch?v=Eli5x6gtgUU\u0026amp;feature=youtu.be\u003c/a\u003e","created_at":"2014/08/14 00:25:21 +0000","created_at_human":"August 14, 2014 at 12:08 AM UTC"},{"id":63195,"unique_id":"63195-1341","author":{"id":314055,"username":"DonaldMyTrump","avatar":"https://www.gravatar.com/avatar/5e24b919fc04a2852c070e8c53558c93?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"Post that in the Player Reports section of the forums","body_tagged":"Post that in the Player Reports section of the forums","created_at":"2014/08/14 00:27:18 +0000","created_at_human":"August 14, 2014 at 12:08 AM UTC","reply_to":{"id":63193,"unique_id":"63193-1289","author":{"id":59623,"username":"Blackjack_MC","avatar":"https://crafatar.com/avatars/0103f8cdd523452484d438ce2d8bced5?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"lol here's a hacker:\u0026nbsp;\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://www.youtube.com/watch?v=Eli5x6gtgUU\u0026amp;feature=youtu.be\"\u003ehttps://www.youtube.com/watch?v=Eli5x6gtgUU\u0026amp;feature=youtu.be\u003c/a\u003e","body_tagged":"lol here's a hacker:\u0026nbsp;\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://www.youtube.com/watch?v=Eli5x6gtgUU\u0026amp;feature=youtu.be\"\u003ehttps://www.youtube.com/watch?v=Eli5x6gtgUU\u0026amp;feature=youtu.be\u003c/a\u003e","created_at":"2014/08/14 00:25:21 +0000","created_at_human":"August 14, 2014 at 12:08 AM UTC"}},{"id":63210,"unique_id":"63210-1999","author":{"id":59623,"username":"Blackjack_MC","avatar":"https://crafatar.com/avatars/0103f8cdd523452484d438ce2d8bced5?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"I tried. It was locked.","body_tagged":"I tried. It was locked.","created_at":"2014/08/14 00:58:47 +0000","created_at_human":"August 14, 2014 at 12:08 AM UTC"},{"id":63213,"unique_id":"63213-4442","author":{"id":59623,"username":"Blackjack_MC","avatar":"https://crafatar.com/avatars/0103f8cdd523452484d438ce2d8bced5?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"I needed to do it quickly... I apologize for not doing it correctly... Hopefully the player still gets dealt with...","body_tagged":"I needed to do it quickly... I apologize for not doing it correctly... Hopefully the player still gets dealt with...","created_at":"2014/08/14 00:59:33 +0000","created_at_human":"August 14, 2014 at 12:08 AM UTC"},{"id":63427,"unique_id":"63427-713","author":{"id":8056,"username":"Xvius","avatar":"https://crafatar.com/avatars/477c4aa7b68d442186fd8523e5033962?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Ok guys, Soz. I am new to this forum. I don't realy know which place I'd have to post. I'll try to be more careful.","body_tagged":"Ok guys, Soz. I am new to this forum. I don't realy know which place I'd have to post. I'll try to be more careful.","created_at":"2014/08/14 07:36:09 +0000","created_at_human":"August 14, 2014 at  7:08 AM UTC"}]}