{"username":"Death_Drach","about":"I dislike abusive Mods. So far not one of my Kicks has been legitimate. Powering abusers. The caps one is the only legit reason, but i was probably screaming \"DEFEND THE MONUMENT\", which is juts my way of saying, \"hey, we're loosing, do something, they're at our monument\"\u0026nbsp; The spleefing one, he spleefed me first and i did nothing too annoy him, it was the first 30 seconds of the game and he targetted me, so i chased him around harrassing him, then spleefed him to get revenge, which i would have left it at that, but i was kicked. The \"inappropriate\" is so vague its not even funny. I was discussing gays and their rights without being sexually peverted or rude and abusive, it was a simple discussion/debate/arguement\u0026nbsp; and the mods reason for kicking me after i asked was i said something along the lines of \"Doesn't matter which hand you use, so long as it's firm\" Which i did not say because that is disgusting and rude. Either the mod is high or stupid, because he couldn't even remember what i said \"exactly\" when i asked him to repeat my exact reason for being kicked. \"Inappropriate\" yeah, great reason. Thats like hitler saying i killed 6 million jews because i found the way they dressed was \"Inappropriate\" Learn to justify your actions KooDaLord. Last one says i was kicked for \"swearing\" i didn't swear at all, YOU have a mod names TheDiamondGecko\u0026nbsp;running around kicking people for saying \"gold\" instead of \"butter\" why the hell is he even a mod?!? What are this servers entry requirements?! Because that is pathetic with the last two. Step up your standards, this server used to be a good one.","staff":false,"color":"none","badges":[],"total_kills":"1,750","total_deaths":"1,721","total_pvp_deaths":"1,579","kd":"1.02","pvp_kd":"1.11","credits":"180","time":"3 days","joins":"101","created_at":"2013/11/28 23:12:00 +0000","created_at_human":"November 28, 2013 at 11:11 PM UTC","objective_data":{"Monuments":"65"},"friends":[]}