{"username":"Flebula","about":"Hi, I'm Flebula, but I'm previously known as MiningFlamingo. I decided to edit my short 'about' section and give the viewers an overview of my time on Avicus. I joined Avicus in mid February  of 2014 after not being able to find a server I could really get hooked onto. I stumbled upon this server when my brother (OPTOBAT) found this server when he found the game mode Walls. Back then we just liked to get the same team, light other people's houses on fire, and set traps for other teams. At this point in time we didn't even look at the other game modes, we just joined walls and started trolling. After spending about a week in the holidays just playing Walls, I found this other game mode we all know as Nebula, and this moment escalated some trolling to my Avicus addiction.\r\n\r\n\r\nWhen I joined Nebula, I spent about 2 weeks completely ignoring the chat and just focusing on defending and mid fielding. Like most new players my 'defence' looked more like smothering the monument in wood thinking they wouldn't be about to get to it. One day I decided to pay attention to what was going on in the chat. The first thing I saw was someone telling me that my stats were terrible, and me being confused asked \"How do you know my stats?\". This is where I was lead to forums. Me and OPTOBAT just liked to compare K/D and how many kills we were on for a day, until we decided to check out the forums, and this took my addiction to Avicus and turned it into a love for the community as well.\r\n\r\n","gender":"Male","interests":"Gaming, Avicus and Basketball","team":"Enigmatic","staff":false,"color":"none","badges":[],"total_kills":"7,474","total_deaths":"11,673","total_pvp_deaths":"9,915","kd":"0.64","pvp_kd":"0.75","credits":"7,863","time":"20 days","joins":"1,056","created_at":"2014/02/21 08:02:29 +0000","created_at_human":"February 21, 2014 at  8:02 AM UTC","objective_data":{"Monuments":"201","Controls":"165","Wins":"10","10 Killss":"1","Hills":"3"},"friends":[{"id":3211,"username":"Zedther","avatar":"https://www.gravatar.com/avatar/8788a0350bbb11f2d3d469c3fd1edca5?s=$SIZE$\u0026default=mm","color":"#5D5D5D","staff":false},{"id":120167,"username":"Posighdun","avatar":"https://crafatar.com/avatars/89f514e1f0f549778ddc77ef030a8b46?helm\u0026size=$SIZE$","color":"Gray","staff":true},{"id":222281,"username":"OPTOBAT","avatar":"https://crafatar.com/avatars/502f7dcfb6d94f85a94b97a15b0c951c?helm\u0026size=$SIZE$","color":"none","staff":false},{"id":299351,"username":"Tynvale","avatar":"https://crafatar.com/avatars/2c9372269ed34adc9a0e9747aeee1220?helm\u0026size=$SIZE$","color":"Gray","staff":true},{"id":434231,"username":"Hacktivism","avatar":"https://crafatar.com/avatars/7fc8e143d1394f63a18dcd3d676fb303?helm\u0026size=$SIZE$","color":"#5D5D5D","staff":false}]}