{"username":"FPekee","about":"Hola, mi nombre real es Lucas, vivo en Argentina en la provincia de Buenos Aires, tengo 14 años.El tema de PvP y todas sus ramas que abarca, ya sea: destruye el core, captura la lana, factions, 1v1's y todo lo que tenga que ver con el PvP me ENCANTA.\r\nMi nombre premium en minecraft es FPekee, podria decir que soy un buen pvper, me especializo en el tema de PotPvP, es mi favorito y por lo tanto en lo que mas destaco.\r\nNunca he tenido la oportunidad de pvpear contra los mejores del mundo, pero contra algunos, SI y me ha gustado... ya que es muy dificil conseguir un duelo contra aquellos que se creen muy grandes y nunca aceptan, pero bueno, este es mi perfil y mis stats, espero que sigan mejorando asi como lo vienen asiendo y evitar a toda costa los posibles bans de moderadores y/o administradores inexpertos, de los que abundan.\r\n\r\nHello, my real name is Lucas, I live in Argentina in the province of Buenos Aires, I have 14 years.The theme PvP and all its branches covering either: it destroys the core captures wool, factions, 1v1's and everything that has to do with PvP LOVE me. \r\nMy name in minecraft premium is FPekee, could say I am a good pvper, I specialize in theme PotPvP is my favorite and so what more he stressed. \r\nI have never had the opportunity to pvpear against the best in the world, but against some, SI and liked ... as it is very difficult to get a duel against those who think they're so great and never accept, but hey, this is my profile and my stats, I hope they keep improving as they have so gripping and at all costs avoid possible bans moderators and / or inexperienced managers, of which abound.\r\n\r\nESTAS SON LAS VISITAS A MI PERFIL! / THESE ARE VISITING MY PROFILE!\r\n \r\n                                                          \u003ca href=\"http://www.e-zeeinternet.com/\" target=\"_blank\"\u003e\u003cimg src=\"http://www.e-zeeinternet.com/count.php?    page=1057556\u0026style=blackout\u0026nbdigits=9\" alt=\"HTML Hit Counter\" border=\"0\" \u003e\u003c/a\u003e\u003cbr\u003e\u003ca href=\"http://www.e-zeeinternet.com/\"                                                       title=\"HTML Hit Counter\" target=\"_blank\" style=\"font-family: Geneva, Arial, Helvetica, sans-serif; font-size: 10px; color: #000000; text-decoration: none;\"                                \u003eHTML Hit Counter\u003c/a\u003e\r\n\r\n","gender":"Male","interests":"Musica, Minecraft, PvP, Chicas, Estudios, Trabajo","staff":false,"color":"none","badges":[],"total_kills":"1,360","total_deaths":"349","total_pvp_deaths":"319","kd":"3.9","pvp_kd":"4.26","credits":"0","time":"0 seconds","joins":"0","created_at":"2014/03/10 23:53:30 +0000","created_at_human":"March 10, 2014 at 11:03 PM UTC","objective_data":{},"friends":[]}