{"username":"GlassEden","about":"Hello fellow citizens of the Minecraft universe! I'm SneezingPuppy117 but I'd like it if you would call me Pup or Puppy. \r\n\r\nWell to start things off I guess I'll just mention my kills and deaths... I didn't know I had died that many times and had only a few kills... well this is embarrassing...\r\n\r\nHeh well anyway I'm super excited to be joining you all on the Avicus network and very much appreciate all you guys do for the awesome server known as Avicus! \r\n\r\nIf you ever see me around be sure to say hi! I love to meet new people and what better way to then when fighting on an intense battlefield with arrows flying past your head??? \r\n\r\nI really LOVE Nexus o-o It was my favorite game on the old MCZone and when it returned to Avicus I was really happy. And although this Nexus isn't like the old one I'm just happy its back. Its better to have a Nexus then not one at all. So I'll be there most of my time :) I also like playing Control The Hill but its really hard to start a match there now days... :( I also enjoy playing the Walls but I usually like to do that with a friend, lol #Advantages. So now I have found that I really love playing Nebula. I use to hate it but I've really grown to love it after these last few months. \r\n\r\n\r\n\r\nRandom stuff about me that you probably will never need to know: \r\nPiano is my life, I've been playing for almost 9 years now and still love playing.\r\nI love to write stories. \r\nI love Doctor Who!!!!\r\nI'm a Percy Jackson fangirl (fangirl of the books not the movies, the movies are terrible) \r\nI also love the Legend of Zelda \r\nI really like anime, especially Attack on Titan (Attack on Titan forever o-o) Maid-Sama is love, Maid-Sama is life. Then I like Naruto, One Piece, Sword Art Online (kinda) Kimi Ni Todoke, and Lovely Complex.\r\nAnd no matter how weird this sounds I actually do like school. Theres something about learning that I really love, my favorite subject is  either science or history. :) \r\n\r\nOkay well because I'm just kinda rambling now I guess I'll just go...  \r\nHave a fantastic rest of the day! :) \r\n\r\n-Pup\r\n","gender":"Female","interests":"Writing, piano, minecraft, science, orchestra music, and much more. ","team":"Wizerdz","staff":false,"color":"none","badges":[],"total_kills":"5,875","total_deaths":"6,599","total_pvp_deaths":"6,470","kd":"0.89","pvp_kd":"0.91","credits":"2,013","time":"3 days","joins":"237","created_at":"2013/11/03 01:08:51 +0000","created_at_human":"November  3, 2013 at  1:11 AM UTC","objective_data":{"Monuments":"4","Controls":"104","10 Killss":"2","Wools":"1"},"friends":[{"id":71,"username":"MissMinerva","avatar":"https://crafatar.com/avatars/25bca65901d94faaa2456e4dae324330?helm\u0026size=$SIZE$","color":"none","staff":false},{"id":73,"username":"StanSB","avatar":"https://crafatar.com/avatars/cf247ceeb97b4958ac4d476ed3878d97?helm\u0026size=$SIZE$","color":"none","staff":false},{"id":80,"username":"keller183","avatar":"https://crafatar.com/avatars/bb15cd6a948f4896a12715174743f4de?helm\u0026size=$SIZE$","color":"none","staff":false},{"id":2983,"username":"Kacers","avatar":"https://crafatar.com/avatars/12b451a198464dd2891cf716e65356a3?helm\u0026size=$SIZE$","color":"none","staff":false},{"id":26472,"username":"_Jasun","avatar":"https://crafatar.com/avatars/4c615f00daa84df9af9d6ab0e58ca747?helm\u0026size=$SIZE$","color":"none","staff":false},{"id":30961,"username":"X0X0","avatar":"https://crafatar.com/avatars/ba4cea707efe40dab7a1d72e53a54214?helm\u0026size=$SIZE$","color":"none","staff":false},{"id":505436,"username":"Seuthy","avatar":"https://crafatar.com/avatars/bee1fadc3ff844c99258e08d3fa03fff?helm\u0026size=$SIZE$","color":"none","staff":false}]}