{"username":"hercules_the_dog","about":"Standards for humans are pretty low.\r\n\u003cbr\u003e\r\nI'm not very good socially.\r\n\u003cbr\u003e\r\nI don't trust many people.\r\n\u003cbr\u003e\r\nEvery \"evil\" person isn't evil on a different side of the story. They are always justified in their own minds. We all are.\r\n\u003cbr\u003e\r\nAlthough ignorance may be bliss, bliss isn't everything.\r\n\u003cbr\u003e\r\nApparently I start a lot of flame wars. I think I overestimate my (and other people's) maturity at times.\r\n\u003cbr\u003e\r\nI'm not a big fan of people. We're just all so dumb at times.\r\n\u003cbr\u003e\r\nI'm going to assume people are idiots until each one of them proves to me otherwise. I find this way is more accurate.\r\n\u003cbr\u003e\r\nAll in all, you're just another brick in the wall.\r\n\u003cbr\u003e\r\nAll you touch and all you see is all your life will ever be.\r\n\u003cbr\u003e\r\nThere is no meaning to life. It is all an interpretation of what is and what is not. Meaning is applicable everywhere; interpretations are based on the specific person.\r\n\u003cbr\u003e\r\nYou do not have the right to an opinion until you thoroughly understand the topic.\r\n\u003cbr\u003e\r\nImagine this. If the Moon was the size of a tennis ball, it would be roughly 24 feet away from Earth. Earth would be a basketball (and its surface would be even smoother than one, as well). The distance between the Moon and Earth compared to the distance between the Sun and Earth is an approximate ratio of 1:389, which means that at this scale the Sun would be ~1.75 miles away. Take a guess at the size of the Sun. Go ahead. It is 85 feet in diameter. Remember that a standard NBA basketball is 9.4 inches in diameter. And how about the Oort Cloud? It would be roughly 90,000 miles out... nearly a fifth of the distance to the nearest star, Proxima Centauri (which is at 480,000 miles away). The width of our galaxy? Remember that Earth is the size of a basketball when I say that the width of our galaxy is 11.275 billion miles across—24,000 times the distance between the Sun and Proxima Centauri, which is 270,000 times the distance between the Sun and Earth, which is 389 times the distance between Earth and the Moon, which is 238,900 miles away at a normal scale. I have not even begun to describe the distance between the Milky Way and other galaxies, or how many galaxies there are.\r\n\u003cbr\u003e\r\nWe mean nothing in a world of nothing.\r\n\u003cbr\u003e\r\nIf the Sun were the size of a dime, Alpha Centauri (another close star) would be about 320 miles away. Earth would be a speck about 6 feet, 4 inches distant.\r\n\u003cbr\u003e\r\nIf the Sun were the size of the period at the end of this sentence, Alpha Centauri would be about 5 1/2 miles away. The Earth would be an invisible speck 1 1/4 inches away.\r\n\u003cbr\u003e\r\nMake the Earth the size of a period. The Sun would be a ball about 2 1/8 inches across sitting at a distance of 19 feet, 3 inches. Alpha Centauri almost an even 1000 miles away.\r\n\u003cbr\u003e\r\nSolar systems are that far apart in a galaxy—the places in the universe where stuff gathers together. Galaxies are an even more unimaginable distance apart from each other.\r\n\u003cbr\u003e\r\nIf all matter from the Empire State Building was condensed together in a small of a space as possible, it would be the size of a grain of rice (source: nova science).\r\n\u003cbr\u003e\r\nThere isn't much out there. Sure, there's a bunch of it spread over an indescribable distance, but everything is so far away that it is inaccessible to us. We are stuck.\r\n\u003cbr\u003e\r\nWe mean nothing in a world of nothing, and I am glad to be here.\r\n\u003cbr\u003e\r\nKeeping this here mainly because it entertains me.\r\n\u003ca href=\"http://www.e-zeeinternet.com/\" target=\"_blank\"\u003e\u003cimg src=\"http://www.e-zeeinternet.com/count.php?page=1047008\u0026style=LED_g\u0026nbdigits=4\" alt=\"Free Counter\" border=\"0\" \u003e\u003c/a\u003e","gender":"Male","interests":"aviation and rocketry","staff":false,"color":"none","badges":[],"total_kills":"141","total_deaths":"0","total_pvp_deaths":"0","kd":"141.0","pvp_kd":"141.0","credits":"0","time":"0 seconds","joins":"0","created_at":"2014/03/02 21:51:32 +0000","created_at_human":"March  2, 2014 at  9:03 PM UTC","objective_data":{},"friends":[]}