{"username":"Shadowhammer20","about":"Hello Ill Tell You How I Started Playing Minecraft Get Your PopCorns And Enjoy It :\r\n\r\n\r\n\r\n      One Day I Was Playing A Game Called Habbo ( Large Story ) I Went To Visit My Cousin, I Show Him Habbo And He Told Me That He Had A Similar Game (Minecraft) I Hated It Then One Year Later I Was Searching For A Fun Game I Was Eating A Sandwich (Jam) And I Accidentally Entered On A Page While Searching Games I Saw Nice Game And I Saw Gta San Andreas So I Wanted To Click It   But At The Right Side There Was Minecraft So I Clicked It Accidentally It Started Downloading So I Wanted To See What It Was (Details) So I Created My Account ( Pirate ) Then I Started Playing It (I Am Now An Adict) I Was Searching For A Server And       I Found This One By Accident I Wanted To Put Skywars.com But I Didnt Put The Last Letter ( M ) So I Joined This Server (This Server Old Ip Is Skywars.co) I Met Some  People\r\nAnd I Saw That I Was, A Noob I Left The Server And I Started In A Factions Server I Went From Almost Getting Kill By 1 Guy To  Kill 30 Diamond Guys All After Me And Me With Nothing...... I Went Back To Here And I Started Playing Now Am Playing In Another Factions But Hear This Now In That Server I Kill 100 Full Diamond Guys With My Hand What Am Going To Make Here? Ill Cause The Server Break?! Be Prepared For My Comeback.\r\n\r\nCompleted Challenges:\r\n\r\nKilled 200 Guys With Full Diamond Armor With My Hand ( Got Kicked For Supposed Hackin.... )\r\n\r\nKilled A Guy While Felling From Senex With My Last Arrow 1 Heart 324 Blocks Away.\r\n\r\nMaking Admins Hate Me Cause Of Supposed Hacking\r\n\r\nBeing Totally Op\r\n\r\nKilking 3 Guys With Forcefield In A Row.\r\n\r\nKill A Guy With An Egg (Op)\r\n\r\nMaking A Skybase In Walls Killing All Teams Alone With 16 Eggs\r\n\r\n\r\nGot All Diamonds On Walls Made Me Full Diamond Armor And Killing All and Last Kill Jumping From A Skybase Hitting A Guy While Felling And Killed Him 1 Sec Before I Hit The Ground.\r\n\r\nBroke All Monuments Of All maps In Row Without Dying.\r\n\r\n\r\n\r\nGot TempBanned For Supposed No Knockback Hack.....\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nOp Wrote All This On My Phone .\r\n\r\nGuys This Challenges Are Not Most Of Them In This Server The First Completed Challenge Wasnt On This Server It Was In Factions.\r\n\r\n\r\n\r\n","gender":"Male","interests":"Get A Nice Title In My Name","staff":false,"color":"none","badges":[{"color":"#14BB06","text_color":"#FFFFFF","text":"Emerald"}],"total_kills":"4,568","total_deaths":"4,256","total_pvp_deaths":"3,737","kd":"1.07","pvp_kd":"1.22","credits":"134","time":"about 1 hour","joins":"9","created_at":"2013/11/03 19:34:52 +0000","created_at_human":"November  3, 2013 at  7:11 PM UTC","objective_data":{},"friends":[]}