{"username":"skill_girl45","about":"https://avicus.net/forums/6ce2afbe6\r\nLets give a good R.I.P. for Venny who was the victim beforehand\r\n\r\n\r\nSo earlier today there was an incident where Berzerk skype chat got raided, reason, Vlad was threatened to be ddosed by the famous one and only Lance2000 and Zac, who were in the call you may say? Michael and ParaSpider/Vicewatercolour.\r\nNow this probably will get locked so start your flame up.\r\n\r\nEnjoy the Initial Threat\r\nEnjoy the Berzerk Raid\r\nEnjoy the chat I was added after the raid\r\nEnjoy the raid of the fake new Berzerk Chat\r\nEnjoy the talk I had with Liz after she got pressured into adding them to the \"New Chat\"\r\n\r\nFrom the after raid chat and under MICHAEL and PARA were both in the chat, where Michael also \"asked you nicely\" as he said it to add them to the Berzerk chat where he was pressuring Vlad to add them or I would get ddosed.\r\nNeither Admin or Sr Mod helped me in my case and got Liz and Vlad scared to death.\r\n\r\nDon't believe they were in the chat? Here's a short video Vlad took before he got kicked from the call for playing music:\r\nhttps://www.youtube.com/watch?v=PXBRvuvpq5A\r\n \r\nNow I'm ranting on Michael because: \r\n1. He did shit to stop any threats and his reply to this was \r\n2.He did assist in the raids (as you can see from the chat logs from the pastebin)\r\n\r\nI'm ranting about Para because he didn't do dog shit to stop or intervene with any of the ddos threats. And guess what? R.I.P. Venny in the Process. He was the victim before Vlad was!\r\n \r\nNow when I see an Admin or Sr Mod in a skype call when I'm being threatened to get ddosed I would love to be backed up, or be helped, but nope, nothing. Especially when Vlad’s been in the community for a really long time.\r\nNext thing you know if your in a good group you'll be getting ddos threats by them to add them in.\r\nAnd of course nothing will happen to either of them because.\r\n\r\nHope you both are happy for encouraging this \u003c3\r\nYou could have prevented what’s coming in the future, but I guess the present is all that counts.","gender":"Male","staff":false,"color":"none","badges":[],"total_kills":"274","total_deaths":"263","total_pvp_deaths":"221","kd":"1.04","pvp_kd":"1.24","credits":"1,089","time":"about 10 hours","joins":"27","created_at":"2015/11/05 02:24:29 +0000","created_at_human":"November  5, 2015 at  2:11 AM UTC","objective_data":{"Monuments":"3","Controls":"1"},"friends":[]}