{"id":10953,"unique_id":"10953-918","author":{"id":108,"username":"MLGtino","avatar":"https://crafatar.com/avatars/5855cb2b462f42969c1e685db0ecd987?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Anyone got any scary stories? Just reviving this thread from early Avicus.\u0026nbsp;\u003cbr\u003e\u003cbr\u003eBEWARE: THIS THREAD MIGHT HAVE GORE/HARSH LANGUAGE THAT MAY BE FRIGHTENING TO CHILDREN. IF YOU AREN'T EXTREME ENOUGH, LOOK AWAY.\u003cbr\u003e\u003cbr\u003eEDIT: GO TO SECOND PAGE TO SKIP GLITCHYS ESSAY.\u003cbr\u003e\u003cbr\u003eBegin.\u003cbr\u003e\u003cbr\u003e\u003cimg alt=\"\" src=\"http://i.imgur.com/LO3UGZZ.gif\"\u003e","body_tagged":"Anyone got any scary stories? Just reviving this thread from early Avicus.\u0026nbsp;\u003cbr\u003e\u003cbr\u003eBEWARE: THIS THREAD MIGHT HAVE GORE/HARSH LANGUAGE THAT MAY BE FRIGHTENING TO CHILDREN. IF YOU AREN'T EXTREME ENOUGH, LOOK AWAY.\u003cbr\u003e\u003cbr\u003eEDIT: GO TO SECOND PAGE TO SKIP GLITCHYS ESSAY.\u003cbr\u003e\u003cbr\u003eBegin.\u003cbr\u003e\u003cbr\u003e\u003cimg alt=\"\" src=\"http://i.imgur.com/LO3UGZZ.gif\"\u003e","created_at":"2015/02/12 01:45:21 +0000","created_at_human":"February 12, 2015 at  1:02 AM UTC","title":"Scary story thread","replies":[{"id":151845,"unique_id":"151845-842","author":{"id":45438,"username":"Lavish","avatar":"https://crafatar.com/avatars/9ce7d3ac70c24517bd29ee731464dc33?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"One upon a time. The end. \u003cbr\u003e\u003cimg alt=\"\" src=\"https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcSHvwkdIcQn_Q-dZpj_rjvJtr3-FCLJqsXnrbJmEaKomUa47bheFg\"\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eOOOOOO WOAHHHH THAT WAS SCARY YO!","body_tagged":"One upon a time. The end. \u003cbr\u003e\u003cimg alt=\"\" src=\"https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcSHvwkdIcQn_Q-dZpj_rjvJtr3-FCLJqsXnrbJmEaKomUa47bheFg\"\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eOOOOOO WOAHHHH THAT WAS SCARY YO!","created_at":"2015/02/12 01:46:42 +0000","created_at_human":"February 12, 2015 at  1:02 AM UTC"},{"id":151846,"unique_id":"151846-2125","author":{"id":98,"username":"ImJeezus","avatar":"https://crafatar.com/avatars/20985d4520c145f7a7e9daeaf7c08c2e?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"mlgtino","body_tagged":"mlgtino","created_at":"2015/02/12 01:53:58 +0000","created_at_human":"February 12, 2015 at  1:02 AM UTC"},{"id":151847,"unique_id":"151847-687","author":{"id":347312,"username":"_Phyre","avatar":"https://www.gravatar.com/avatar/40d193e564da54887a49bb1cc7e65dc6?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"\u003cimg src=\"https://s-media-cache-ak0.pinimg.com/236x/f5/f8/36/f5f836c45de654c2fa8264d705287427.jpg\" /src\u003e","body_tagged":"\u003cimg src=\"https://s-media-cache-ak0.pinimg.com/236x/f5/f8/36/f5f836c45de654c2fa8264d705287427.jpg\" /src\u003e","created_at":"2015/02/12 01:56:57 +0000","created_at_human":"February 12, 2015 at  1:02 AM UTC"},{"id":151848,"unique_id":"151848-240","author":{"id":182845,"username":"Dyspa","avatar":"https://crafatar.com/avatars/0f0237f744674b0ea90e93b1320abf1c?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"There was a chair, and a guy named MLGTino broke it whilst watching hentai.\u003cbr\u003eThe end.\u003cbr\u003eSPOOKD","body_tagged":"There was a chair, and a guy named MLGTino broke it whilst watching hentai.\u003cbr\u003eThe end.\u003cbr\u003eSPOOKD","created_at":"2015/02/12 01:58:18 +0000","created_at_human":"February 12, 2015 at  1:02 AM UTC"},{"id":151850,"unique_id":"151850-2628","author":{"id":1438,"username":"Westby","avatar":"https://crafatar.com/avatars/8b4ef61c56c64626b886d163a024ea15?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"\u003cspan\u003ethere once was no wifi :OOO \u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cb\u003eThe end\u003c/b\u003e\u003c/span\u003e","body_tagged":"\u003cspan\u003ethere once was no wifi :OOO \u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cb\u003eThe end\u003c/b\u003e\u003c/span\u003e","created_at":"2015/02/12 02:01:52 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC"},{"id":151851,"unique_id":"151851-4419","author":{"id":368927,"username":"kiawwa","avatar":"https://www.gravatar.com/avatar/8b5eeeec9c41386fa4450f9cc6250e2e?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"GG.","body_tagged":"GG.","created_at":"2015/02/12 02:05:25 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC","reply_to":{"id":151850,"unique_id":"151850-1207","author":{"id":1438,"username":"Westby","avatar":"https://crafatar.com/avatars/8b4ef61c56c64626b886d163a024ea15?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"\u003cspan\u003ethere once was no wifi :OOO \u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cb\u003eThe end\u003c/b\u003e\u003c/span\u003e","body_tagged":"\u003cspan\u003ethere once was no wifi :OOO \u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cb\u003eThe end\u003c/b\u003e\u003c/span\u003e","created_at":"2015/02/12 02:01:52 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC"}},{"id":151852,"unique_id":"151852-2018","author":{"id":29263,"username":"Trexychan","avatar":"https://www.gravatar.com/avatar/1acfdd6481b0bcc76a5cf25fd55ff8a6?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"I killed three children yesterday. Threaded one's eyes out with a needle, slit one's stomach open and hung him from a tree via his intestines, and I sent the other one to a JB concert.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eThe first two got it off easy.","body_tagged":"I killed three children yesterday. Threaded one's eyes out with a needle, slit one's stomach open and hung him from a tree via his intestines, and I sent the other one to a JB concert.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eThe first two got it off easy.","created_at":"2015/02/12 02:13:56 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC"},{"id":151853,"unique_id":"151853-4834","author":{"id":350385,"username":"MidnightBeats","avatar":"https://www.gravatar.com/avatar/c4a6a26357525203511d926fd7eb5803?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"\u003cb\u003eThe Dreaded Place\u0026nbsp;\u003cbr\u003e\u003c/b\u003eby Midnight\u003cbr\u003e\u003cbr\u003eIt was a cold, bleak morning. None of the birds were singing. They were all hiding from that dreaded place. The Dreaded Place housed the criminals, the weird ones, and then, people like me, the regulars, those who were forced to slave away at this place. As I prepared myself with all of my survival tools and equipment, my mother gave me enough time to give me my final meal. A tasteless, grey soup didn't add on to my mood. I said my final prayers and walked out of my secure space. I walked down the grey road as people stared at me with blistering eyes. The idea that someone was staring into my soul completely gave me shivers. As I walked along the road, I saw others, who had been condemned to the same punishment that I had to bear. Being in the place was torturous. Every single day, there were casualties. They had been physically and mentally traumatized by the experience. Every day, I prayed extra hard just to make sure that I didn't end up dead, wounded, traumatized, like them. We called them the Wounded. They would never recover, they could not ever bear the experience again, yet, they came back every day, like a slave. As the sinister gates opened, I gulped and shook a little. I made my way into the black corridors, where sinister criminals shot me down with their paralyzing glares. I made my way into one of the torture rooms to begin the slaving routine. Just before I began, a booming and horrendous voice echoed throughout the facility through a speaker...\u003cbr\u003e\u003cbr\u003e\u003ci\u003e\"Welcome back to class, children. I hope you had a good weekend...\"\u003cbr\u003e\u003cbr\u003e\u003c/i\u003e","body_tagged":"\u003cb\u003eThe Dreaded Place\u0026nbsp;\u003cbr\u003e\u003c/b\u003eby Midnight\u003cbr\u003e\u003cbr\u003eIt was a cold, bleak morning. None of the birds were singing. They were all hiding from that dreaded place. The Dreaded Place housed the criminals, the weird ones, and then, people like me, the regulars, those who were forced to slave away at this place. As I prepared myself with all of my survival tools and equipment, my mother gave me enough time to give me my final meal. A tasteless, grey soup didn't add on to my mood. I said my final prayers and walked out of my secure space. I walked down the grey road as people stared at me with blistering eyes. The idea that someone was staring into my soul completely gave me shivers. As I walked along the road, I saw others, who had been condemned to the same punishment that I had to bear. Being in the place was torturous. Every single day, there were casualties. They had been physically and mentally traumatized by the experience. Every day, I prayed extra hard just to make sure that I didn't end up dead, wounded, traumatized, like them. We called them the Wounded. They would never recover, they could not ever bear the experience again, yet, they came back every day, like a slave. As the sinister gates opened, I gulped and shook a little. I made my way into the black corridors, where sinister criminals shot me down with their paralyzing glares. I made my way into one of the torture rooms to begin the slaving routine. Just before I began, a booming and horrendous voice echoed throughout the facility through a speaker...\u003cbr\u003e\u003cbr\u003e\u003ci\u003e\"Welcome back to class, children. I hope you had a good weekend...\"\u003cbr\u003e\u003cbr\u003e\u003c/i\u003e","created_at":"2015/02/12 02:14:31 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC"},{"id":151854,"unique_id":"151854-3464","author":{"id":7003,"username":"FrostedCupcakez","avatar":"https://www.gravatar.com/avatar/a3fd4ab1ed8eabd9cb07dcce0f64724b?s=$SIZE$\u0026default=mm","color":"#FF5C5C","staff":true},"body":"Annamarie singing and making weird noises in Teamspeak.\u003cbr\u003e\u003cbr\u003eThe end.","body_tagged":"Annamarie singing and making weird noises in Teamspeak.\u003cbr\u003e\u003cbr\u003eThe end.","created_at":"2015/02/12 02:17:05 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC"},{"id":151855,"unique_id":"151855-988","author":{"id":121393,"username":"Glitchaye","avatar":"https://www.gravatar.com/avatar/8ce6c49e3d25fe96a5d778d0f8299968?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"\u003cb\u003eUnbranded Laptop\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e(shutupitsfromcreepypastawikiarentIedgy?)\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eMy brother moved out of the house back in 2002 once he got his job as a computer technician, and he recently went missing. When I went to his house, it was locked, with 3 sheets of printer paper taped to the front door.While coming home from work one day, I noticed someone had left their damaged grey laptop laying in the middle of my driveway. I got out of my car to examine it more carefully.The LCD definitely showed signs of user related damage. There was a large hole on the left side of the screen that appeared to fit a standard Phillips Head screwdriver perfectly. There was a webcam above the display, and it was also destroyed with the same screwdriver. Other than those, everything else on the computer showed minor signs of wear. Almost all of the keyboard's keys were faded, but not to the extent that the laptop could be considered unusable. I looked at the back of the display to find out what brand it is, but I couldn't find anything. I looked at the entire laptop's shell, but there was no text or logo stating what brand it was. In fact, there was no warranty sticker, no \"Proof of license\" sticker on the bottom, no text whatsoever. What was even more odd was the fact that the only ports on the laptop were a VGA port for connecting an external display and a USB port. How long could this laptop have possibly run without a charging port to recharge the battery? It must have been a very low end laptop where you had to remove the battery pack and put it into its own charging dock. Why did it have a web cam, though?Curious as to what was on the laptop, I ran inside to my basement where my old desktop was currently being stored. The reason it was down there was because I forgot to bring that behemoth to the local SarCan to recycle it. I would have been using it as my regular computer, but it takes 5 or 6 hours to fully boot because the system always goes through recovery mode every time you start it, and the processor is way too slow to \"recover\" everything on the 500 GB hard drive I had installed on it [A 120mhz Pentium processor doesn't get you far]. I removed the old LG CRT monitor from the desktop and plugged it into the laptop. I went to push the power button when......I stopped. There's no way this is going to work, the battery has to be dead by now.I rummaged around the basement to find my battery voltage tester and immediately withdrew the battery from the laptop and checked the voltage. Lo and behold, it had no charge. Well, I thought, might as well just leave it and take everything to SarCan tomorrow morning. With that, I unplugged the display from the laptop, put it back into the desktop and simply left everything downstairs. After leaving the basement I went to go watch TV for about 3 hours or so before going to bed.\u003cspan\u003eI was suddenly awakened from my deep slumber by the sound of the Windows 2000 start up jingle, and fell out of my bed. It was so deafeningly loud, I swore someone was holding a pair of speakers right next to my ears. I stood up in a groggy daze, and it took a couple of minutes to figure out what the sound was. The desktop! I must have accidentally hit the power switch while trying to switch monitors! I headed to the basement, but froze in the middle of the steps. I just remembered there was no way my computer could have started up, because I have Windows 95 installed on my desktop. I was reluctant to go down the steps after that, but my common sense started kicking in and I thought I must be getting my OS's mixed up. When I walked down, I was shocked to see that my desktop wasn't on; in fact, I remembered\u0026nbsp;\u003ci\u003eit wasn't even plugged in\u003c/i\u003e. I had to make sure of it though. I checked behind the desktop - everything else was plugged in except for the power. There was absolutely no chance of that laptop turning on, it was impossible. I removed the battery from the laptop again and re-checked the voltage.\u003c/span\u003eThis time, I couldn't get a direct number. The voltage tester was just going insane.I re-inserted the battery and pressed the power button on the laptop. Some indicator lights flashed, meaning the computer definitely started, except this time the start up jingle wasn't played at all. I needed to see what was going on here. I connected the CRT monitor back into the laptop. And what I saw...... was a bare desktop with 3 icons in the corner. The task bar was empty, and there was no Start menu button.The wallpaper was black. Why would anyone do this to their desktop? Anyone could remove all the icons, but they had to be pretty skilled hackers to remove the Start Menu button. Of the 3 icons, one was a Games folder, one was a Videos folder, and the last was the DOS Command Prompt program. Maybe this was a kids' laptop? Clicking on the Games folder confirmed my suspicions; a little girl must have owned this laptop. I felt some remorse for the poor girl because there was only 1 game in the folder. The program name was \"princess.exe\". I clicked on it just to see what the game was like. A fully animated title screen came up, with various generic fairytale princesses twirling across the screen, and then the logo flew down with a bunch of sparkly doves holding it. The game was called \"Princess Creator: Make yourself Beautiful!\" Ah, so it must have been one of those low budget \"put .png of various clothing items onto a photo of yourself\" games. I was right, as the menu popped up I was given the option to \"Dress up\" or to \"View pretty pictures\". I wanted to see what the girl looked like, so I clicked on the 2nd option. She had to have been no more than 5, and on top of that she looked very cute. She was of either Mexican or Spanish origin. She wore a somewhat tattered white dress with small red frills around the sleeves and collar. It had small roses on it. I smiled, as she looked like she had a lot of fun putting a virtual tiara on her head. However, browsing through the photos, about halfway through, there were pictures of a room with nothing else but a bed inside. She must've been dodging the camera for the hell of it, I guess.After that I felt I'd seen enough with that program, and might as well go see the other 2 files on the laptop. I decided to go into the Command Prompt to see if I could locate any other files on the hard drive. I simply got a \":\\\u0026gt;_\" line with no drive letter. Okay, this is really strange, I thought. I typed into the command box \"start C:\\\" to see if I could open the directory I wanted to explore. I pressed enter, and DOS simply replied \" 'start' is not recognized as an internal or external command, operable program or batch file.\" After a few seconds, the program crashed, bringing me back to the desktop. So I guess the last thing to look at is the videos. I double clicked the folder...... and the screen faded to black. I thought it had crashed, but I noticed that there was a small \"_\" flashing in the top left corner.Suddenly, the text \"start\u0026nbsp;:\\\u0026gt;videos\\001.wmv\" flashed briefly, then a video appeared in full screen. It was the girl again. This time, she was smiling, bouncing slightly in excitement. Her happiness made my heart feel warm. My guess was that she must've been recording herself play the dress up game with the webcam. At first she was simply moving her finger across the track pad, clicking, then giggling excitedly for a bit. She must've been laughing at the things she put on herself in the game. After about 2 minutes or so, the screen would cut to black for a fraction of a second and then return to the girl playing the game. This time, however, she was dressed differently, in a simple pink t-shirt with the words \"Go Go Girl!\" stitched in glitter. I guessed the game was recording her every time she started it, without her knowing. That made me sort of uneasy - I mean, why would anyone program a game to do that? Whatever, I guessed it was going to be the same sort of thing over and over with the video, so I might as well turn off the computer. I reached over and pressed the power button, and...... It didn't shut off this time. The video continued to play, and I saw the girl this time was wearing an orange tank top with nothing on it. She was smiling and giggling as usual, and I thought maybe I could turn off the computer after the video is done. It couldn't be that long. The video seemed to drag on, with more cuts of her playing the game in a different outfit, and I started to doze off. However, after the next cut in the video...The girl was just staring at the camera with an expressionless look on her face. Wondering what the hell was going on, I become interested in the video again. This one didn't make me smile. It made me extremely uneasy to watch her without her usual smiley face on. It was dark in the room, but there was 1 desk light on at the side. She was in some sort of night wear. What was she going to do? She sat there for a minute with that blank expression, like she wasn't thinking at all. I started to get really tense, as if something awful was about to happen.She bent over and picked up a hand saw from the left side of where she was sitting. She held it in front of her, showing it to the camera. Then, she placed the jagged blade on the side of her cheek. I cringed at what I was seeing. Slowly, she began slicing into her right cheek. Blood drizzled down her neck as she did it. Slowly, the side of her teeth began to show after about 10 seconds. As the saw went lower on her face, more of her teeth began to show on the side. Blood covered almost the entire right side of her face. She eventually got to the bottom of her jaw bone, and sawed a tiny piece off of it too. Her cheek fell to the ground with a small thud, and she put the saw in her lap and continued to stare at the camera, emotionless. I couldn't take much more of this and tore the battery out of the laptop - but the video continued to play.Then, the next cut began. The girl screamed in extreme pain. I almost fell out of my seat, it was so loud. She screamed, and put her hands over her now absent cheek. She continued to scream in agony for about 10 seconds, then a knocking was heard from the side. It was a woman, yelling in a language I couldn't understand. She was pounding the door, but not opening it. The girl must have locked it. I tried to unplug the monitor from the laptop but it was stuck in. I didn't want to see what happens next! The screaming and the yelling continued up until the next cut.She was back in her emotionless state again, but her cheek was still missing. The woman at the door was pounding and yelling still. It must have been her mother. The girl then raised the saw up to her right shoulder, and began cutting just as slowly as last time. I gagged at the sight of this. It was a holocaust of wrong. The blood began to stream out in all directions. The yelling behind the door fell silent. I guessed the other woman was trying to get someone to help her, either the father or brother or what not. When she hit the bone, an awful grinding noise could be heard. I covered my ears, but I could still hear it vividly through my hands. I noticed that a piece of her muscle got stuck on one of the steel teeth of the saw. This cut ended a lot faster than before, and the next cut was the same thing except the color from her face was draining, and her pain ridden screams became quickly weaker. Her clothing was completely red with blood on the right side.Then, she became emotionless again. Oh god, what is she going to cut off next? The mother returned with what sounded like 2 other people, and they were all yelling in the same language as before. She raised the saw, and began cutting the right side of her head off. Loud thuds were sounding at the door. They were trying to knock it down. She continued to work her way down, with blood going in all sorts of directions. The thuds still repeated themselves on the door. I was mostly confused as to how she kept going, even after she went through her brain with the saw. Her right eye rolled into the back of her head. Blood began leaking out of it. She eventually made it to the top of her mouth, where she hacked her way through bones and teeth. It was the single worst sound I have ever heard in my entire life. I still hear it in the back of my head some days. The thuds continued, and deep in the back of my mind I hoped they wouldn't be able to break the door down so they wouldn't have to see such an awful sight. She finally made it through, and with that, the right side of her head fell to the side of her neck, held on only by a piece of skin. I remember the chilling sound of her jaw being unhinged when it was tugged violently by the force of the top half of her head. She put the saw down to her side.The cut ended, and in the next cut, she simply fell face down onto the desk. Half her brain fell out onto the desk on impact, and her eye popped out of its socket. Blood pooled on the desk. The people trying to break down the door finally made it in, and they were hysterical at what they saw. Their daughter was in pieces. The mother vomited and ran out of the room. The father ran to the daughter, put her head back together and cried, holding her head at the side of his. The other man, presumably the girl's older brother, simply stared in horror at what he saw.The horrifying self mutilation finished with that cut, and the screen cut back to the empty room with the bed. With a sigh of relief that it was over I sat there, breathing heavily and sweating. I didn't realize that the room was so hot until now. I had so many questions to ask. How was all this possible? It frightened me, and I spent a good 30 minutes sitting in the chair, and finally, I got the courage to get up. I looked back at the laptop for what I hoped was the last time. The room with the bed glared on the screen. Then, it cut to something else.It was a cut of my face, in the basement, using the laptop.","body_tagged":"\u003cb\u003eUnbranded Laptop\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e(shutupitsfromcreepypastawikiarentIedgy?)\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eMy brother moved out of the house back in 2002 once he got his job as a computer technician, and he recently went missing. When I went to his house, it was locked, with 3 sheets of printer paper taped to the front door.While coming home from work one day, I noticed someone had left their damaged grey laptop laying in the middle of my driveway. I got out of my car to examine it more carefully.The LCD definitely showed signs of user related damage. There was a large hole on the left side of the screen that appeared to fit a standard Phillips Head screwdriver perfectly. There was a webcam above the display, and it was also destroyed with the same screwdriver. Other than those, everything else on the computer showed minor signs of wear. Almost all of the keyboard's keys were faded, but not to the extent that the laptop could be considered unusable. I looked at the back of the display to find out what brand it is, but I couldn't find anything. I looked at the entire laptop's shell, but there was no text or logo stating what brand it was. In fact, there was no warranty sticker, no \"Proof of license\" sticker on the bottom, no text whatsoever. What was even more odd was the fact that the only ports on the laptop were a VGA port for connecting an external display and a USB port. How long could this laptop have possibly run without a charging port to recharge the battery? It must have been a very low end laptop where you had to remove the battery pack and put it into its own charging dock. Why did it have a web cam, though?Curious as to what was on the laptop, I ran inside to my basement where my old desktop was currently being stored. The reason it was down there was because I forgot to bring that behemoth to the local SarCan to recycle it. I would have been using it as my regular computer, but it takes 5 or 6 hours to fully boot because the system always goes through recovery mode every time you start it, and the processor is way too slow to \"recover\" everything on the 500 GB hard drive I had installed on it [A 120mhz Pentium processor doesn't get you far]. I removed the old LG CRT monitor from the desktop and plugged it into the laptop. I went to push the power button when......I stopped. There's no way this is going to work, the battery has to be dead by now.I rummaged around the basement to find my battery voltage tester and immediately withdrew the battery from the laptop and checked the voltage. Lo and behold, it had no charge. Well, I thought, might as well just leave it and take everything to SarCan tomorrow morning. With that, I unplugged the display from the laptop, put it back into the desktop and simply left everything downstairs. After leaving the basement I went to go watch TV for about 3 hours or so before going to bed.\u003cspan\u003eI was suddenly awakened from my deep slumber by the sound of the Windows 2000 start up jingle, and fell out of my bed. It was so deafeningly loud, I swore someone was holding a pair of speakers right next to my ears. I stood up in a groggy daze, and it took a couple of minutes to figure out what the sound was. The desktop! I must have accidentally hit the power switch while trying to switch monitors! I headed to the basement, but froze in the middle of the steps. I just remembered there was no way my computer could have started up, because I have Windows 95 installed on my desktop. I was reluctant to go down the steps after that, but my common sense started kicking in and I thought I must be getting my OS's mixed up. When I walked down, I was shocked to see that my desktop wasn't on; in fact, I remembered\u0026nbsp;\u003ci\u003eit wasn't even plugged in\u003c/i\u003e. I had to make sure of it though. I checked behind the desktop - everything else was plugged in except for the power. There was absolutely no chance of that laptop turning on, it was impossible. I removed the battery from the laptop again and re-checked the voltage.\u003c/span\u003eThis time, I couldn't get a direct number. The voltage tester was just going insane.I re-inserted the battery and pressed the power button on the laptop. Some indicator lights flashed, meaning the computer definitely started, except this time the start up jingle wasn't played at all. I needed to see what was going on here. I connected the CRT monitor back into the laptop. And what I saw...... was a bare desktop with 3 icons in the corner. The task bar was empty, and there was no Start menu button.The wallpaper was black. Why would anyone do this to their desktop? Anyone could remove all the icons, but they had to be pretty skilled hackers to remove the Start Menu button. Of the 3 icons, one was a Games folder, one was a Videos folder, and the last was the DOS Command Prompt program. Maybe this was a kids' laptop? Clicking on the Games folder confirmed my suspicions; a little girl must have owned this laptop. I felt some remorse for the poor girl because there was only 1 game in the folder. The program name was \"princess.exe\". I clicked on it just to see what the game was like. A fully animated title screen came up, with various generic fairytale princesses twirling across the screen, and then the logo flew down with a bunch of sparkly doves holding it. The game was called \"Princess Creator: Make yourself Beautiful!\" Ah, so it must have been one of those low budget \"put .png of various clothing items onto a photo of yourself\" games. I was right, as the menu popped up I was given the option to \"Dress up\" or to \"View pretty pictures\". I wanted to see what the girl looked like, so I clicked on the 2nd option. She had to have been no more than 5, and on top of that she looked very cute. She was of either Mexican or Spanish origin. She wore a somewhat tattered white dress with small red frills around the sleeves and collar. It had small roses on it. I smiled, as she looked like she had a lot of fun putting a virtual tiara on her head. However, browsing through the photos, about halfway through, there were pictures of a room with nothing else but a bed inside. She must've been dodging the camera for the hell of it, I guess.After that I felt I'd seen enough with that program, and might as well go see the other 2 files on the laptop. I decided to go into the Command Prompt to see if I could locate any other files on the hard drive. I simply got a \":\\\u0026gt;_\" line with no drive letter. Okay, this is really strange, I thought. I typed into the command box \"start C:\\\" to see if I could open the directory I wanted to explore. I pressed enter, and DOS simply replied \" 'start' is not recognized as an internal or external command, operable program or batch file.\" After a few seconds, the program crashed, bringing me back to the desktop. So I guess the last thing to look at is the videos. I double clicked the folder...... and the screen faded to black. I thought it had crashed, but I noticed that there was a small \"_\" flashing in the top left corner.Suddenly, the text \"start\u0026nbsp;:\\\u0026gt;videos\\001.wmv\" flashed briefly, then a video appeared in full screen. It was the girl again. This time, she was smiling, bouncing slightly in excitement. Her happiness made my heart feel warm. My guess was that she must've been recording herself play the dress up game with the webcam. At first she was simply moving her finger across the track pad, clicking, then giggling excitedly for a bit. She must've been laughing at the things she put on herself in the game. After about 2 minutes or so, the screen would cut to black for a fraction of a second and then return to the girl playing the game. This time, however, she was dressed differently, in a simple pink t-shirt with the words \"Go Go Girl!\" stitched in glitter. I guessed the game was recording her every time she started it, without her knowing. That made me sort of uneasy - I mean, why would anyone program a game to do that? Whatever, I guessed it was going to be the same sort of thing over and over with the video, so I might as well turn off the computer. I reached over and pressed the power button, and...... It didn't shut off this time. The video continued to play, and I saw the girl this time was wearing an orange tank top with nothing on it. She was smiling and giggling as usual, and I thought maybe I could turn off the computer after the video is done. It couldn't be that long. The video seemed to drag on, with more cuts of her playing the game in a different outfit, and I started to doze off. However, after the next cut in the video...The girl was just staring at the camera with an expressionless look on her face. Wondering what the hell was going on, I become interested in the video again. This one didn't make me smile. It made me extremely uneasy to watch her without her usual smiley face on. It was dark in the room, but there was 1 desk light on at the side. She was in some sort of night wear. What was she going to do? She sat there for a minute with that blank expression, like she wasn't thinking at all. I started to get really tense, as if something awful was about to happen.She bent over and picked up a hand saw from the left side of where she was sitting. She held it in front of her, showing it to the camera. Then, she placed the jagged blade on the side of her cheek. I cringed at what I was seeing. Slowly, she began slicing into her right cheek. Blood drizzled down her neck as she did it. Slowly, the side of her teeth began to show after about 10 seconds. As the saw went lower on her face, more of her teeth began to show on the side. Blood covered almost the entire right side of her face. She eventually got to the bottom of her jaw bone, and sawed a tiny piece off of it too. Her cheek fell to the ground with a small thud, and she put the saw in her lap and continued to stare at the camera, emotionless. I couldn't take much more of this and tore the battery out of the laptop - but the video continued to play.Then, the next cut began. The girl screamed in extreme pain. I almost fell out of my seat, it was so loud. She screamed, and put her hands over her now absent cheek. She continued to scream in agony for about 10 seconds, then a knocking was heard from the side. It was a woman, yelling in a language I couldn't understand. She was pounding the door, but not opening it. The girl must have locked it. I tried to unplug the monitor from the laptop but it was stuck in. I didn't want to see what happens next! The screaming and the yelling continued up until the next cut.She was back in her emotionless state again, but her cheek was still missing. The woman at the door was pounding and yelling still. It must have been her mother. The girl then raised the saw up to her right shoulder, and began cutting just as slowly as last time. I gagged at the sight of this. It was a holocaust of wrong. The blood began to stream out in all directions. The yelling behind the door fell silent. I guessed the other woman was trying to get someone to help her, either the father or brother or what not. When she hit the bone, an awful grinding noise could be heard. I covered my ears, but I could still hear it vividly through my hands. I noticed that a piece of her muscle got stuck on one of the steel teeth of the saw. This cut ended a lot faster than before, and the next cut was the same thing except the color from her face was draining, and her pain ridden screams became quickly weaker. Her clothing was completely red with blood on the right side.Then, she became emotionless again. Oh god, what is she going to cut off next? The mother returned with what sounded like 2 other people, and they were all yelling in the same language as before. She raised the saw, and began cutting the right side of her head off. Loud thuds were sounding at the door. They were trying to knock it down. She continued to work her way down, with blood going in all sorts of directions. The thuds still repeated themselves on the door. I was mostly confused as to how she kept going, even after she went through her brain with the saw. Her right eye rolled into the back of her head. Blood began leaking out of it. She eventually made it to the top of her mouth, where she hacked her way through bones and teeth. It was the single worst sound I have ever heard in my entire life. I still hear it in the back of my head some days. The thuds continued, and deep in the back of my mind I hoped they wouldn't be able to break the door down so they wouldn't have to see such an awful sight. She finally made it through, and with that, the right side of her head fell to the side of her neck, held on only by a piece of skin. I remember the chilling sound of her jaw being unhinged when it was tugged violently by the force of the top half of her head. She put the saw down to her side.The cut ended, and in the next cut, she simply fell face down onto the desk. Half her brain fell out onto the desk on impact, and her eye popped out of its socket. Blood pooled on the desk. The people trying to break down the door finally made it in, and they were hysterical at what they saw. Their daughter was in pieces. The mother vomited and ran out of the room. The father ran to the daughter, put her head back together and cried, holding her head at the side of his. The other man, presumably the girl's older brother, simply stared in horror at what he saw.The horrifying self mutilation finished with that cut, and the screen cut back to the empty room with the bed. With a sigh of relief that it was over I sat there, breathing heavily and sweating. I didn't realize that the room was so hot until now. I had so many questions to ask. How was all this possible? It frightened me, and I spent a good 30 minutes sitting in the chair, and finally, I got the courage to get up. I looked back at the laptop for what I hoped was the last time. The room with the bed glared on the screen. Then, it cut to something else.It was a cut of my face, in the basement, using the laptop.","created_at":"2015/02/12 02:17:16 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC"},{"id":151858,"unique_id":"151858-4165","author":{"id":107438,"username":"RefuseToSink","avatar":"https://www.gravatar.com/avatar/7bfaca5544cedbd7d6b5ef5a60b09877?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"HAHAH So true","body_tagged":"HAHAH So true","created_at":"2015/02/12 02:23:41 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC","reply_to":{"id":151854,"unique_id":"151854-2853","author":{"id":7003,"username":"FrostedCupcakez","avatar":"https://www.gravatar.com/avatar/a3fd4ab1ed8eabd9cb07dcce0f64724b?s=$SIZE$\u0026default=mm","color":"#FF5C5C","staff":true},"body":"Annamarie singing and making weird noises in Teamspeak.\u003cbr\u003e\u003cbr\u003eThe end.","body_tagged":"Annamarie singing and making weird noises in Teamspeak.\u003cbr\u003e\u003cbr\u003eThe end.","created_at":"2015/02/12 02:17:05 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC"}},{"id":151862,"unique_id":"151862-1413","author":{"id":6103,"username":"MerlinMaster","avatar":"https://www.gravatar.com/avatar/64353bd8b83d004bf4298dccae4754f8?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"Once there was an ugly barnacle.... he was so ugly everyone died.","body_tagged":"Once there was an ugly barnacle.... he was so ugly everyone died.","created_at":"2015/02/12 02:32:17 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC"},{"id":151868,"unique_id":"151868-1411","author":{"id":6564,"username":"kycrafft","avatar":"https://www.gravatar.com/avatar/b3bcefeeb60e1af497aa9a36dacbc965?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"One time I heard Straightened's voice...\u003cbr\u003e\u003cbr\u003e2spooky4me2continue","body_tagged":"One time I heard Straightened's voice...\u003cbr\u003e\u003cbr\u003e2spooky4me2continue","created_at":"2015/02/12 02:45:52 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC"},{"id":151875,"unique_id":"151875-1807","author":{"id":107438,"username":"RefuseToSink","avatar":"https://www.gravatar.com/avatar/7bfaca5544cedbd7d6b5ef5a60b09877?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"But, have you witnessed his face? That's some spooky stuff right there.\u003cbr\u003e\u003cbr\u003ejk, luv you michael\u0026lt;333 :)","body_tagged":"But, have you witnessed his face? That's some spooky stuff right there.\u003cbr\u003e\u003cbr\u003ejk, luv you michael\u0026lt;333 :)","created_at":"2015/02/12 02:56:47 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC","reply_to":{"id":151868,"unique_id":"151868-3724","author":{"id":6564,"username":"kycrafft","avatar":"https://www.gravatar.com/avatar/b3bcefeeb60e1af497aa9a36dacbc965?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"One time I heard Straightened's voice...\u003cbr\u003e\u003cbr\u003e2spooky4me2continue","body_tagged":"One time I heard Straightened's voice...\u003cbr\u003e\u003cbr\u003e2spooky4me2continue","created_at":"2015/02/12 02:45:52 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC"}},{"id":151886,"unique_id":"151886-4111","author":{"id":6564,"username":"kycrafft","avatar":"https://www.gravatar.com/avatar/b3bcefeeb60e1af497aa9a36dacbc965?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"That's very mean.","body_tagged":"That's very mean.","created_at":"2015/02/12 03:26:31 +0000","created_at_human":"February 12, 2015 at  3:02 AM UTC","reply_to":{"id":151875,"unique_id":"151875-4006","author":{"id":107438,"username":"RefuseToSink","avatar":"https://www.gravatar.com/avatar/7bfaca5544cedbd7d6b5ef5a60b09877?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"But, have you witnessed his face? That's some spooky stuff right there.\u003cbr\u003e\u003cbr\u003ejk, luv you michael\u0026lt;333 :)","body_tagged":"But, have you witnessed his face? That's some spooky stuff right there.\u003cbr\u003e\u003cbr\u003ejk, luv you michael\u0026lt;333 :)","created_at":"2015/02/12 02:56:47 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC"}},{"id":151888,"unique_id":"151888-105","author":{"id":437157,"username":"Newcleus","avatar":"https://www.gravatar.com/avatar/e0a8ea3a16343b1e99b507e2d342e8bb?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"rawr","body_tagged":"rawr","created_at":"2015/02/12 03:34:49 +0000","created_at_human":"February 12, 2015 at  3:02 AM UTC","reply_to":{"id":151875,"unique_id":"151875-2597","author":{"id":107438,"username":"RefuseToSink","avatar":"https://www.gravatar.com/avatar/7bfaca5544cedbd7d6b5ef5a60b09877?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"But, have you witnessed his face? That's some spooky stuff right there.\u003cbr\u003e\u003cbr\u003ejk, luv you michael\u0026lt;333 :)","body_tagged":"But, have you witnessed his face? That's some spooky stuff right there.\u003cbr\u003e\u003cbr\u003ejk, luv you michael\u0026lt;333 :)","created_at":"2015/02/12 02:56:47 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC"}},{"id":151893,"unique_id":"151893-1434","author":{"id":412112,"username":"_Jupiter","avatar":"https://crafatar.com/avatars/666a363d92304924827909c05576d7c0?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Omg disgusting and freaky :O","body_tagged":"Omg disgusting and freaky :O","created_at":"2015/02/12 04:24:07 +0000","created_at_human":"February 12, 2015 at  4:02 AM UTC","reply_to":{"id":151855,"unique_id":"151855-3004","author":{"id":121393,"username":"Glitchaye","avatar":"https://www.gravatar.com/avatar/8ce6c49e3d25fe96a5d778d0f8299968?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"\u003cb\u003eUnbranded Laptop\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e(shutupitsfromcreepypastawikiarentIedgy?)\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eMy brother moved out of the house back in 2002 once he got his job as a computer technician, and he recently went missing. When I went to his house, it was locked, with 3 sheets of printer paper taped to the front door.While coming home from work one day, I noticed someone had left their damaged grey laptop laying in the middle of my driveway. I got out of my car to examine it more carefully.The LCD definitely showed signs of user related damage. There was a large hole on the left side of the screen that appeared to fit a standard Phillips Head screwdriver perfectly. There was a webcam above the display, and it was also destroyed with the same screwdriver. Other than those, everything else on the computer showed minor signs of wear. Almost all of the keyboard's keys were faded, but not to the extent that the laptop could be considered unusable. I looked at the back of the display to find out what brand it is, but I couldn't find anything. I looked at the entire laptop's shell, but there was no text or logo stating what brand it was. In fact, there was no warranty sticker, no \"Proof of license\" sticker on the bottom, no text whatsoever. What was even more odd was the fact that the only ports on the laptop were a VGA port for connecting an external display and a USB port. How long could this laptop have possibly run without a charging port to recharge the battery? It must have been a very low end laptop where you had to remove the battery pack and put it into its own charging dock. Why did it have a web cam, though?Curious as to what was on the laptop, I ran inside to my basement where my old desktop was currently being stored. The reason it was down there was because I forgot to bring that behemoth to the local SarCan to recycle it. I would have been using it as my regular computer, but it takes 5 or 6 hours to fully boot because the system always goes through recovery mode every time you start it, and the processor is way too slow to \"recover\" everything on the 500 GB hard drive I had installed on it [A 120mhz Pentium processor doesn't get you far]. I removed the old LG CRT monitor from the desktop and plugged it into the laptop. I went to push the power button when......I stopped. There's no way this is going to work, the battery has to be dead by now.I rummaged around the basement to find my battery voltage tester and immediately withdrew the battery from the laptop and checked the voltage. Lo and behold, it had no charge. Well, I thought, might as well just leave it and take everything to SarCan tomorrow morning. With that, I unplugged the display from the laptop, put it back into the desktop and simply left everything downstairs. After leaving the basement I went to go watch TV for about 3 hours or so before going to bed.\u003cspan\u003eI was suddenly awakened from my deep slumber by the sound of the Windows 2000 start up jingle, and fell out of my bed. It was so deafeningly loud, I swore someone was holding a pair of speakers right next to my ears. I stood up in a groggy daze, and it took a couple of minutes to figure out what the sound was. The desktop! I must have accidentally hit the power switch while trying to switch monitors! I headed to the basement, but froze in the middle of the steps. I just remembered there was no way my computer could have started up, because I have Windows 95 installed on my desktop. I was reluctant to go down the steps after that, but my common sense started kicking in and I thought I must be getting my OS's mixed up. When I walked down, I was shocked to see that my desktop wasn't on; in fact, I remembered\u0026nbsp;\u003ci\u003eit wasn't even plugged in\u003c/i\u003e. I had to make sure of it though. I checked behind the desktop - everything else was plugged in except for the power. There was absolutely no chance of that laptop turning on, it was impossible. I removed the battery from the laptop again and re-checked the voltage.\u003c/span\u003eThis time, I couldn't get a direct number. The voltage tester was just going insane.I re-inserted the battery and pressed the power button on the laptop. Some indicator lights flashed, meaning the computer definitely started, except this time the start up jingle wasn't played at all. I needed to see what was going on here. I connected the CRT monitor back into the laptop. And what I saw...... was a bare desktop with 3 icons in the corner. The task bar was empty, and there was no Start menu button.The wallpaper was black. Why would anyone do this to their desktop? Anyone could remove all the icons, but they had to be pretty skilled hackers to remove the Start Menu button. Of the 3 icons, one was a Games folder, one was a Videos folder, and the last was the DOS Command Prompt program. Maybe this was a kids' laptop? Clicking on the Games folder confirmed my suspicions; a little girl must have owned this laptop. I felt some remorse for the poor girl because there was only 1 game in the folder. The program name was \"princess.exe\". I clicked on it just to see what the game was like. A fully animated title screen came up, with various generic fairytale princesses twirling across the screen, and then the logo flew down with a bunch of sparkly doves holding it. The game was called \"Princess Creator: Make yourself Beautiful!\" Ah, so it must have been one of those low budget \"put .png of various clothing items onto a photo of yourself\" games. I was right, as the menu popped up I was given the option to \"Dress up\" or to \"View pretty pictures\". I wanted to see what the girl looked like, so I clicked on the 2nd option. She had to have been no more than 5, and on top of that she looked very cute. She was of either Mexican or Spanish origin. She wore a somewhat tattered white dress with small red frills around the sleeves and collar. It had small roses on it. I smiled, as she looked like she had a lot of fun putting a virtual tiara on her head. However, browsing through the photos, about halfway through, there were pictures of a room with nothing else but a bed inside. She must've been dodging the camera for the hell of it, I guess.After that I felt I'd seen enough with that program, and might as well go see the other 2 files on the laptop. I decided to go into the Command Prompt to see if I could locate any other files on the hard drive. I simply got a \":\\\u0026gt;_\" line with no drive letter. Okay, this is really strange, I thought. I typed into the command box \"start C:\\\" to see if I could open the directory I wanted to explore. I pressed enter, and DOS simply replied \" 'start' is not recognized as an internal or external command, operable program or batch file.\" After a few seconds, the program crashed, bringing me back to the desktop. So I guess the last thing to look at is the videos. I double clicked the folder...... and the screen faded to black. I thought it had crashed, but I noticed that there was a small \"_\" flashing in the top left corner.Suddenly, the text \"start\u0026nbsp;:\\\u0026gt;videos\\001.wmv\" flashed briefly, then a video appeared in full screen. It was the girl again. This time, she was smiling, bouncing slightly in excitement. Her happiness made my heart feel warm. My guess was that she must've been recording herself play the dress up game with the webcam. At first she was simply moving her finger across the track pad, clicking, then giggling excitedly for a bit. She must've been laughing at the things she put on herself in the game. After about 2 minutes or so, the screen would cut to black for a fraction of a second and then return to the girl playing the game. This time, however, she was dressed differently, in a simple pink t-shirt with the words \"Go Go Girl!\" stitched in glitter. I guessed the game was recording her every time she started it, without her knowing. That made me sort of uneasy - I mean, why would anyone program a game to do that? Whatever, I guessed it was going to be the same sort of thing over and over with the video, so I might as well turn off the computer. I reached over and pressed the power button, and...... It didn't shut off this time. The video continued to play, and I saw the girl this time was wearing an orange tank top with nothing on it. She was smiling and giggling as usual, and I thought maybe I could turn off the computer after the video is done. It couldn't be that long. The video seemed to drag on, with more cuts of her playing the game in a different outfit, and I started to doze off. However, after the next cut in the video...The girl was just staring at the camera with an expressionless look on her face. Wondering what the hell was going on, I become interested in the video again. This one didn't make me smile. It made me extremely uneasy to watch her without her usual smiley face on. It was dark in the room, but there was 1 desk light on at the side. She was in some sort of night wear. What was she going to do? She sat there for a minute with that blank expression, like she wasn't thinking at all. I started to get really tense, as if something awful was about to happen.She bent over and picked up a hand saw from the left side of where she was sitting. She held it in front of her, showing it to the camera. Then, she placed the jagged blade on the side of her cheek. I cringed at what I was seeing. Slowly, she began slicing into her right cheek. Blood drizzled down her neck as she did it. Slowly, the side of her teeth began to show after about 10 seconds. As the saw went lower on her face, more of her teeth began to show on the side. Blood covered almost the entire right side of her face. She eventually got to the bottom of her jaw bone, and sawed a tiny piece off of it too. Her cheek fell to the ground with a small thud, and she put the saw in her lap and continued to stare at the camera, emotionless. I couldn't take much more of this and tore the battery out of the laptop - but the video continued to play.Then, the next cut began. The girl screamed in extreme pain. I almost fell out of my seat, it was so loud. She screamed, and put her hands over her now absent cheek. She continued to scream in agony for about 10 seconds, then a knocking was heard from the side. It was a woman, yelling in a language I couldn't understand. She was pounding the door, but not opening it. The girl must have locked it. I tried to unplug the monitor from the laptop but it was stuck in. I didn't want to see what happens next! The screaming and the yelling continued up until the next cut.She was back in her emotionless state again, but her cheek was still missing. The woman at the door was pounding and yelling still. It must have been her mother. The girl then raised the saw up to her right shoulder, and began cutting just as slowly as last time. I gagged at the sight of this. It was a holocaust of wrong. The blood began to stream out in all directions. The yelling behind the door fell silent. I guessed the other woman was trying to get someone to help her, either the father or brother or what not. When she hit the bone, an awful grinding noise could be heard. I covered my ears, but I could still hear it vividly through my hands. I noticed that a piece of her muscle got stuck on one of the steel teeth of the saw. This cut ended a lot faster than before, and the next cut was the same thing except the color from her face was draining, and her pain ridden screams became quickly weaker. Her clothing was completely red with blood on the right side.Then, she became emotionless again. Oh god, what is she going to cut off next? The mother returned with what sounded like 2 other people, and they were all yelling in the same language as before. She raised the saw, and began cutting the right side of her head off. Loud thuds were sounding at the door. They were trying to knock it down. She continued to work her way down, with blood going in all sorts of directions. The thuds still repeated themselves on the door. I was mostly confused as to how she kept going, even after she went through her brain with the saw. Her right eye rolled into the back of her head. Blood began leaking out of it. She eventually made it to the top of her mouth, where she hacked her way through bones and teeth. It was the single worst sound I have ever heard in my entire life. I still hear it in the back of my head some days. The thuds continued, and deep in the back of my mind I hoped they wouldn't be able to break the door down so they wouldn't have to see such an awful sight. She finally made it through, and with that, the right side of her head fell to the side of her neck, held on only by a piece of skin. I remember the chilling sound of her jaw being unhinged when it was tugged violently by the force of the top half of her head. She put the saw down to her side.The cut ended, and in the next cut, she simply fell face down onto the desk. Half her brain fell out onto the desk on impact, and her eye popped out of its socket. Blood pooled on the desk. The people trying to break down the door finally made it in, and they were hysterical at what they saw. Their daughter was in pieces. The mother vomited and ran out of the room. The father ran to the daughter, put her head back together and cried, holding her head at the side of his. The other man, presumably the girl's older brother, simply stared in horror at what he saw.The horrifying self mutilation finished with that cut, and the screen cut back to the empty room with the bed. With a sigh of relief that it was over I sat there, breathing heavily and sweating. I didn't realize that the room was so hot until now. I had so many questions to ask. How was all this possible? It frightened me, and I spent a good 30 minutes sitting in the chair, and finally, I got the courage to get up. I looked back at the laptop for what I hoped was the last time. The room with the bed glared on the screen. Then, it cut to something else.It was a cut of my face, in the basement, using the laptop.","body_tagged":"\u003cb\u003eUnbranded Laptop\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e(shutupitsfromcreepypastawikiarentIedgy?)\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eMy brother moved out of the house back in 2002 once he got his job as a computer technician, and he recently went missing. When I went to his house, it was locked, with 3 sheets of printer paper taped to the front door.While coming home from work one day, I noticed someone had left their damaged grey laptop laying in the middle of my driveway. I got out of my car to examine it more carefully.The LCD definitely showed signs of user related damage. There was a large hole on the left side of the screen that appeared to fit a standard Phillips Head screwdriver perfectly. There was a webcam above the display, and it was also destroyed with the same screwdriver. Other than those, everything else on the computer showed minor signs of wear. Almost all of the keyboard's keys were faded, but not to the extent that the laptop could be considered unusable. I looked at the back of the display to find out what brand it is, but I couldn't find anything. I looked at the entire laptop's shell, but there was no text or logo stating what brand it was. In fact, there was no warranty sticker, no \"Proof of license\" sticker on the bottom, no text whatsoever. What was even more odd was the fact that the only ports on the laptop were a VGA port for connecting an external display and a USB port. How long could this laptop have possibly run without a charging port to recharge the battery? It must have been a very low end laptop where you had to remove the battery pack and put it into its own charging dock. Why did it have a web cam, though?Curious as to what was on the laptop, I ran inside to my basement where my old desktop was currently being stored. The reason it was down there was because I forgot to bring that behemoth to the local SarCan to recycle it. I would have been using it as my regular computer, but it takes 5 or 6 hours to fully boot because the system always goes through recovery mode every time you start it, and the processor is way too slow to \"recover\" everything on the 500 GB hard drive I had installed on it [A 120mhz Pentium processor doesn't get you far]. I removed the old LG CRT monitor from the desktop and plugged it into the laptop. I went to push the power button when......I stopped. There's no way this is going to work, the battery has to be dead by now.I rummaged around the basement to find my battery voltage tester and immediately withdrew the battery from the laptop and checked the voltage. Lo and behold, it had no charge. Well, I thought, might as well just leave it and take everything to SarCan tomorrow morning. With that, I unplugged the display from the laptop, put it back into the desktop and simply left everything downstairs. After leaving the basement I went to go watch TV for about 3 hours or so before going to bed.\u003cspan\u003eI was suddenly awakened from my deep slumber by the sound of the Windows 2000 start up jingle, and fell out of my bed. It was so deafeningly loud, I swore someone was holding a pair of speakers right next to my ears. I stood up in a groggy daze, and it took a couple of minutes to figure out what the sound was. The desktop! I must have accidentally hit the power switch while trying to switch monitors! I headed to the basement, but froze in the middle of the steps. I just remembered there was no way my computer could have started up, because I have Windows 95 installed on my desktop. I was reluctant to go down the steps after that, but my common sense started kicking in and I thought I must be getting my OS's mixed up. When I walked down, I was shocked to see that my desktop wasn't on; in fact, I remembered\u0026nbsp;\u003ci\u003eit wasn't even plugged in\u003c/i\u003e. I had to make sure of it though. I checked behind the desktop - everything else was plugged in except for the power. There was absolutely no chance of that laptop turning on, it was impossible. I removed the battery from the laptop again and re-checked the voltage.\u003c/span\u003eThis time, I couldn't get a direct number. The voltage tester was just going insane.I re-inserted the battery and pressed the power button on the laptop. Some indicator lights flashed, meaning the computer definitely started, except this time the start up jingle wasn't played at all. I needed to see what was going on here. I connected the CRT monitor back into the laptop. And what I saw...... was a bare desktop with 3 icons in the corner. The task bar was empty, and there was no Start menu button.The wallpaper was black. Why would anyone do this to their desktop? Anyone could remove all the icons, but they had to be pretty skilled hackers to remove the Start Menu button. Of the 3 icons, one was a Games folder, one was a Videos folder, and the last was the DOS Command Prompt program. Maybe this was a kids' laptop? Clicking on the Games folder confirmed my suspicions; a little girl must have owned this laptop. I felt some remorse for the poor girl because there was only 1 game in the folder. The program name was \"princess.exe\". I clicked on it just to see what the game was like. A fully animated title screen came up, with various generic fairytale princesses twirling across the screen, and then the logo flew down with a bunch of sparkly doves holding it. The game was called \"Princess Creator: Make yourself Beautiful!\" Ah, so it must have been one of those low budget \"put .png of various clothing items onto a photo of yourself\" games. I was right, as the menu popped up I was given the option to \"Dress up\" or to \"View pretty pictures\". I wanted to see what the girl looked like, so I clicked on the 2nd option. She had to have been no more than 5, and on top of that she looked very cute. She was of either Mexican or Spanish origin. She wore a somewhat tattered white dress with small red frills around the sleeves and collar. It had small roses on it. I smiled, as she looked like she had a lot of fun putting a virtual tiara on her head. However, browsing through the photos, about halfway through, there were pictures of a room with nothing else but a bed inside. She must've been dodging the camera for the hell of it, I guess.After that I felt I'd seen enough with that program, and might as well go see the other 2 files on the laptop. I decided to go into the Command Prompt to see if I could locate any other files on the hard drive. I simply got a \":\\\u0026gt;_\" line with no drive letter. Okay, this is really strange, I thought. I typed into the command box \"start C:\\\" to see if I could open the directory I wanted to explore. I pressed enter, and DOS simply replied \" 'start' is not recognized as an internal or external command, operable program or batch file.\" After a few seconds, the program crashed, bringing me back to the desktop. So I guess the last thing to look at is the videos. I double clicked the folder...... and the screen faded to black. I thought it had crashed, but I noticed that there was a small \"_\" flashing in the top left corner.Suddenly, the text \"start\u0026nbsp;:\\\u0026gt;videos\\001.wmv\" flashed briefly, then a video appeared in full screen. It was the girl again. This time, she was smiling, bouncing slightly in excitement. Her happiness made my heart feel warm. My guess was that she must've been recording herself play the dress up game with the webcam. At first she was simply moving her finger across the track pad, clicking, then giggling excitedly for a bit. She must've been laughing at the things she put on herself in the game. After about 2 minutes or so, the screen would cut to black for a fraction of a second and then return to the girl playing the game. This time, however, she was dressed differently, in a simple pink t-shirt with the words \"Go Go Girl!\" stitched in glitter. I guessed the game was recording her every time she started it, without her knowing. That made me sort of uneasy - I mean, why would anyone program a game to do that? Whatever, I guessed it was going to be the same sort of thing over and over with the video, so I might as well turn off the computer. I reached over and pressed the power button, and...... It didn't shut off this time. The video continued to play, and I saw the girl this time was wearing an orange tank top with nothing on it. She was smiling and giggling as usual, and I thought maybe I could turn off the computer after the video is done. It couldn't be that long. The video seemed to drag on, with more cuts of her playing the game in a different outfit, and I started to doze off. However, after the next cut in the video...The girl was just staring at the camera with an expressionless look on her face. Wondering what the hell was going on, I become interested in the video again. This one didn't make me smile. It made me extremely uneasy to watch her without her usual smiley face on. It was dark in the room, but there was 1 desk light on at the side. She was in some sort of night wear. What was she going to do? She sat there for a minute with that blank expression, like she wasn't thinking at all. I started to get really tense, as if something awful was about to happen.She bent over and picked up a hand saw from the left side of where she was sitting. She held it in front of her, showing it to the camera. Then, she placed the jagged blade on the side of her cheek. I cringed at what I was seeing. Slowly, she began slicing into her right cheek. Blood drizzled down her neck as she did it. Slowly, the side of her teeth began to show after about 10 seconds. As the saw went lower on her face, more of her teeth began to show on the side. Blood covered almost the entire right side of her face. She eventually got to the bottom of her jaw bone, and sawed a tiny piece off of it too. Her cheek fell to the ground with a small thud, and she put the saw in her lap and continued to stare at the camera, emotionless. I couldn't take much more of this and tore the battery out of the laptop - but the video continued to play.Then, the next cut began. The girl screamed in extreme pain. I almost fell out of my seat, it was so loud. She screamed, and put her hands over her now absent cheek. She continued to scream in agony for about 10 seconds, then a knocking was heard from the side. It was a woman, yelling in a language I couldn't understand. She was pounding the door, but not opening it. The girl must have locked it. I tried to unplug the monitor from the laptop but it was stuck in. I didn't want to see what happens next! The screaming and the yelling continued up until the next cut.She was back in her emotionless state again, but her cheek was still missing. The woman at the door was pounding and yelling still. It must have been her mother. The girl then raised the saw up to her right shoulder, and began cutting just as slowly as last time. I gagged at the sight of this. It was a holocaust of wrong. The blood began to stream out in all directions. The yelling behind the door fell silent. I guessed the other woman was trying to get someone to help her, either the father or brother or what not. When she hit the bone, an awful grinding noise could be heard. I covered my ears, but I could still hear it vividly through my hands. I noticed that a piece of her muscle got stuck on one of the steel teeth of the saw. This cut ended a lot faster than before, and the next cut was the same thing except the color from her face was draining, and her pain ridden screams became quickly weaker. Her clothing was completely red with blood on the right side.Then, she became emotionless again. Oh god, what is she going to cut off next? The mother returned with what sounded like 2 other people, and they were all yelling in the same language as before. She raised the saw, and began cutting the right side of her head off. Loud thuds were sounding at the door. They were trying to knock it down. She continued to work her way down, with blood going in all sorts of directions. The thuds still repeated themselves on the door. I was mostly confused as to how she kept going, even after she went through her brain with the saw. Her right eye rolled into the back of her head. Blood began leaking out of it. She eventually made it to the top of her mouth, where she hacked her way through bones and teeth. It was the single worst sound I have ever heard in my entire life. I still hear it in the back of my head some days. The thuds continued, and deep in the back of my mind I hoped they wouldn't be able to break the door down so they wouldn't have to see such an awful sight. She finally made it through, and with that, the right side of her head fell to the side of her neck, held on only by a piece of skin. I remember the chilling sound of her jaw being unhinged when it was tugged violently by the force of the top half of her head. She put the saw down to her side.The cut ended, and in the next cut, she simply fell face down onto the desk. Half her brain fell out onto the desk on impact, and her eye popped out of its socket. Blood pooled on the desk. The people trying to break down the door finally made it in, and they were hysterical at what they saw. Their daughter was in pieces. The mother vomited and ran out of the room. The father ran to the daughter, put her head back together and cried, holding her head at the side of his. The other man, presumably the girl's older brother, simply stared in horror at what he saw.The horrifying self mutilation finished with that cut, and the screen cut back to the empty room with the bed. With a sigh of relief that it was over I sat there, breathing heavily and sweating. I didn't realize that the room was so hot until now. I had so many questions to ask. How was all this possible? It frightened me, and I spent a good 30 minutes sitting in the chair, and finally, I got the courage to get up. I looked back at the laptop for what I hoped was the last time. The room with the bed glared on the screen. Then, it cut to something else.It was a cut of my face, in the basement, using the laptop.","created_at":"2015/02/12 02:17:16 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC"}},{"id":151897,"unique_id":"151897-1155","author":{"id":121,"username":"Titan16","avatar":"https://crafatar.com/avatars/047d2747eaa8463eac276b4180e33b44?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"The end.","body_tagged":"The end.","created_at":"2015/02/12 04:28:52 +0000","created_at_human":"February 12, 2015 at  4:02 AM UTC","reply_to":{"id":151862,"unique_id":"151862-3434","author":{"id":6103,"username":"MerlinMaster","avatar":"https://www.gravatar.com/avatar/64353bd8b83d004bf4298dccae4754f8?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"Once there was an ugly barnacle.... he was so ugly everyone died.","body_tagged":"Once there was an ugly barnacle.... he was so ugly everyone died.","created_at":"2015/02/12 02:32:17 +0000","created_at_human":"February 12, 2015 at  2:02 AM UTC"}},{"id":151903,"unique_id":"151903-1438","author":{"id":182845,"username":"Dyspa","avatar":"https://crafatar.com/avatars/0f0237f744674b0ea90e93b1320abf1c?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"I saw your face in the \"Show your face to the world\" before the re-make now that I remember.\u003cbr\u003eP.S: Yeah, when Refuse screams, TS goes spooky.","body_tagged":"I saw your face in the \"Show your face to the world\" before the re-make now that I remember.\u003cbr\u003eP.S: Yeah, when Refuse screams, TS goes spooky.","created_at":"2015/02/12 05:13:32 +0000","created_at_human":"February 12, 2015 at  5:02 AM UTC","reply_to":{"id":151888,"unique_id":"151888-4894","author":{"id":437157,"username":"Newcleus","avatar":"https://www.gravatar.com/avatar/e0a8ea3a16343b1e99b507e2d342e8bb?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"rawr","body_tagged":"rawr","created_at":"2015/02/12 03:34:49 +0000","created_at_human":"February 12, 2015 at  3:02 AM UTC"}},{"id":152043,"unique_id":"152043-3535","author":{"id":252422,"username":"ayy","avatar":"https://crafatar.com/avatars/8fd93764620646c895c1a6d764343461?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Once I had nothing better to do than read Avicus forums and I cringed myself to death","body_tagged":"Once I had nothing better to do than read Avicus forums and I cringed myself to death","created_at":"2015/02/12 17:14:27 +0000","created_at_human":"February 12, 2015 at  5:02 PM UTC"},{"id":152047,"unique_id":"152047-3881","author":{"id":205867,"username":"Notalgicular","avatar":"https://www.gravatar.com/avatar/92baab75669e56d4cb069267fc63a72c?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"I once stuck a toothpick under my \u0026nbsp;toenail and kicked the wall as hard as I could.\u003cbr\u003eThe End","body_tagged":"I once stuck a toothpick under my \u0026nbsp;toenail and kicked the wall as hard as I could.\u003cbr\u003eThe End","created_at":"2015/02/12 17:23:39 +0000","created_at_human":"February 12, 2015 at  5:02 PM UTC"},{"id":152065,"unique_id":"152065-4465","author":{"id":385742,"username":"RightSide","avatar":"https://crafatar.com/avatars/fde3436febe54ee2a9c6d6086b8fac2f?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"One time Ivy forgot to pay the server bill :3\u003cbr\u003e\u003cbr\u003e\u003cb\u003eThe End\u003c/b\u003e","body_tagged":"One time Ivy forgot to pay the server bill :3\u003cbr\u003e\u003cbr\u003e\u003cb\u003eThe End\u003c/b\u003e","created_at":"2015/02/12 19:05:21 +0000","created_at_human":"February 12, 2015 at  7:02 PM UTC"},{"id":152069,"unique_id":"152069-4332","author":{"id":29490,"username":"Tempus","avatar":"https://crafatar.com/avatars/7a3762c451dd4f8e814be06dc49d4a59?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"dere \u0026nbsp;unce was a man. he ded\u003cbr\u003eteh end liek pl0x and give meh all teh upvotez","body_tagged":"dere \u0026nbsp;unce was a man. he ded\u003cbr\u003eteh end liek pl0x and give meh all teh upvotez","created_at":"2015/02/12 19:34:36 +0000","created_at_human":"February 12, 2015 at  7:02 PM UTC"},{"id":152070,"unique_id":"152070-2216","author":{"id":80995,"username":"Legoche","avatar":"https://www.gravatar.com/avatar/e01b7bc6ccce273cc73a8d8590832678?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"2spooky4me","body_tagged":"2spooky4me","created_at":"2015/02/12 19:36:30 +0000","created_at_human":"February 12, 2015 at  7:02 PM UTC"},{"id":152213,"unique_id":"152213-1882","author":{"id":1438,"username":"Westby","avatar":"https://crafatar.com/avatars/8b4ef61c56c64626b886d163a024ea15?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"*cringes to death*","body_tagged":"*cringes to death*","created_at":"2015/02/13 02:17:13 +0000","created_at_human":"February 13, 2015 at  2:02 AM UTC","reply_to":{"id":152047,"unique_id":"152047-1218","author":{"id":205867,"username":"Notalgicular","avatar":"https://www.gravatar.com/avatar/92baab75669e56d4cb069267fc63a72c?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"I once stuck a toothpick under my \u0026nbsp;toenail and kicked the wall as hard as I could.\u003cbr\u003eThe End","body_tagged":"I once stuck a toothpick under my \u0026nbsp;toenail and kicked the wall as hard as I could.\u003cbr\u003eThe End","created_at":"2015/02/12 17:23:39 +0000","created_at_human":"February 12, 2015 at  5:02 PM UTC"}},{"id":152230,"unique_id":"152230-208","author":{"id":108,"username":"MLGtino","avatar":"https://crafatar.com/avatars/5855cb2b462f42969c1e685db0ecd987?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Joke thread now? Ok.","body_tagged":"Joke thread now? Ok.","created_at":"2015/02/13 03:02:39 +0000","created_at_human":"February 13, 2015 at  3:02 AM UTC"},{"id":152233,"unique_id":"152233-3502","author":{"id":182482,"username":"source_route","avatar":"https://crafatar.com/avatars/f83966e508b04820b02ab43501366d8e?helm\u0026size=$SIZE$","color":"#5D5D5D","staff":false},"body":"So once a man was named pie, he has 4 finger 3 legs on each eye. He walked into an internet and he was actually a cat. U LIK? 1 LIK = 1 IPOD. SUBCRIBE. COMMENT. FAVORITE","body_tagged":"So once a man was named pie, he has 4 finger 3 legs on each eye. He walked into an internet and he was actually a cat. U LIK? 1 LIK = 1 IPOD. SUBCRIBE. COMMENT. FAVORITE","created_at":"2015/02/13 03:05:47 +0000","created_at_human":"February 13, 2015 at  3:02 AM UTC"},{"id":152244,"unique_id":"152244-4653","author":{"id":376672,"username":"StickilasFanboy","avatar":"https://crafatar.com/avatars/3f85840c8dc64a809ff60b0fb3db8580?helm\u0026size=$SIZE$","color":"#5D5D5D","staff":false},"body":"We need a scary story of Jannergod and Geor now.","body_tagged":"We need a scary story of Jannergod and Geor now.","created_at":"2015/02/13 03:32:38 +0000","created_at_human":"February 13, 2015 at  3:02 AM UTC"},{"id":152308,"unique_id":"152308-1417","author":{"id":182845,"username":"Dyspa","avatar":"https://crafatar.com/avatars/0f0237f744674b0ea90e93b1320abf1c?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"LOL\u003cbr\u003eOk, so, there was a father proud of his family, he was mexican, he tried to cross the wall but, oh boy! Da police :(\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eDon't archive this, it's just for fun ^~^","body_tagged":"LOL\u003cbr\u003eOk, so, there was a father proud of his family, he was mexican, he tried to cross the wall but, oh boy! Da police :(\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eDon't archive this, it's just for fun ^~^","created_at":"2015/02/13 05:43:58 +0000","created_at_human":"February 13, 2015 at  5:02 AM UTC","reply_to":{"id":152230,"unique_id":"152230-4833","author":{"id":108,"username":"MLGtino","avatar":"https://crafatar.com/avatars/5855cb2b462f42969c1e685db0ecd987?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Joke thread now? Ok.","body_tagged":"Joke thread now? Ok.","created_at":"2015/02/13 03:02:39 +0000","created_at_human":"February 13, 2015 at  3:02 AM UTC"}},{"id":152425,"unique_id":"152425-484","author":{"id":29263,"username":"Trexychan","avatar":"https://www.gravatar.com/avatar/1acfdd6481b0bcc76a5cf25fd55ff8a6?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"The Black-Haired Boy\u003cbr\u003e\u003cbr\u003eYou look around the room. There is nothing but blood coated wood walls rotting from the putrid body fluid. There is the decaying body of a skinned human in the corner. Its head already broken off and rolled into a corner where cockroaches feed on it. There is a small wire cage made of a bloody yellowish white substance hanging from a bloody chain made of supposedly the same material in the center. In it contains the bloody mutilated head of a little boy. \u003cbr\u003e\u003cbr\u003eA little, black haired boy.\u003cbr\u003e\u003cbr\u003eHis mouth is sliced wide open. Inside a huge 6 inch maggot is feasting on the quickly rotting tissue. The eyes have already been feasted upon. They are no more than just red fleshy nubs. There is one lightbulb in the room, working surprisingly well despite the poor condition of the cell. It casts a warm yellow light on everything. Making the bloodstains shine a deep dark color and making the heads already decaying and moldy skin look even more sickly.\u003cbr\u003e\u003cbr\u003eIts raining outside.\u003cbr\u003e\u003cbr\u003eThe raindrops strike across the muddy ground outside. Casting their watery essence all over the crop fields that span into the murky fog.\u003cbr\u003e\u003cbr\u003eYou turn to the door. You hear something. It sounds like screams. The horrid screams of children burning in acid, the screams of women watching their only child be killed right in front of their eyes, then be killed themselves.\u003cbr\u003e\u003cbr\u003eThe door bangs. You make the motion to open it. Wrenching it open you see nothing but darkness and muddy grounds. The screams still penetrate the darkness with a clear lucid sound.\u003cbr\u003e\u003cbr\u003eYou turn around to take one last look at the head.\u003cbr\u003e\u003cbr\u003eIts gone.\u003cbr\u003e\u003cbr\u003eYou look for the body.\u003cbr\u003e\u003cbr\u003eIts gone as well.\u003cbr\u003e\u003cbr\u003eWhirling around, you search the cell. You run outside into the darkness. You dont even know why you're running. You just feel the need to retrieve the head.\u003cbr\u003e\u003cbr\u003eYou stop.\u003cbr\u003e\u003cbr\u003eYou hear the sound of oncoming footsteps. Slowly trodding, in your direction. Squish, squish, squish...\u003cbr\u003e\u003cbr\u003eSquish, squish, squish.\u003cbr\u003e\u003cbr\u003eYou peer into the gloom. You see something walking towards you. It is a decaying skinless body with only flesh on its bones. The mouth sags at a weird angle, its hair... black, long and covering the face. Suddenly, the wretched grotesque beast lifts his head up to stare at you. With its dark, bleeding holes for eyes. The screams start to pick up. You cant move, no matter how hard you try. Inside your mind you see images flash before you. You see a lovely woman with her child. Her dark haired child. Laughing and playing in the sun.\u003cbr\u003e\u003cbr\u003eThe image shifts. Now it is something less pleasant. Its the image of the same woman, the same boy, screaming in unison. You see hands tear the woman away from her child. You watch as the boys skull is torn open, the head torn off \u0026nbsp;with ragged strips of flesh still trailing like red ribbons. Then the mother, skinned, and ripped of her flesh. Her bones snapped off. The vertebrae cut and whittled into small linking pieces that look like a chain. The ribs fashioned to make something like a bird cage. The rest of the body left to rot. You see the cage hung by a wire in the middle of the room now painted with blood.\u003cbr\u003e\u003cbr\u003eThe boys head placed neatly in the center. His mouth hanging open.\u003cbr\u003e\u003cbr\u003eThe images clear, you are back with the hideous deformed creature. You watch as the head tilts up, shaking furiously. The cracking of bones can be heard as the face stares straight at you. Making direct eye contact. The mouth of the black-haired boy then moves to mouth these words:\u003cbr\u003e\u003cbr\u003e\"I'm a grown-up now Daddy...\"","body_tagged":"The Black-Haired Boy\u003cbr\u003e\u003cbr\u003eYou look around the room. There is nothing but blood coated wood walls rotting from the putrid body fluid. There is the decaying body of a skinned human in the corner. Its head already broken off and rolled into a corner where cockroaches feed on it. There is a small wire cage made of a bloody yellowish white substance hanging from a bloody chain made of supposedly the same material in the center. In it contains the bloody mutilated head of a little boy. \u003cbr\u003e\u003cbr\u003eA little, black haired boy.\u003cbr\u003e\u003cbr\u003eHis mouth is sliced wide open. Inside a huge 6 inch maggot is feasting on the quickly rotting tissue. The eyes have already been feasted upon. They are no more than just red fleshy nubs. There is one lightbulb in the room, working surprisingly well despite the poor condition of the cell. It casts a warm yellow light on everything. Making the bloodstains shine a deep dark color and making the heads already decaying and moldy skin look even more sickly.\u003cbr\u003e\u003cbr\u003eIts raining outside.\u003cbr\u003e\u003cbr\u003eThe raindrops strike across the muddy ground outside. Casting their watery essence all over the crop fields that span into the murky fog.\u003cbr\u003e\u003cbr\u003eYou turn to the door. You hear something. It sounds like screams. The horrid screams of children burning in acid, the screams of women watching their only child be killed right in front of their eyes, then be killed themselves.\u003cbr\u003e\u003cbr\u003eThe door bangs. You make the motion to open it. Wrenching it open you see nothing but darkness and muddy grounds. The screams still penetrate the darkness with a clear lucid sound.\u003cbr\u003e\u003cbr\u003eYou turn around to take one last look at the head.\u003cbr\u003e\u003cbr\u003eIts gone.\u003cbr\u003e\u003cbr\u003eYou look for the body.\u003cbr\u003e\u003cbr\u003eIts gone as well.\u003cbr\u003e\u003cbr\u003eWhirling around, you search the cell. You run outside into the darkness. You dont even know why you're running. You just feel the need to retrieve the head.\u003cbr\u003e\u003cbr\u003eYou stop.\u003cbr\u003e\u003cbr\u003eYou hear the sound of oncoming footsteps. Slowly trodding, in your direction. Squish, squish, squish...\u003cbr\u003e\u003cbr\u003eSquish, squish, squish.\u003cbr\u003e\u003cbr\u003eYou peer into the gloom. You see something walking towards you. It is a decaying skinless body with only flesh on its bones. The mouth sags at a weird angle, its hair... black, long and covering the face. Suddenly, the wretched grotesque beast lifts his head up to stare at you. With its dark, bleeding holes for eyes. The screams start to pick up. You cant move, no matter how hard you try. Inside your mind you see images flash before you. You see a lovely woman with her child. Her dark haired child. Laughing and playing in the sun.\u003cbr\u003e\u003cbr\u003eThe image shifts. Now it is something less pleasant. Its the image of the same woman, the same boy, screaming in unison. You see hands tear the woman away from her child. You watch as the boys skull is torn open, the head torn off \u0026nbsp;with ragged strips of flesh still trailing like red ribbons. Then the mother, skinned, and ripped of her flesh. Her bones snapped off. The vertebrae cut and whittled into small linking pieces that look like a chain. The ribs fashioned to make something like a bird cage. The rest of the body left to rot. You see the cage hung by a wire in the middle of the room now painted with blood.\u003cbr\u003e\u003cbr\u003eThe boys head placed neatly in the center. His mouth hanging open.\u003cbr\u003e\u003cbr\u003eThe images clear, you are back with the hideous deformed creature. You watch as the head tilts up, shaking furiously. The cracking of bones can be heard as the face stares straight at you. Making direct eye contact. The mouth of the black-haired boy then moves to mouth these words:\u003cbr\u003e\u003cbr\u003e\"I'm a grown-up now Daddy...\"","created_at":"2015/02/13 14:11:27 +0000","created_at_human":"February 13, 2015 at  2:02 PM UTC"},{"id":152472,"unique_id":"152472-4022","author":{"id":29490,"username":"Tempus","avatar":"https://crafatar.com/avatars/7a3762c451dd4f8e814be06dc49d4a59?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Sweet H Jesus, Trexy.","body_tagged":"Sweet H Jesus, Trexy.","created_at":"2015/02/13 16:10:49 +0000","created_at_human":"February 13, 2015 at  4:02 PM UTC"},{"id":152478,"unique_id":"152478-4216","author":{"id":121393,"username":"Glitchaye","avatar":"https://www.gravatar.com/avatar/8ce6c49e3d25fe96a5d778d0f8299968?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"9/10\u003cbr\u003e\u003cbr\u003eThis is good.","body_tagged":"9/10\u003cbr\u003e\u003cbr\u003eThis is good.","created_at":"2015/02/13 16:27:09 +0000","created_at_human":"February 13, 2015 at  4:02 PM UTC","reply_to":{"id":152425,"unique_id":"152425-4744","author":{"id":29263,"username":"Trexychan","avatar":"https://www.gravatar.com/avatar/1acfdd6481b0bcc76a5cf25fd55ff8a6?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"The Black-Haired Boy\u003cbr\u003e\u003cbr\u003eYou look around the room. There is nothing but blood coated wood walls rotting from the putrid body fluid. There is the decaying body of a skinned human in the corner. Its head already broken off and rolled into a corner where cockroaches feed on it. There is a small wire cage made of a bloody yellowish white substance hanging from a bloody chain made of supposedly the same material in the center. In it contains the bloody mutilated head of a little boy. \u003cbr\u003e\u003cbr\u003eA little, black haired boy.\u003cbr\u003e\u003cbr\u003eHis mouth is sliced wide open. Inside a huge 6 inch maggot is feasting on the quickly rotting tissue. The eyes have already been feasted upon. They are no more than just red fleshy nubs. There is one lightbulb in the room, working surprisingly well despite the poor condition of the cell. It casts a warm yellow light on everything. Making the bloodstains shine a deep dark color and making the heads already decaying and moldy skin look even more sickly.\u003cbr\u003e\u003cbr\u003eIts raining outside.\u003cbr\u003e\u003cbr\u003eThe raindrops strike across the muddy ground outside. Casting their watery essence all over the crop fields that span into the murky fog.\u003cbr\u003e\u003cbr\u003eYou turn to the door. You hear something. It sounds like screams. The horrid screams of children burning in acid, the screams of women watching their only child be killed right in front of their eyes, then be killed themselves.\u003cbr\u003e\u003cbr\u003eThe door bangs. You make the motion to open it. Wrenching it open you see nothing but darkness and muddy grounds. The screams still penetrate the darkness with a clear lucid sound.\u003cbr\u003e\u003cbr\u003eYou turn around to take one last look at the head.\u003cbr\u003e\u003cbr\u003eIts gone.\u003cbr\u003e\u003cbr\u003eYou look for the body.\u003cbr\u003e\u003cbr\u003eIts gone as well.\u003cbr\u003e\u003cbr\u003eWhirling around, you search the cell. You run outside into the darkness. You dont even know why you're running. You just feel the need to retrieve the head.\u003cbr\u003e\u003cbr\u003eYou stop.\u003cbr\u003e\u003cbr\u003eYou hear the sound of oncoming footsteps. Slowly trodding, in your direction. Squish, squish, squish...\u003cbr\u003e\u003cbr\u003eSquish, squish, squish.\u003cbr\u003e\u003cbr\u003eYou peer into the gloom. You see something walking towards you. It is a decaying skinless body with only flesh on its bones. The mouth sags at a weird angle, its hair... black, long and covering the face. Suddenly, the wretched grotesque beast lifts his head up to stare at you. With its dark, bleeding holes for eyes. The screams start to pick up. You cant move, no matter how hard you try. Inside your mind you see images flash before you. You see a lovely woman with her child. Her dark haired child. Laughing and playing in the sun.\u003cbr\u003e\u003cbr\u003eThe image shifts. Now it is something less pleasant. Its the image of the same woman, the same boy, screaming in unison. You see hands tear the woman away from her child. You watch as the boys skull is torn open, the head torn off \u0026nbsp;with ragged strips of flesh still trailing like red ribbons. Then the mother, skinned, and ripped of her flesh. Her bones snapped off. The vertebrae cut and whittled into small linking pieces that look like a chain. The ribs fashioned to make something like a bird cage. The rest of the body left to rot. You see the cage hung by a wire in the middle of the room now painted with blood.\u003cbr\u003e\u003cbr\u003eThe boys head placed neatly in the center. His mouth hanging open.\u003cbr\u003e\u003cbr\u003eThe images clear, you are back with the hideous deformed creature. You watch as the head tilts up, shaking furiously. The cracking of bones can be heard as the face stares straight at you. Making direct eye contact. The mouth of the black-haired boy then moves to mouth these words:\u003cbr\u003e\u003cbr\u003e\"I'm a grown-up now Daddy...\"","body_tagged":"The Black-Haired Boy\u003cbr\u003e\u003cbr\u003eYou look around the room. There is nothing but blood coated wood walls rotting from the putrid body fluid. There is the decaying body of a skinned human in the corner. Its head already broken off and rolled into a corner where cockroaches feed on it. There is a small wire cage made of a bloody yellowish white substance hanging from a bloody chain made of supposedly the same material in the center. In it contains the bloody mutilated head of a little boy. \u003cbr\u003e\u003cbr\u003eA little, black haired boy.\u003cbr\u003e\u003cbr\u003eHis mouth is sliced wide open. Inside a huge 6 inch maggot is feasting on the quickly rotting tissue. The eyes have already been feasted upon. They are no more than just red fleshy nubs. There is one lightbulb in the room, working surprisingly well despite the poor condition of the cell. It casts a warm yellow light on everything. Making the bloodstains shine a deep dark color and making the heads already decaying and moldy skin look even more sickly.\u003cbr\u003e\u003cbr\u003eIts raining outside.\u003cbr\u003e\u003cbr\u003eThe raindrops strike across the muddy ground outside. Casting their watery essence all over the crop fields that span into the murky fog.\u003cbr\u003e\u003cbr\u003eYou turn to the door. You hear something. It sounds like screams. The horrid screams of children burning in acid, the screams of women watching their only child be killed right in front of their eyes, then be killed themselves.\u003cbr\u003e\u003cbr\u003eThe door bangs. You make the motion to open it. Wrenching it open you see nothing but darkness and muddy grounds. The screams still penetrate the darkness with a clear lucid sound.\u003cbr\u003e\u003cbr\u003eYou turn around to take one last look at the head.\u003cbr\u003e\u003cbr\u003eIts gone.\u003cbr\u003e\u003cbr\u003eYou look for the body.\u003cbr\u003e\u003cbr\u003eIts gone as well.\u003cbr\u003e\u003cbr\u003eWhirling around, you search the cell. You run outside into the darkness. You dont even know why you're running. You just feel the need to retrieve the head.\u003cbr\u003e\u003cbr\u003eYou stop.\u003cbr\u003e\u003cbr\u003eYou hear the sound of oncoming footsteps. Slowly trodding, in your direction. Squish, squish, squish...\u003cbr\u003e\u003cbr\u003eSquish, squish, squish.\u003cbr\u003e\u003cbr\u003eYou peer into the gloom. You see something walking towards you. It is a decaying skinless body with only flesh on its bones. The mouth sags at a weird angle, its hair... black, long and covering the face. Suddenly, the wretched grotesque beast lifts his head up to stare at you. With its dark, bleeding holes for eyes. The screams start to pick up. You cant move, no matter how hard you try. Inside your mind you see images flash before you. You see a lovely woman with her child. Her dark haired child. Laughing and playing in the sun.\u003cbr\u003e\u003cbr\u003eThe image shifts. Now it is something less pleasant. Its the image of the same woman, the same boy, screaming in unison. You see hands tear the woman away from her child. You watch as the boys skull is torn open, the head torn off \u0026nbsp;with ragged strips of flesh still trailing like red ribbons. Then the mother, skinned, and ripped of her flesh. Her bones snapped off. The vertebrae cut and whittled into small linking pieces that look like a chain. The ribs fashioned to make something like a bird cage. The rest of the body left to rot. You see the cage hung by a wire in the middle of the room now painted with blood.\u003cbr\u003e\u003cbr\u003eThe boys head placed neatly in the center. His mouth hanging open.\u003cbr\u003e\u003cbr\u003eThe images clear, you are back with the hideous deformed creature. You watch as the head tilts up, shaking furiously. The cracking of bones can be heard as the face stares straight at you. Making direct eye contact. The mouth of the black-haired boy then moves to mouth these words:\u003cbr\u003e\u003cbr\u003e\"I'm a grown-up now Daddy...\"","created_at":"2015/02/13 14:11:27 +0000","created_at_human":"February 13, 2015 at  2:02 PM UTC"}}]}