{"id":8623,"unique_id":"8623-1795","author":{"id":251732,"username":"ViceTechnicolour","avatar":"https://www.gravatar.com/avatar/861d5b48b234c65cfcdb12de7285749f?s=$SIZE$\u0026default=mm","color":"#006BD2","staff":true},"body":"\u003ci\u003eRead the story first, don't scroll down.\u003cbr\u003e(Written by ParaSpider ;o))\u003c/i\u003e\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;Don’t ask me how I ever got afraid of the simplest things. Don’t ask me how I have little fears, big fears, or anything in between. I am just a nervous person, and when things like this happen, especially to me, I break down in my own way. I have a tendency to even fear myself – sometimes I hear voices in my head and feel people touching me when they really aren’t. Sensitivity is really difficult to adapt to, but I can’t quite do much about it when it’s what is given to me. No matter what location, street, or atom that lays beneath my feet, chances are is that I’m going to be afraid. I can’t help my fears, no matter what counseling I take or any precautions to not build up a new fear, it still happens. I look into the mirror, and I just don’t see myself; rather, it’s the opposite. I see someone completely different, a man who isn't a man. A man who gets squashed by his own mind, even when I try to stop the malicious thoughts. But this isn't about the fears in general I have—it’s the fear I had this week.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;\u003cb\u003eMONDAY\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;I was laying down in my soft, comfortable bed with a coffee on my table beside and the window being in alignment with the bed, straight ahead. Looking at the snowflakes fall down and crumble into the piles and piles of snow, it made me think. With the branches clicking against the window with the day coming to a close, wrapped up in a layer of moonlight was my neighborhood with antennae dots blinking in all variations of color; red, blue, yellow, and a purple. I’d look at them blink for hours with maybe a book on the side, but today was no different than the usual; cold, and not only on the outside, but in the inside. I didn’t really mind how the day was going, it wasn’t my concern; until the blinking lights eventually grew larger.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;I had better eyesight than that. Nothing paranormal was going on, or anything wicked. Looking at the lights, they became blurrier and my room seemed to be shadier. With me wiping my eyes with my hands, the lights stopped blinking. Nothing was then wrong, except the shade became darker. It stayed like that for hours—and I was too afraid to move. Wrapping my arms snugly around my pillow and my blanket around me, I drifted off until I fell into a sleeping spell. I heard faint beeps and wind, and that’s all it seemed to be. Faint beeps and wind.I didn’t question it.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;\u003cb\u003eTUESDAY\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;What a great way to wake up, with warmer weather. I put my hands on my sheets, and pulled them down, pushing them to the left of my bed. Ready to start the day, I put my feet on the floor and glared at the window. The lights weren’t visible, so I didn’t know the status on that, but what I did know is that I needed to eat some breakfast. Not bothered to take off my pajamas, I walked three rooms from mine into the kitchen to fix some eggs. When I grabbed ahold of the carton, there was a sharpie mark on them. Since I live alone, it’s unusual but I still grabbed them anyway and set them out on the counter. Grabbing a pan, I placed it on the stove and heated up the oven—at least I thought I did.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;The numbers kept resetting. No matter how many times I tried, it would cycle to what I wanted, then automatically go back to zero. Yes, I got nervous and I thought, due to the events last night and this morning, something would be wrong. But I didn’t listen, and I grabbed ahold of the pan and the egg. \u0026nbsp;Cracking open the egg, I saw a black zig-zag line go across like it should, and I opened both ends for the yolk to slide out. But there was no yolk. It was completely empty and I was hesitant to check the rest, but I did. Each one was empty, and the oven set itself to “10 degrees”. Did I know what this meant? No. But I wanted to get out of that house, for it has certainly ruined my mind and has given me fear which I didn’t need. I have to be strong, so I endured the emotional pain of being messed with. I didn’t enjoy the feeling of my stomach constantly dropping, but I did enjoy the fact I had going back to sleep as an option. No matter what the calendar says—I am on my own schedule. So I went back to my room, and laid in the bed. The shade was still the same, but the radio was slightly releasing static noises. I wanted to unplug it, but I thought it would help me sleep. Grabbing the blanket and fluffing the pillow, I laid down.\u003cbr\u003e\u003cbr\u003eI didn’t question it.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;\u003cb\u003e WEDNESDAY\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;Full on sleep, I opened my eyes and wiped them. It was night and I slept through the day itself, however it didn’t bother me. My first instinct was to look at the window, and that’s what I tried to do—look at the window.\u003cbr\u003e\u003cbr\u003eBut it wasn’t there.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;I was frozen for a moment and couldn’t barely move due to the shock I was in. I sneaked over to my cabinet, and to my surprise nothing was there. The only thing functional was the radio, and the signals had gotten stronger. I couldn’t hardly make out a voice, but I decided it’d be best for me to leave the building for a couple of nights and rent an apartment, which would be the best option. With my computer in the other room, I went up to the corner and sat down in the chair with my feet flat and my hands shaking. I wanted to see some prices in the local area, but for some reason my internet browser’s search wouldn’t work. Every time I entered text, it translated itself into Russian. I ran through my bookmarks, and I felt a chill down my spine, like something passed through me. I squeezed the mouse and I tried every bookmark and none but one worked. It was a translation tool.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;I copied the text over and it said “HELP. ME.”\u0026nbsp;A tab started playing audio, and it was like backwards text with screams and crying children, along with faint scratching and old, vintage sound like it was recorded in the 1900s. I closed it immediately, but it reopened. Terrified, I pulled out the computer’s plug, but the room became darker and the radio played the same exact noise.\u0026nbsp;I ran out of my bedroom into the street.\u003cbr\u003e\u003cbr\u003eI questioned it.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u003cb\u003eTHURSDAY\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;I was crying due to the paranormal activity, but I must’ve passed out because it was Thursday. \u0026nbsp;I was miles and miles away from my home at this point from the running Wednesday, but it didn’t make me feel any safer. I still could hear the voices and shrieks that occurred, and the children’s horrifying yells. Going into a convenience store across from where I was, I grabbed a donut and looked at the clerk. She was an older sweet lady, but she would never understand. She could see I was shaken, and I wasn’t even sure with what happened anyway. With her asking what was wrong, I just said “Weird stuff.” and the old lady responded with “Oh, is that so?” Yeah, it was so. She punched up the donut and handed it to me, with me giving out the only change I had. Upon me grabbing onto it and stuffing it into a bag from the counter she gave to me, she wished for things to get better. I needed that luck, and I could have really used it, but it seemed like she was kind of shady for some reason. How she looked, it wasn’t normal.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;I grabbed onto a pole and closed my eyes for a second, but it must have been more before the lady sneaked up on me and put a trash bag over my head. She tied it with my head in it and dragged me over, no matter how hard I bit or kicked. My attempts to get out of the trap were useless and that was that. I could not hear that much audible conversation as it seemed mumbled, but the lady untied the bag after 3 minutes or so into a very small room cluttered with brooms and extra plastic bags. She said goodbye and I just stared at her. I laid down on the floor, put my arms around my knees, and cried. \u003cbr\u003e\u003cbr\u003eCried myself to sleep.\u003cbr\u003e\u003cbr\u003eI questioned it.\u003cbr\u003e\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;\u0026nbsp;\u003cbr\u003e\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;\u003cb\u003e FRIDAY\u003cbr\u003e\u003c/b\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;So it was Friday. I recognized where I was, it was a janitor’s closet for the store. I don’t know what has been going on, but I’ve been close to several heart attacks and all I could hear is her ringing up prices and having small talk with customers. Until she turned on the radio.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;The horrible noise was back. The room became minute by minute foggier and gray, to the point where I was blinded. I was not comfortable in this environment and I wanted to get out, but the only escape I could have is either from a key, or using one of the items to break open the door. Since the door was bolted down and highly reinforced, I was going insane because of the noises and the images in my head of what went on. Without ability to see, I flailed my hands forward looking for items, but I cut myself from the edge of from what I assumed to be a bucket. Feeling blood rush down my wrist, I tried to yell but it was just an echo within my own confinement. I heard steps, but it wasn’t the old lady. This person breathed very heavy and scratched at the door. With me blind and trying to find something to defend myself with, I grabbed a broomstick and readied a position like a baseball player and his bat. With the noises, I started beating in the door making little dents. I heard a screech, and it was a very low key layered with many other lower keys in the voice. I could tell by now it was a man, very well a man, however he punched his fist through the reinforcements with all the banging and clattering, I felt him touch me but I swung my broomstick at him. I felt a squish and the fog started to clear. Once I could see, I looked at his hand and it was stuck in the door, cut off. He was screaming the loudest I’ve ever heard anyone scream, yet in such a low voice. He opened the door (with his other hand I assume), and I rushed my way out with blood on the broomstick. The man started limping due to his pain and he grabbed onto the lady for support, but she fell over too. They both screamed at me, and a customer who witnessed all this just collapsed on the floor right there. No time to save the customer, only me.\u003cbr\u003e\u003cbr\u003eI ran away and ran away and ran away. I ran as far as I could. It still felt like I wasn’t far enough, but I knew it was.\u003cbr\u003e\u003cbr\u003eI blinked and I appeared at my house.\u0026nbsp;\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;\u003cb\u003e SATURDAY\u003cbr\u003e\u003c/b\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;Unequipped, it’s like the day started over. I obviously didn’t eat my donut, but everything was the same as it usually was; except there were no doors. Every time I walked near the door, it creaked and said “HELP ME” in a very scary voice. I couldn’t stand the pressure anymore, and I wanted this to all end. I rushed over to my closet, but it started fading away. I rushed over to my coat rack, it started fading away. The floor also was very shaded and dark, and the room became… well, it became reflective like a mirror. It was all just mirrors over a process of time, and it wasn’t something I was willing to deal with. I smashed my head against the glass, and sure enough it broke. Everything I saw though was red, and the noise was back—from the radio. I was not sane and I just held my pillow for a long process of time even though that was red. I heard a voice, like an intercom, and it said “Attention all K-Mart shoppers, the store will be closing in 5 minutes”.\u0026nbsp;\u003cbr\u003e\u003cbr\u003eI woke up in the middle of K-Mart with ten guards around me.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eOh, and Sunday was spent in jail.","body_tagged":"\u003ci\u003eRead the story first, don't scroll down.\u003cbr\u003e(Written by ParaSpider ;o))\u003c/i\u003e\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;Don’t ask me how I ever got afraid of the simplest things. Don’t ask me how I have little fears, big fears, or anything in between. I am just a nervous person, and when things like this happen, especially to me, I break down in my own way. I have a tendency to even fear myself – sometimes I hear voices in my head and feel people touching me when they really aren’t. Sensitivity is really difficult to adapt to, but I can’t quite do much about it when it’s what is given to me. No matter what location, street, or atom that lays beneath my feet, chances are is that I’m going to be afraid. I can’t help my fears, no matter what counseling I take or any precautions to not build up a new fear, it still happens. I look into the mirror, and I just don’t see myself; rather, it’s the opposite. I see someone completely different, a man who isn't a man. A man who gets squashed by his own mind, even when I try to stop the malicious thoughts. But this isn't about the fears in general I have—it’s the fear I had this week.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;\u003cb\u003eMONDAY\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;I was laying down in my soft, comfortable bed with a coffee on my table beside and the window being in alignment with the bed, straight ahead. Looking at the snowflakes fall down and crumble into the piles and piles of snow, it made me think. With the branches clicking against the window with the day coming to a close, wrapped up in a layer of moonlight was my neighborhood with antennae dots blinking in all variations of color; red, blue, yellow, and a purple. I’d look at them blink for hours with maybe a book on the side, but today was no different than the usual; cold, and not only on the outside, but in the inside. I didn’t really mind how the day was going, it wasn’t my concern; until the blinking lights eventually grew larger.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;I had better eyesight than that. Nothing paranormal was going on, or anything wicked. Looking at the lights, they became blurrier and my room seemed to be shadier. With me wiping my eyes with my hands, the lights stopped blinking. Nothing was then wrong, except the shade became darker. It stayed like that for hours—and I was too afraid to move. Wrapping my arms snugly around my pillow and my blanket around me, I drifted off until I fell into a sleeping spell. I heard faint beeps and wind, and that’s all it seemed to be. Faint beeps and wind.I didn’t question it.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;\u003cb\u003eTUESDAY\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;What a great way to wake up, with warmer weather. I put my hands on my sheets, and pulled them down, pushing them to the left of my bed. Ready to start the day, I put my feet on the floor and glared at the window. The lights weren’t visible, so I didn’t know the status on that, but what I did know is that I needed to eat some breakfast. Not bothered to take off my pajamas, I walked three rooms from mine into the kitchen to fix some eggs. When I grabbed ahold of the carton, there was a sharpie mark on them. Since I live alone, it’s unusual but I still grabbed them anyway and set them out on the counter. Grabbing a pan, I placed it on the stove and heated up the oven—at least I thought I did.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;The numbers kept resetting. No matter how many times I tried, it would cycle to what I wanted, then automatically go back to zero. Yes, I got nervous and I thought, due to the events last night and this morning, something would be wrong. But I didn’t listen, and I grabbed ahold of the pan and the egg. \u0026nbsp;Cracking open the egg, I saw a black zig-zag line go across like it should, and I opened both ends for the yolk to slide out. But there was no yolk. It was completely empty and I was hesitant to check the rest, but I did. Each one was empty, and the oven set itself to “10 degrees”. Did I know what this meant? No. But I wanted to get out of that house, for it has certainly ruined my mind and has given me fear which I didn’t need. I have to be strong, so I endured the emotional pain of being messed with. I didn’t enjoy the feeling of my stomach constantly dropping, but I did enjoy the fact I had going back to sleep as an option. No matter what the calendar says—I am on my own schedule. So I went back to my room, and laid in the bed. The shade was still the same, but the radio was slightly releasing static noises. I wanted to unplug it, but I thought it would help me sleep. Grabbing the blanket and fluffing the pillow, I laid down.\u003cbr\u003e\u003cbr\u003eI didn’t question it.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;\u003cb\u003e WEDNESDAY\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;Full on sleep, I opened my eyes and wiped them. It was night and I slept through the day itself, however it didn’t bother me. My first instinct was to look at the window, and that’s what I tried to do—look at the window.\u003cbr\u003e\u003cbr\u003eBut it wasn’t there.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;I was frozen for a moment and couldn’t barely move due to the shock I was in. I sneaked over to my cabinet, and to my surprise nothing was there. The only thing functional was the radio, and the signals had gotten stronger. I couldn’t hardly make out a voice, but I decided it’d be best for me to leave the building for a couple of nights and rent an apartment, which would be the best option. With my computer in the other room, I went up to the corner and sat down in the chair with my feet flat and my hands shaking. I wanted to see some prices in the local area, but for some reason my internet browser’s search wouldn’t work. Every time I entered text, it translated itself into Russian. I ran through my bookmarks, and I felt a chill down my spine, like something passed through me. I squeezed the mouse and I tried every bookmark and none but one worked. It was a translation tool.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;I copied the text over and it said “HELP. ME.”\u0026nbsp;A tab started playing audio, and it was like backwards text with screams and crying children, along with faint scratching and old, vintage sound like it was recorded in the 1900s. I closed it immediately, but it reopened. Terrified, I pulled out the computer’s plug, but the room became darker and the radio played the same exact noise.\u0026nbsp;I ran out of my bedroom into the street.\u003cbr\u003e\u003cbr\u003eI questioned it.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u003cb\u003eTHURSDAY\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;I was crying due to the paranormal activity, but I must’ve passed out because it was Thursday. \u0026nbsp;I was miles and miles away from my home at this point from the running Wednesday, but it didn’t make me feel any safer. I still could hear the voices and shrieks that occurred, and the children’s horrifying yells. Going into a convenience store across from where I was, I grabbed a donut and looked at the clerk. She was an older sweet lady, but she would never understand. She could see I was shaken, and I wasn’t even sure with what happened anyway. With her asking what was wrong, I just said “Weird stuff.” and the old lady responded with “Oh, is that so?” Yeah, it was so. She punched up the donut and handed it to me, with me giving out the only change I had. Upon me grabbing onto it and stuffing it into a bag from the counter she gave to me, she wished for things to get better. I needed that luck, and I could have really used it, but it seemed like she was kind of shady for some reason. How she looked, it wasn’t normal.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;I grabbed onto a pole and closed my eyes for a second, but it must have been more before the lady sneaked up on me and put a trash bag over my head. She tied it with my head in it and dragged me over, no matter how hard I bit or kicked. My attempts to get out of the trap were useless and that was that. I could not hear that much audible conversation as it seemed mumbled, but the lady untied the bag after 3 minutes or so into a very small room cluttered with brooms and extra plastic bags. She said goodbye and I just stared at her. I laid down on the floor, put my arms around my knees, and cried. \u003cbr\u003e\u003cbr\u003eCried myself to sleep.\u003cbr\u003e\u003cbr\u003eI questioned it.\u003cbr\u003e\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;\u0026nbsp;\u003cbr\u003e\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;\u003cb\u003e FRIDAY\u003cbr\u003e\u003c/b\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;So it was Friday. I recognized where I was, it was a janitor’s closet for the store. I don’t know what has been going on, but I’ve been close to several heart attacks and all I could hear is her ringing up prices and having small talk with customers. Until she turned on the radio.\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;The horrible noise was back. The room became minute by minute foggier and gray, to the point where I was blinded. I was not comfortable in this environment and I wanted to get out, but the only escape I could have is either from a key, or using one of the items to break open the door. Since the door was bolted down and highly reinforced, I was going insane because of the noises and the images in my head of what went on. Without ability to see, I flailed my hands forward looking for items, but I cut myself from the edge of from what I assumed to be a bucket. Feeling blood rush down my wrist, I tried to yell but it was just an echo within my own confinement. I heard steps, but it wasn’t the old lady. This person breathed very heavy and scratched at the door. With me blind and trying to find something to defend myself with, I grabbed a broomstick and readied a position like a baseball player and his bat. With the noises, I started beating in the door making little dents. I heard a screech, and it was a very low key layered with many other lower keys in the voice. I could tell by now it was a man, very well a man, however he punched his fist through the reinforcements with all the banging and clattering, I felt him touch me but I swung my broomstick at him. I felt a squish and the fog started to clear. Once I could see, I looked at his hand and it was stuck in the door, cut off. He was screaming the loudest I’ve ever heard anyone scream, yet in such a low voice. He opened the door (with his other hand I assume), and I rushed my way out with blood on the broomstick. The man started limping due to his pain and he grabbed onto the lady for support, but she fell over too. They both screamed at me, and a customer who witnessed all this just collapsed on the floor right there. No time to save the customer, only me.\u003cbr\u003e\u003cbr\u003eI ran away and ran away and ran away. I ran as far as I could. It still felt like I wasn’t far enough, but I knew it was.\u003cbr\u003e\u003cbr\u003eI blinked and I appeared at my house.\u0026nbsp;\u003cbr\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;\u003cb\u003e SATURDAY\u003cbr\u003e\u003c/b\u003e\u003cbr\u003e\u0026nbsp; \u0026nbsp;Unequipped, it’s like the day started over. I obviously didn’t eat my donut, but everything was the same as it usually was; except there were no doors. Every time I walked near the door, it creaked and said “HELP ME” in a very scary voice. I couldn’t stand the pressure anymore, and I wanted this to all end. I rushed over to my closet, but it started fading away. I rushed over to my coat rack, it started fading away. The floor also was very shaded and dark, and the room became… well, it became reflective like a mirror. It was all just mirrors over a process of time, and it wasn’t something I was willing to deal with. I smashed my head against the glass, and sure enough it broke. Everything I saw though was red, and the noise was back—from the radio. I was not sane and I just held my pillow for a long process of time even though that was red. I heard a voice, like an intercom, and it said “Attention all K-Mart shoppers, the store will be closing in 5 minutes”.\u0026nbsp;\u003cbr\u003e\u003cbr\u003eI woke up in the middle of K-Mart with ten guards around me.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eOh, and Sunday was spent in jail.","created_at":"2014/11/22 05:00:00 +0000","created_at_human":"November 22, 2014 at  5:11 AM UTC","title":"[STORY] The Saga of Para","replies":[{"id":114931,"unique_id":"114931-2717","author":{"id":6361,"username":"Emmaye","avatar":"https://www.gravatar.com/avatar/abed267c620d5e6347952892f3431f7b?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"K-Mart Guards win","body_tagged":"K-Mart Guards win","created_at":"2014/11/22 05:02:34 +0000","created_at_human":"November 22, 2014 at  5:11 AM UTC"},{"id":114932,"unique_id":"114932-4229","author":{"id":14214,"username":"AutoHit","avatar":"https://crafatar.com/avatars/cecccb5004d64dd29220df4a633f0687?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"gg K-Mart","body_tagged":"gg K-Mart","created_at":"2014/11/22 05:04:37 +0000","created_at_human":"November 22, 2014 at  5:11 AM UTC"},{"id":115020,"unique_id":"115020-1312","author":{"id":222281,"username":"OPTOBAT","avatar":"https://crafatar.com/avatars/502f7dcfb6d94f85a94b97a15b0c951c?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"hahah K-Mart gg :)\u003cbr\u003eNice story and creativity :)","body_tagged":"hahah K-Mart gg :)\u003cbr\u003eNice story and creativity :)","created_at":"2014/11/22 14:35:29 +0000","created_at_human":"November 22, 2014 at  2:11 PM UTC"},{"id":115034,"unique_id":"115034-1137","author":{"id":6564,"username":"kycrafft","avatar":"https://www.gravatar.com/avatar/b3bcefeeb60e1af497aa9a36dacbc965?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"But who was phone?","body_tagged":"But who was phone?","created_at":"2014/11/22 15:51:27 +0000","created_at_human":"November 22, 2014 at  3:11 PM UTC"},{"id":115452,"unique_id":"115452-2743","author":{"id":263841,"username":"Myv","avatar":"https://crafatar.com/avatars/68cfe240d81c46ae8a939e3eb5d71e3e?helm\u0026size=$SIZE$","color":"#2980b9","staff":true},"body":"I couldn't be bothered to read this. xD\u003cbr\u003e\u003cbr\u003eGreat story doe","body_tagged":"I couldn't be bothered to read this. xD\u003cbr\u003e\u003cbr\u003eGreat story doe","created_at":"2014/11/23 11:53:18 +0000","created_at_human":"November 23, 2014 at 11:11 AM UTC"},{"id":115488,"unique_id":"115488-101","author":{"id":279387,"username":"Aanszo","avatar":"https://crafatar.com/avatars/41721ee0869040a58c18ce4ec44cfd8d?helm\u0026size=$SIZE$","color":"#5D5D5D","staff":false},"body":"Haha K-Mart wrecked ya \u0026lt;3","body_tagged":"Haha K-Mart wrecked ya \u0026lt;3","created_at":"2014/11/23 13:52:46 +0000","created_at_human":"November 23, 2014 at  1:11 PM UTC"},{"id":217879,"unique_id":"217879-1332","author":{"id":251732,"username":"ViceTechnicolour","avatar":"https://www.gravatar.com/avatar/861d5b48b234c65cfcdb12de7285749f?s=$SIZE$\u0026default=mm","color":"#006BD2","staff":true},"body":"Oh, and now K-Mart went out of business.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e(Reviving because tons of story posts)","body_tagged":"Oh, and now K-Mart went out of business.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e(Reviving because tons of story posts)","created_at":"2015/08/11 04:29:08 +0000","created_at_human":"August 11, 2015 at  4:08 AM UTC"},{"id":217880,"unique_id":"217880-3587","author":{"id":397065,"username":"ex_optic","avatar":"https://www.gravatar.com/avatar/b50adf1b9f7ed2f5b758b89dd0031213?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"K-Mart.","body_tagged":"K-Mart.","created_at":"2015/08/11 04:30:28 +0000","created_at_human":"August 11, 2015 at  4:08 AM UTC"},{"id":217881,"unique_id":"217881-2126","author":{"id":397065,"username":"ex_optic","avatar":"https://www.gravatar.com/avatar/b50adf1b9f7ed2f5b758b89dd0031213?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"GG.","body_tagged":"GG.","created_at":"2015/08/11 04:41:30 +0000","created_at_human":"August 11, 2015 at  4:08 AM UTC","reply_to":{"id":217880,"unique_id":"217880-4076","author":{"id":397065,"username":"ex_optic","avatar":"https://www.gravatar.com/avatar/b50adf1b9f7ed2f5b758b89dd0031213?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"K-Mart.","body_tagged":"K-Mart.","created_at":"2015/08/11 04:30:28 +0000","created_at_human":"August 11, 2015 at  4:08 AM UTC"}}]}