{"id":11042,"unique_id":"11042-3","author":{"id":292963,"username":"FrozenSolstice","avatar":"https://crafatar.com/avatars/8bacbc710bf84a1fa8fa71453487cd89?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Hey everyone!\u003cbr\u003e\u003cbr\u003eNow that this title has attracted your attention, let's start!\u003cbr\u003eThis forum game is essentially about posting spooky ghost stories! They can either be made up or real. Evidence is also wonderful!\u003cbr\u003e\u003cbr\u003eThe aim of the game is to try think through the above persons' story, trying to make sense of it and break it down.\u003cbr\u003e\u003cbr\u003eI'll post my story later, I need to get on my other laptop for evidence.\u003cbr\u003e\u003cbr\u003eHappy ghost-busting!","body_tagged":"Hey everyone!\u003cbr\u003e\u003cbr\u003eNow that this title has attracted your attention, let's start!\u003cbr\u003eThis forum game is essentially about posting spooky ghost stories! They can either be made up or real. Evidence is also wonderful!\u003cbr\u003e\u003cbr\u003eThe aim of the game is to try think through the above persons' story, trying to make sense of it and break it down.\u003cbr\u003e\u003cbr\u003eI'll post my story later, I need to get on my other laptop for evidence.\u003cbr\u003e\u003cbr\u003eHappy ghost-busting!","created_at":"2015/02/15 10:14:37 +0000","created_at_human":"February 15, 2015 at 10:02 AM UTC","title":"[Forum Game] You've seen a ghost!","replies":[{"id":153246,"unique_id":"153246-2937","author":{"id":443064,"username":"Blacksmiths","avatar":"https://crafatar.com/avatars/6c3685b6fb5043e0af3c93b51c28364f?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"..... I LOVED UR STORY ! ID BUY UR BOOKS","body_tagged":"..... I LOVED UR STORY ! ID BUY UR BOOKS","created_at":"2015/02/15 10:22:41 +0000","created_at_human":"February 15, 2015 at 10:02 AM UTC","reply_to":{"id":153244,"unique_id":"153244-2552","author":{"id":220819,"username":"TurkishDelite","avatar":"https://crafatar.com/avatars/9c58b4b50c434182a862c3c9364355be?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Two years ago, a bunch of my friends and I went on a school sponsored trip to Alaska set up by the Pursuit Institute. I was placed in a group with nine, no, ten other students, and two adult chaperones. Another group was also made up of similar numbers, and each group would start at one location and then we would switch places halfway through. The trip would consist mostly of hiking and backpacking in Denali where we would camp in tents and then hiking near the Kenai Peninsula where we would stay in a cabin.We arrived in Anchorage at about 2:00 in the morning, but it was still light out as Alaska never really got dark that time of year. Our groups parted ways after claiming our baggage, and my group began our trip by driving to Denali National Park where we would be spending the next several days. We all had a great time and before we knew it, it was time to meet up with the other group and trade places for the second half of our trip.We converged in front of a supermarket and the two groups swapped stories and shared some laughs. It was all fun, but I couldn’t shake the feeling that something was . . . wrong with the other group. Their stories would be incredibly vague or they would just stop halfway through as if they caught themselves from mentioning something without even realizing it.It was all incredibly eerie but no one but me seemed to notice. When I tried to question them further or go into detail about their trip they would simply become dazed and say that it was really all just a blur. Then, getting defensive, they would ask me details about our trip so far. I scoffed and tried to remember a specific event only to find that . . . I really didn’t remember much either. In fact, as I began listening to my groups own stories, we were being just as vague as them! It was all so strange that no one, not even I, immediately noticed that the other group was short one kid.Suddenly though, it hit me.“Where’s Josh?” I asked the group. Everyone turned to face me, their eyes seemed glazed and cloudy as their faces reflected my own confusion right back at me. What they said next made my blood run cold.With such genuine seriousness that it couldn’t have possibly been a joke, one by one, they asked, “Who the hell is Josh?” Even the adults looked puzzled.Giving a nervous laugh, I turned to my own group for support only to see that they were looking at me with the same expressions. Confusion was plastered across every one of their faces, looking at me with blank eyes. Then, suddenly, confusion turned to laughter as if they realized that I had been joking.“Haha! Nice man! You had me goin’ for a second there!” Matt said as the mood quickly lightened back up. I laughed with them and pretended that it had been a joke, but all I felt was a horrible sickness rising up inside me.That’s when a kid from the other group said, “Haha, but seriously, what’s with YOUR group? You guys are acting all weird and . . . where is Sarah?”“Haha, very funny.”“Yeah real original.” Members of both groups snapped back at him, almost in unison. No one named Sarah had even been in our group, and even I was pissed that he was making fun of me. That is, until I saw the look on his face.When no one took him seriously, his appearance was bleached to a deathly pale tone and his eyes widened, shifting from side to side nervously. Then he looked at me. Our eyes met and we both knew that something was horribly wrong. Although we couldn’t really be sure that the other was telling the truth, we both seemingly knew someone who was now forgotten. We simply stood there for what felt like forever, staring at each other.He looked horrified, I’m sure I did too. Before I got a chance to talk to him however, we were shoved into our separate cars and were on our way to our new destinations, their group to Denali, ours to the Cabin. I doubted talking to him would’ve done any good anyway though. What could either of us have said? He didn’t remember Josh and I sure as hell didn’t know anyone named Sarah.The more I thought about it, the more I began to convince myself that it must have been a joke by everyone to screw with me. A group joke that everyone was in on except for me. Josh was probably just hiding in the car, laughing his ass off. I felt like such an idiot for believing that that another kid had experienced what I had when he was really just flat out mocking me in front of everyone! I buried my face in my hands. Part of me was angry, but I was mostly relieved. It certainly made more sense to think that it was all just a joke on me. I was actually impressed that they’d got the adults in on it too.But, overall, I was still pretty pissed and I decided that the next time I saw the kid who mocked me; I would punch him straight in the face! How dare he mess with me by making up someone! Sarah Duffy, yeah right!My mind froze . . . Duffy? He had never said a last name. Where did I get that from? And why did it sound so familiar?! What startled me was that I even had a face to put with the name! My mind suddenly exploded with pictures and memories.Sarah! She was my best god damn friend! How the hell did I forget about her?! I was clutching my head and gasping for air as everyone in the car looked at me and began yelling for me to calm the hell down. I couldn’t calm down though, my mind felt like it was being smashed with a sledge hammer and the more my memory cleared, the worse it got. Pain, the likes of which I had never experienced before, racked my body as I curled into a ball shivering and straining to maintain consciousness. The memories continued rushing back into my head, threatening to split my mind in two until, suddenly, it was over.I sat up, and, bleary eyed, looked around me. Everyone stared right back at me, terrified.“Guys, Sarah! Sarah Duffy! Please, dear God, tell me you remember her!” I practically screamed.Their faces once again switched to anger.“God damnit John!” One of the adult chaperons yelled, “We thought you were having a seizer or something! If you pull one more stunt like that for the sake of a joke, we’ll send you straight home! Are you okay? What the hell was that?”I began tearing up, “You guys don’t know Sarah? She- . . . she was my friend! She was YOUR friend for Christ’s sake!” I began searching for a specific memory. “Kevin, you made fun of her goofy hair right when we got off of the plane in Anchorage!” I cried, “Please, for the love of god, tell me you remember that!”No one said a thing. They all just stared at me with judgmental expressions.“That joke has run its course.” Kevin said coldly.Not a one of them showed any signs of recognition, but I knew she was real! Or had been anyway. What the hell had happened to her? I strained and tried to remember the last time I had seen her, but any recent memories were still illusive and blurry.No matter how hard I tried, all thinking about it did was bring back the headaches and pain. Finally, I was forced to stop or everyone would begin to seriously worry about me again.I just sat in the car for the next several hours of the drive and stared out the window at the bleak, grey surroundings, as rain ran down the glass. It had been raining since we arrived in Alaska, and it showed no signs of letting up for the next couple of days at least.Finally, we arrived at the entrance to the trail that would take us to the cabin the other group had stayed at. We unloaded our packs, strapped them on, and set out on our 7 mile hike to where the secluded lakeside cabin lay. It was about 2:00 in the morning, but since it never really got dark out, our plan was to hike in immediately and get there by 5:00 so as to have a full day ahead of us.That being said however, the constant rain and low-set clouds made for poor visibility and the hike in was a struggle to say the least. Through the thick fog, it was near impossible to even make out a tree branch before it struck you in the face, seemingly out of nowhere. Being mindful of possible grizzly bears, we took care to keep our group loud so as to scare them off. About an hour in, we were all singing “Journey” at the top of our lungs when I suddenly fell to my knees, and then collapsed to the muddy ground, clutching my head. I had once again been trying to remember when I had last seen Sarah when it all came flooding back in a horrific wave of grotesque images and unimaginable terrors.There we were, at the Denali campground. The torrential rain pelted down and the sky was so dark that for the first time since we had been there, it actually seemed like night. Everyone was settling down under the tarp around the campfire, and many people were already asleep in their tents. That’s when Jenna asked if anyone had seen Sarah as she still hadn’t washed her dishes.“I’m pretty sure she went to bed already,” I said, “I don’t want to be creepy, but I’ll go check to be sure.”I reluctantly walked away from the warmth of the fire and into the oppressive darkness and driving cold rain. As I approached her tent, I could tell that she wasn’t inside as it was unzipped with the door lying wide open. I immediately ran to close it.What an idiot! I thought to myself, the tent is completely soaked inside now!That’s when I heard her muffled, agonizing scream. It came from somewhere in the woods surrounding the campground and I, without thinking, immediately ran off into the forest after her. After shoving my way through thick spruce and willows, I reached a clearing where I could barely see Sarah’s body on the ground as some . . . thing, which was mostly obscured by trees and underbrush, was ripping her open. She was screaming with all of her might but the thing’s bony hooked hand was covering her mouth. Its long fingers curled almost all the way around her head. The sound of her death was horrendous as bones snapped and skin was peeled away. I wanted to help, but couldn’t bring myself to move.Sarah was long dead by the time I realized that the creature, was beginning to . . . wear her. It had hallowed her out and was now sewing her lifeless corpse onto itself. I was still paralyzed with fear when it suddenly turned towards me.Sarah’s grotesque, shredded carcass was now horribly reanimated, and it began crawling towards me like some kind of broken marionette as her dead eyes looked straight ahead, yet saw nothing.I finally broke out of my trance and began frantically sprinting back towards camp. Sarah’s corpse could’ve easily caught me crawling, but the thick underbrush forced it to stand up awkwardly and begin a demented walk in which everything moved all wrong. This fortunately gave me enough time to reach the safety of the campfire, although, when I arrived, I had no idea what I had been running from . . . or really any of what I had just done.No one asked me if Sarah had really been asleep, because none of us knew a “Sarah.”And that thing, pretending to be her, cringing at the light of the fire, slowly slunk back into the dark of the forest.I bolted upright to people yelling, cursing, and struggling to their feet. I had been near the front if the group, so when I feel to ground, many people behind me tripped over my body and then tripped the people behind them.\u003cspan\u003e“Oh God! I’m sorry you guys!” I cried, “The uh, the ground is really slick here!”\u003cbr\u003eGrumbles were heard and several insults flew my way but we all eventually got up and continued moving. My mind was racing. The fact that I could remember Sarah when no one else could must have had something to with seeing the creature before it stole her skin.\u003cbr\u003eFor me, it must have just been the initial shock that caused the lapse in memory. It was for this same reason that I could remember Josh while the other kid didn’t.\u003c/span\u003eMy blood froze. He didn’t remember Josh because his memory had blocked the horror from him . . . because he had seen Josh being taken in the exact same area in which we were now hiking! And our bear calls were bringing it right to us!Breathing heavy, I slowly turned my head around to look behind me.Sure enough, following from quite a distance, and just barely visible in the bleak grey fog, I could see the silhouette of some sort of fucked-up human impersonation; grotesquely stumbling along just behind our group . . . wearing the decaying face of Josh. Its limbs swayed and bent in directions impossible for a human to imitate, and there were seams where the skin split away and was held together with nothing but a few fleshy strands. When the creature saw me looking, it darted away off the path, but I could tell that it was still following us. It was waiting for something.I doubted it would attack us with such a large group and I was sure that no one would believe me, and so I was forced to simply continue hiking.Finally, we reached the cabin and everyone tried to get some last minute sleep before we started our day. Everyone but me. I KNEW that thing was sulking around in the darkness of the woods surrounding the cabin, waiting for one of us to go out alone.Morning came and everyone quickly prepared for our hike of the day. We would be hiking up a mountain which required some intense bush-whacking just to reach the base thus realistically making the trip at least 4 hours both ways. We packed our lunches, consisting of nothing but protein bars and water, and zipped up our raingear as the weather was still nothing short of a downpour. The sky remained a depressing grey and light thunder could be heard rumbling in the distance.That’s when someone said what I had been dreading. The worst case scenario.Ashley stepped forward and apologetically said, “Sorry everyone, but I feel . . . just terrible, I think I’ll stay behind on this one, you guys go on ahead, I’ll stay here at the cabin.”“No!” I cried, “You have to come with us! We have to stay together!” Everyone turned and looked at me.“Jesus John, if she’s not feeling well, let her stay.” Pam scorned.“Ah,” I stammered, “That’s not it! I just . . . Uh, fine! I’ll stay too!”“You don’t have to do that John.” Ashley said, “I’ll be fine here alone.”“No you won’t!” I wanted to scream, but I had to calm my nerves. “Naw, I didn’t wanna go on this dumb hike anyway.” I laughed, “You guys have fun though!”Everyone looked at me weirdly, and then glanced at each other, before shrugging and heading off into the woods. I wasn’t sure if we would be any safer with just the two of us, but what else could I have done? We would just have to buckle down inside the cabin and hope for the best. As soon as the others disappeared out of sight I turned to Ashley and said, “Alright, we need to get inside the cabin now.”“I appreciate you staying with me and all . . . but you’re kinda freakin me out.” She said.“Haha, sorry,” I awkwardly laughed, “It’s pretty damn wet out here though, we should really inside?”“Yeah, that’s a good plan,” She stated slowly, “I better lay down for a bit.”That’s when I saw him, or . . . It . . . standing twenty or so feet behind Ashley. Josh’s decaying corpse; horribly stretched and disfigured in order to cover whatever thing was wearing it. Ashley saw me looking and turned around to let out a strangled squeak. “Wha . . . What the fuck is that?!” She screamed. I said nothing and simply grabbed her arm, taking off running to the cabin, slamming the door behind us. The thing didn’t run after us, rather, it began slowly walking towards the cabin. It knew we had nowhere to go. I locked the door and scrambled to barricade it with anything I could find.Now there was nothing to do but watch its demented impression of a person as it crawled ever so slowly towards the door. Its hands dragged along to muddy ground and its fleshy skin hide swayed ever so softly as it staggered.“What the hell is that?” Ashley kept repeating over and over between her ragged breaths.“I don’t know,” I stammered, “I just don’t know.”“What does it want?!” She screamed as it reached the door and tried the handle.“I assume, it wants a new . . . Coat.” I said through clenched teeth.She drew a breath and fell to the ground before looking up at me, horrified. The thing moved away from the door and now stood a few inches behind one of the windows, staring in at us. Its cold gaze could be felt from behind the dead eyes of Josh’s face and we could hear skin widening as it smiled. It was messing with us.Ashley broke down and began weeping, “Leave us alone!” She cried, “Get the hell away!”The thing did nothing and simply stood there motionless. Then, it slowly lifted up one of its hands and began lightly rapping on the window.Knock, knock, knock. A slow steady rhythm.It had no intention of breaking the window or anything. It just wanted to let us know that it was there.Not that we needed the reminder. I couldn’t take my eyes off it. This continued for several hours as the sunlight slowly faded and the rain and wind picked up. Soon the sound of it knocking was almost drowned out and I was having to strain to see it in the dim light. Heavy sheets of water whipped around and obscured its form. At one point I let my eyes wander for too long, and when I looked back, it was gone. The knocking had stopped. I bolted upright just in time to barely catch a glimpse of it disappearing around the side of the cabin.“This is bad.” I said, “I think it’s tired of waiting.”Ashley let out a squeal and buried her face in her hands. I wasn’t sure if it could get in from somewhere else but it clearly knew something we didn’t.“It’s ok,” I said, thinking fast, trying to pep talk myself more than anything, “all we need to do is wait for the others to get back! They should be here any minute now!”“Who?” Ashley asked.“The rest of our group!” I said, “Kevin, Lauren, Pam? Those guys! Remember?”“I- . . . I Don’t know who you’re talking about.” She stated, looking at me puzzled, “It’s always been just the two of us.”My heart practically stopped, and as I sunk to the ground in despair, I began to hear knocks . . . all around the cabin.\u003cbr\u003eHope you love my story \u0026lt;3\u0026nbsp;\u003cbr\u003e\u0026nbsp;Credit To –\u0026nbsp;liam vickers you happy now\u0026nbsp;FrozenSolstice","body_tagged":"Two years ago, a bunch of my friends and I went on a school sponsored trip to Alaska set up by the Pursuit Institute. I was placed in a group with nine, no, ten other students, and two adult chaperones. Another group was also made up of similar numbers, and each group would start at one location and then we would switch places halfway through. The trip would consist mostly of hiking and backpacking in Denali where we would camp in tents and then hiking near the Kenai Peninsula where we would stay in a cabin.We arrived in Anchorage at about 2:00 in the morning, but it was still light out as Alaska never really got dark that time of year. Our groups parted ways after claiming our baggage, and my group began our trip by driving to Denali National Park where we would be spending the next several days. We all had a great time and before we knew it, it was time to meet up with the other group and trade places for the second half of our trip.We converged in front of a supermarket and the two groups swapped stories and shared some laughs. It was all fun, but I couldn’t shake the feeling that something was . . . wrong with the other group. Their stories would be incredibly vague or they would just stop halfway through as if they caught themselves from mentioning something without even realizing it.It was all incredibly eerie but no one but me seemed to notice. When I tried to question them further or go into detail about their trip they would simply become dazed and say that it was really all just a blur. Then, getting defensive, they would ask me details about our trip so far. I scoffed and tried to remember a specific event only to find that . . . I really didn’t remember much either. In fact, as I began listening to my groups own stories, we were being just as vague as them! It was all so strange that no one, not even I, immediately noticed that the other group was short one kid.Suddenly though, it hit me.“Where’s Josh?” I asked the group. Everyone turned to face me, their eyes seemed glazed and cloudy as their faces reflected my own confusion right back at me. What they said next made my blood run cold.With such genuine seriousness that it couldn’t have possibly been a joke, one by one, they asked, “Who the hell is Josh?” Even the adults looked puzzled.Giving a nervous laugh, I turned to my own group for support only to see that they were looking at me with the same expressions. Confusion was plastered across every one of their faces, looking at me with blank eyes. Then, suddenly, confusion turned to laughter as if they realized that I had been joking.“Haha! Nice man! You had me goin’ for a second there!” Matt said as the mood quickly lightened back up. I laughed with them and pretended that it had been a joke, but all I felt was a horrible sickness rising up inside me.That’s when a kid from the other group said, “Haha, but seriously, what’s with YOUR group? You guys are acting all weird and . . . where is Sarah?”“Haha, very funny.”“Yeah real original.” Members of both groups snapped back at him, almost in unison. No one named Sarah had even been in our group, and even I was pissed that he was making fun of me. That is, until I saw the look on his face.When no one took him seriously, his appearance was bleached to a deathly pale tone and his eyes widened, shifting from side to side nervously. Then he looked at me. Our eyes met and we both knew that something was horribly wrong. Although we couldn’t really be sure that the other was telling the truth, we both seemingly knew someone who was now forgotten. We simply stood there for what felt like forever, staring at each other.He looked horrified, I’m sure I did too. Before I got a chance to talk to him however, we were shoved into our separate cars and were on our way to our new destinations, their group to Denali, ours to the Cabin. I doubted talking to him would’ve done any good anyway though. What could either of us have said? He didn’t remember Josh and I sure as hell didn’t know anyone named Sarah.The more I thought about it, the more I began to convince myself that it must have been a joke by everyone to screw with me. A group joke that everyone was in on except for me. Josh was probably just hiding in the car, laughing his ass off. I felt like such an idiot for believing that that another kid had experienced what I had when he was really just flat out mocking me in front of everyone! I buried my face in my hands. Part of me was angry, but I was mostly relieved. It certainly made more sense to think that it was all just a joke on me. I was actually impressed that they’d got the adults in on it too.But, overall, I was still pretty pissed and I decided that the next time I saw the kid who mocked me; I would punch him straight in the face! How dare he mess with me by making up someone! Sarah Duffy, yeah right!My mind froze . . . Duffy? He had never said a last name. Where did I get that from? And why did it sound so familiar?! What startled me was that I even had a face to put with the name! My mind suddenly exploded with pictures and memories.Sarah! She was my best god damn friend! How the hell did I forget about her?! I was clutching my head and gasping for air as everyone in the car looked at me and began yelling for me to calm the hell down. I couldn’t calm down though, my mind felt like it was being smashed with a sledge hammer and the more my memory cleared, the worse it got. Pain, the likes of which I had never experienced before, racked my body as I curled into a ball shivering and straining to maintain consciousness. The memories continued rushing back into my head, threatening to split my mind in two until, suddenly, it was over.I sat up, and, bleary eyed, looked around me. Everyone stared right back at me, terrified.“Guys, Sarah! Sarah Duffy! Please, dear God, tell me you remember her!” I practically screamed.Their faces once again switched to anger.“God damnit John!” One of the adult chaperons yelled, “We thought you were having a seizer or something! If you pull one more stunt like that for the sake of a joke, we’ll send you straight home! Are you okay? What the hell was that?”I began tearing up, “You guys don’t know Sarah? She- . . . she was my friend! She was YOUR friend for Christ’s sake!” I began searching for a specific memory. “Kevin, you made fun of her goofy hair right when we got off of the plane in Anchorage!” I cried, “Please, for the love of god, tell me you remember that!”No one said a thing. They all just stared at me with judgmental expressions.“That joke has run its course.” Kevin said coldly.Not a one of them showed any signs of recognition, but I knew she was real! Or had been anyway. What the hell had happened to her? I strained and tried to remember the last time I had seen her, but any recent memories were still illusive and blurry.No matter how hard I tried, all thinking about it did was bring back the headaches and pain. Finally, I was forced to stop or everyone would begin to seriously worry about me again.I just sat in the car for the next several hours of the drive and stared out the window at the bleak, grey surroundings, as rain ran down the glass. It had been raining since we arrived in Alaska, and it showed no signs of letting up for the next couple of days at least.Finally, we arrived at the entrance to the trail that would take us to the cabin the other group had stayed at. We unloaded our packs, strapped them on, and set out on our 7 mile hike to where the secluded lakeside cabin lay. It was about 2:00 in the morning, but since it never really got dark out, our plan was to hike in immediately and get there by 5:00 so as to have a full day ahead of us.That being said however, the constant rain and low-set clouds made for poor visibility and the hike in was a struggle to say the least. Through the thick fog, it was near impossible to even make out a tree branch before it struck you in the face, seemingly out of nowhere. Being mindful of possible grizzly bears, we took care to keep our group loud so as to scare them off. About an hour in, we were all singing “Journey” at the top of our lungs when I suddenly fell to my knees, and then collapsed to the muddy ground, clutching my head. I had once again been trying to remember when I had last seen Sarah when it all came flooding back in a horrific wave of grotesque images and unimaginable terrors.There we were, at the Denali campground. The torrential rain pelted down and the sky was so dark that for the first time since we had been there, it actually seemed like night. Everyone was settling down under the tarp around the campfire, and many people were already asleep in their tents. That’s when Jenna asked if anyone had seen Sarah as she still hadn’t washed her dishes.“I’m pretty sure she went to bed already,” I said, “I don’t want to be creepy, but I’ll go check to be sure.”I reluctantly walked away from the warmth of the fire and into the oppressive darkness and driving cold rain. As I approached her tent, I could tell that she wasn’t inside as it was unzipped with the door lying wide open. I immediately ran to close it.What an idiot! I thought to myself, the tent is completely soaked inside now!That’s when I heard her muffled, agonizing scream. It came from somewhere in the woods surrounding the campground and I, without thinking, immediately ran off into the forest after her. After shoving my way through thick spruce and willows, I reached a clearing where I could barely see Sarah’s body on the ground as some . . . thing, which was mostly obscured by trees and underbrush, was ripping her open. She was screaming with all of her might but the thing’s bony hooked hand was covering her mouth. Its long fingers curled almost all the way around her head. The sound of her death was horrendous as bones snapped and skin was peeled away. I wanted to help, but couldn’t bring myself to move.Sarah was long dead by the time I realized that the creature, was beginning to . . . wear her. It had hallowed her out and was now sewing her lifeless corpse onto itself. I was still paralyzed with fear when it suddenly turned towards me.Sarah’s grotesque, shredded carcass was now horribly reanimated, and it began crawling towards me like some kind of broken marionette as her dead eyes looked straight ahead, yet saw nothing.I finally broke out of my trance and began frantically sprinting back towards camp. Sarah’s corpse could’ve easily caught me crawling, but the thick underbrush forced it to stand up awkwardly and begin a demented walk in which everything moved all wrong. This fortunately gave me enough time to reach the safety of the campfire, although, when I arrived, I had no idea what I had been running from . . . or really any of what I had just done.No one asked me if Sarah had really been asleep, because none of us knew a “Sarah.”And that thing, pretending to be her, cringing at the light of the fire, slowly slunk back into the dark of the forest.I bolted upright to people yelling, cursing, and struggling to their feet. I had been near the front if the group, so when I feel to ground, many people behind me tripped over my body and then tripped the people behind them.\u003cspan\u003e“Oh God! I’m sorry you guys!” I cried, “The uh, the ground is really slick here!”\u003cbr\u003eGrumbles were heard and several insults flew my way but we all eventually got up and continued moving. My mind was racing. The fact that I could remember Sarah when no one else could must have had something to with seeing the creature before it stole her skin.\u003cbr\u003eFor me, it must have just been the initial shock that caused the lapse in memory. It was for this same reason that I could remember Josh while the other kid didn’t.\u003c/span\u003eMy blood froze. He didn’t remember Josh because his memory had blocked the horror from him . . . because he had seen Josh being taken in the exact same area in which we were now hiking! And our bear calls were bringing it right to us!Breathing heavy, I slowly turned my head around to look behind me.Sure enough, following from quite a distance, and just barely visible in the bleak grey fog, I could see the silhouette of some sort of fucked-up human impersonation; grotesquely stumbling along just behind our group . . . wearing the decaying face of Josh. Its limbs swayed and bent in directions impossible for a human to imitate, and there were seams where the skin split away and was held together with nothing but a few fleshy strands. When the creature saw me looking, it darted away off the path, but I could tell that it was still following us. It was waiting for something.I doubted it would attack us with such a large group and I was sure that no one would believe me, and so I was forced to simply continue hiking.Finally, we reached the cabin and everyone tried to get some last minute sleep before we started our day. Everyone but me. I KNEW that thing was sulking around in the darkness of the woods surrounding the cabin, waiting for one of us to go out alone.Morning came and everyone quickly prepared for our hike of the day. We would be hiking up a mountain which required some intense bush-whacking just to reach the base thus realistically making the trip at least 4 hours both ways. We packed our lunches, consisting of nothing but protein bars and water, and zipped up our raingear as the weather was still nothing short of a downpour. The sky remained a depressing grey and light thunder could be heard rumbling in the distance.That’s when someone said what I had been dreading. The worst case scenario.Ashley stepped forward and apologetically said, “Sorry everyone, but I feel . . . just terrible, I think I’ll stay behind on this one, you guys go on ahead, I’ll stay here at the cabin.”“No!” I cried, “You have to come with us! We have to stay together!” Everyone turned and looked at me.“Jesus John, if she’s not feeling well, let her stay.” Pam scorned.“Ah,” I stammered, “That’s not it! I just . . . Uh, fine! I’ll stay too!”“You don’t have to do that John.” Ashley said, “I’ll be fine here alone.”“No you won’t!” I wanted to scream, but I had to calm my nerves. “Naw, I didn’t wanna go on this dumb hike anyway.” I laughed, “You guys have fun though!”Everyone looked at me weirdly, and then glanced at each other, before shrugging and heading off into the woods. I wasn’t sure if we would be any safer with just the two of us, but what else could I have done? We would just have to buckle down inside the cabin and hope for the best. As soon as the others disappeared out of sight I turned to Ashley and said, “Alright, we need to get inside the cabin now.”“I appreciate you staying with me and all . . . but you’re kinda freakin me out.” She said.“Haha, sorry,” I awkwardly laughed, “It’s pretty damn wet out here though, we should really inside?”“Yeah, that’s a good plan,” She stated slowly, “I better lay down for a bit.”That’s when I saw him, or . . . It . . . standing twenty or so feet behind Ashley. Josh’s decaying corpse; horribly stretched and disfigured in order to cover whatever thing was wearing it. Ashley saw me looking and turned around to let out a strangled squeak. “Wha . . . What the fuck is that?!” She screamed. I said nothing and simply grabbed her arm, taking off running to the cabin, slamming the door behind us. The thing didn’t run after us, rather, it began slowly walking towards the cabin. It knew we had nowhere to go. I locked the door and scrambled to barricade it with anything I could find.Now there was nothing to do but watch its demented impression of a person as it crawled ever so slowly towards the door. Its hands dragged along to muddy ground and its fleshy skin hide swayed ever so softly as it staggered.“What the hell is that?” Ashley kept repeating over and over between her ragged breaths.“I don’t know,” I stammered, “I just don’t know.”“What does it want?!” She screamed as it reached the door and tried the handle.“I assume, it wants a new . . . Coat.” I said through clenched teeth.She drew a breath and fell to the ground before looking up at me, horrified. The thing moved away from the door and now stood a few inches behind one of the windows, staring in at us. Its cold gaze could be felt from behind the dead eyes of Josh’s face and we could hear skin widening as it smiled. It was messing with us.Ashley broke down and began weeping, “Leave us alone!” She cried, “Get the hell away!”The thing did nothing and simply stood there motionless. Then, it slowly lifted up one of its hands and began lightly rapping on the window.Knock, knock, knock. A slow steady rhythm.It had no intention of breaking the window or anything. It just wanted to let us know that it was there.Not that we needed the reminder. I couldn’t take my eyes off it. This continued for several hours as the sunlight slowly faded and the rain and wind picked up. Soon the sound of it knocking was almost drowned out and I was having to strain to see it in the dim light. Heavy sheets of water whipped around and obscured its form. At one point I let my eyes wander for too long, and when I looked back, it was gone. The knocking had stopped. I bolted upright just in time to barely catch a glimpse of it disappearing around the side of the cabin.“This is bad.” I said, “I think it’s tired of waiting.”Ashley let out a squeal and buried her face in her hands. I wasn’t sure if it could get in from somewhere else but it clearly knew something we didn’t.“It’s ok,” I said, thinking fast, trying to pep talk myself more than anything, “all we need to do is wait for the others to get back! They should be here any minute now!”“Who?” Ashley asked.“The rest of our group!” I said, “Kevin, Lauren, Pam? Those guys! Remember?”“I- . . . I Don’t know who you’re talking about.” She stated, looking at me puzzled, “It’s always been just the two of us.”My heart practically stopped, and as I sunk to the ground in despair, I began to hear knocks . . . all around the cabin.\u003cbr\u003eHope you love my story \u0026lt;3\u0026nbsp;\u003cbr\u003e\u0026nbsp;Credit To –\u0026nbsp;liam vickers you happy now\u0026nbsp;FrozenSolstice","created_at":"2015/02/15 10:20:04 +0000","created_at_human":"February 15, 2015 at 10:02 AM UTC"}},{"id":153251,"unique_id":"153251-3464","author":{"id":441993,"username":"Aphelion","avatar":"https://crafatar.com/avatars/a134e3bb0631417784bf4f64751eb1b0?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Hahahaha, you know scamming is not allowed :)\u003cbr\u003e\u003cbr\u003e\u003ca href=\"http://www.creepypasta.com/pursuit-institute/\" rel=\"nofollow\" target=\"_blank\"\u003ehttp://www.creepypasta.com/pursuit-institute/\u003c/a\u003e","body_tagged":"Hahahaha, you know scamming is not allowed :)\u003cbr\u003e\u003cbr\u003e\u003ca href=\"http://www.creepypasta.com/pursuit-institute/\" rel=\"nofollow\" target=\"_blank\"\u003ehttp://www.creepypasta.com/pursuit-institute/\u003c/a\u003e","created_at":"2015/02/15 10:29:28 +0000","created_at_human":"February 15, 2015 at 10:02 AM UTC","reply_to":{"id":153244,"unique_id":"153244-2244","author":{"id":220819,"username":"TurkishDelite","avatar":"https://crafatar.com/avatars/9c58b4b50c434182a862c3c9364355be?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Two years ago, a bunch of my friends and I went on a school sponsored trip to Alaska set up by the Pursuit Institute. I was placed in a group with nine, no, ten other students, and two adult chaperones. Another group was also made up of similar numbers, and each group would start at one location and then we would switch places halfway through. The trip would consist mostly of hiking and backpacking in Denali where we would camp in tents and then hiking near the Kenai Peninsula where we would stay in a cabin.We arrived in Anchorage at about 2:00 in the morning, but it was still light out as Alaska never really got dark that time of year. Our groups parted ways after claiming our baggage, and my group began our trip by driving to Denali National Park where we would be spending the next several days. We all had a great time and before we knew it, it was time to meet up with the other group and trade places for the second half of our trip.We converged in front of a supermarket and the two groups swapped stories and shared some laughs. It was all fun, but I couldn’t shake the feeling that something was . . . wrong with the other group. Their stories would be incredibly vague or they would just stop halfway through as if they caught themselves from mentioning something without even realizing it.It was all incredibly eerie but no one but me seemed to notice. When I tried to question them further or go into detail about their trip they would simply become dazed and say that it was really all just a blur. Then, getting defensive, they would ask me details about our trip so far. I scoffed and tried to remember a specific event only to find that . . . I really didn’t remember much either. In fact, as I began listening to my groups own stories, we were being just as vague as them! It was all so strange that no one, not even I, immediately noticed that the other group was short one kid.Suddenly though, it hit me.“Where’s Josh?” I asked the group. Everyone turned to face me, their eyes seemed glazed and cloudy as their faces reflected my own confusion right back at me. What they said next made my blood run cold.With such genuine seriousness that it couldn’t have possibly been a joke, one by one, they asked, “Who the hell is Josh?” Even the adults looked puzzled.Giving a nervous laugh, I turned to my own group for support only to see that they were looking at me with the same expressions. Confusion was plastered across every one of their faces, looking at me with blank eyes. Then, suddenly, confusion turned to laughter as if they realized that I had been joking.“Haha! Nice man! You had me goin’ for a second there!” Matt said as the mood quickly lightened back up. I laughed with them and pretended that it had been a joke, but all I felt was a horrible sickness rising up inside me.That’s when a kid from the other group said, “Haha, but seriously, what’s with YOUR group? You guys are acting all weird and . . . where is Sarah?”“Haha, very funny.”“Yeah real original.” Members of both groups snapped back at him, almost in unison. No one named Sarah had even been in our group, and even I was pissed that he was making fun of me. That is, until I saw the look on his face.When no one took him seriously, his appearance was bleached to a deathly pale tone and his eyes widened, shifting from side to side nervously. Then he looked at me. Our eyes met and we both knew that something was horribly wrong. Although we couldn’t really be sure that the other was telling the truth, we both seemingly knew someone who was now forgotten. We simply stood there for what felt like forever, staring at each other.He looked horrified, I’m sure I did too. Before I got a chance to talk to him however, we were shoved into our separate cars and were on our way to our new destinations, their group to Denali, ours to the Cabin. I doubted talking to him would’ve done any good anyway though. What could either of us have said? He didn’t remember Josh and I sure as hell didn’t know anyone named Sarah.The more I thought about it, the more I began to convince myself that it must have been a joke by everyone to screw with me. A group joke that everyone was in on except for me. Josh was probably just hiding in the car, laughing his ass off. I felt like such an idiot for believing that that another kid had experienced what I had when he was really just flat out mocking me in front of everyone! I buried my face in my hands. Part of me was angry, but I was mostly relieved. It certainly made more sense to think that it was all just a joke on me. I was actually impressed that they’d got the adults in on it too.But, overall, I was still pretty pissed and I decided that the next time I saw the kid who mocked me; I would punch him straight in the face! How dare he mess with me by making up someone! Sarah Duffy, yeah right!My mind froze . . . Duffy? He had never said a last name. Where did I get that from? And why did it sound so familiar?! What startled me was that I even had a face to put with the name! My mind suddenly exploded with pictures and memories.Sarah! She was my best god damn friend! How the hell did I forget about her?! I was clutching my head and gasping for air as everyone in the car looked at me and began yelling for me to calm the hell down. I couldn’t calm down though, my mind felt like it was being smashed with a sledge hammer and the more my memory cleared, the worse it got. Pain, the likes of which I had never experienced before, racked my body as I curled into a ball shivering and straining to maintain consciousness. The memories continued rushing back into my head, threatening to split my mind in two until, suddenly, it was over.I sat up, and, bleary eyed, looked around me. Everyone stared right back at me, terrified.“Guys, Sarah! Sarah Duffy! Please, dear God, tell me you remember her!” I practically screamed.Their faces once again switched to anger.“God damnit John!” One of the adult chaperons yelled, “We thought you were having a seizer or something! If you pull one more stunt like that for the sake of a joke, we’ll send you straight home! Are you okay? What the hell was that?”I began tearing up, “You guys don’t know Sarah? She- . . . she was my friend! She was YOUR friend for Christ’s sake!” I began searching for a specific memory. “Kevin, you made fun of her goofy hair right when we got off of the plane in Anchorage!” I cried, “Please, for the love of god, tell me you remember that!”No one said a thing. They all just stared at me with judgmental expressions.“That joke has run its course.” Kevin said coldly.Not a one of them showed any signs of recognition, but I knew she was real! Or had been anyway. What the hell had happened to her? I strained and tried to remember the last time I had seen her, but any recent memories were still illusive and blurry.No matter how hard I tried, all thinking about it did was bring back the headaches and pain. Finally, I was forced to stop or everyone would begin to seriously worry about me again.I just sat in the car for the next several hours of the drive and stared out the window at the bleak, grey surroundings, as rain ran down the glass. It had been raining since we arrived in Alaska, and it showed no signs of letting up for the next couple of days at least.Finally, we arrived at the entrance to the trail that would take us to the cabin the other group had stayed at. We unloaded our packs, strapped them on, and set out on our 7 mile hike to where the secluded lakeside cabin lay. It was about 2:00 in the morning, but since it never really got dark out, our plan was to hike in immediately and get there by 5:00 so as to have a full day ahead of us.That being said however, the constant rain and low-set clouds made for poor visibility and the hike in was a struggle to say the least. Through the thick fog, it was near impossible to even make out a tree branch before it struck you in the face, seemingly out of nowhere. Being mindful of possible grizzly bears, we took care to keep our group loud so as to scare them off. About an hour in, we were all singing “Journey” at the top of our lungs when I suddenly fell to my knees, and then collapsed to the muddy ground, clutching my head. I had once again been trying to remember when I had last seen Sarah when it all came flooding back in a horrific wave of grotesque images and unimaginable terrors.There we were, at the Denali campground. The torrential rain pelted down and the sky was so dark that for the first time since we had been there, it actually seemed like night. Everyone was settling down under the tarp around the campfire, and many people were already asleep in their tents. That’s when Jenna asked if anyone had seen Sarah as she still hadn’t washed her dishes.“I’m pretty sure she went to bed already,” I said, “I don’t want to be creepy, but I’ll go check to be sure.”I reluctantly walked away from the warmth of the fire and into the oppressive darkness and driving cold rain. As I approached her tent, I could tell that she wasn’t inside as it was unzipped with the door lying wide open. I immediately ran to close it.What an idiot! I thought to myself, the tent is completely soaked inside now!That’s when I heard her muffled, agonizing scream. It came from somewhere in the woods surrounding the campground and I, without thinking, immediately ran off into the forest after her. After shoving my way through thick spruce and willows, I reached a clearing where I could barely see Sarah’s body on the ground as some . . . thing, which was mostly obscured by trees and underbrush, was ripping her open. She was screaming with all of her might but the thing’s bony hooked hand was covering her mouth. Its long fingers curled almost all the way around her head. The sound of her death was horrendous as bones snapped and skin was peeled away. I wanted to help, but couldn’t bring myself to move.Sarah was long dead by the time I realized that the creature, was beginning to . . . wear her. It had hallowed her out and was now sewing her lifeless corpse onto itself. I was still paralyzed with fear when it suddenly turned towards me.Sarah’s grotesque, shredded carcass was now horribly reanimated, and it began crawling towards me like some kind of broken marionette as her dead eyes looked straight ahead, yet saw nothing.I finally broke out of my trance and began frantically sprinting back towards camp. Sarah’s corpse could’ve easily caught me crawling, but the thick underbrush forced it to stand up awkwardly and begin a demented walk in which everything moved all wrong. This fortunately gave me enough time to reach the safety of the campfire, although, when I arrived, I had no idea what I had been running from . . . or really any of what I had just done.No one asked me if Sarah had really been asleep, because none of us knew a “Sarah.”And that thing, pretending to be her, cringing at the light of the fire, slowly slunk back into the dark of the forest.I bolted upright to people yelling, cursing, and struggling to their feet. I had been near the front if the group, so when I feel to ground, many people behind me tripped over my body and then tripped the people behind them.\u003cspan\u003e“Oh God! I’m sorry you guys!” I cried, “The uh, the ground is really slick here!”\u003cbr\u003eGrumbles were heard and several insults flew my way but we all eventually got up and continued moving. My mind was racing. The fact that I could remember Sarah when no one else could must have had something to with seeing the creature before it stole her skin.\u003cbr\u003eFor me, it must have just been the initial shock that caused the lapse in memory. It was for this same reason that I could remember Josh while the other kid didn’t.\u003c/span\u003eMy blood froze. He didn’t remember Josh because his memory had blocked the horror from him . . . because he had seen Josh being taken in the exact same area in which we were now hiking! And our bear calls were bringing it right to us!Breathing heavy, I slowly turned my head around to look behind me.Sure enough, following from quite a distance, and just barely visible in the bleak grey fog, I could see the silhouette of some sort of fucked-up human impersonation; grotesquely stumbling along just behind our group . . . wearing the decaying face of Josh. Its limbs swayed and bent in directions impossible for a human to imitate, and there were seams where the skin split away and was held together with nothing but a few fleshy strands. When the creature saw me looking, it darted away off the path, but I could tell that it was still following us. It was waiting for something.I doubted it would attack us with such a large group and I was sure that no one would believe me, and so I was forced to simply continue hiking.Finally, we reached the cabin and everyone tried to get some last minute sleep before we started our day. Everyone but me. I KNEW that thing was sulking around in the darkness of the woods surrounding the cabin, waiting for one of us to go out alone.Morning came and everyone quickly prepared for our hike of the day. We would be hiking up a mountain which required some intense bush-whacking just to reach the base thus realistically making the trip at least 4 hours both ways. We packed our lunches, consisting of nothing but protein bars and water, and zipped up our raingear as the weather was still nothing short of a downpour. The sky remained a depressing grey and light thunder could be heard rumbling in the distance.That’s when someone said what I had been dreading. The worst case scenario.Ashley stepped forward and apologetically said, “Sorry everyone, but I feel . . . just terrible, I think I’ll stay behind on this one, you guys go on ahead, I’ll stay here at the cabin.”“No!” I cried, “You have to come with us! We have to stay together!” Everyone turned and looked at me.“Jesus John, if she’s not feeling well, let her stay.” Pam scorned.“Ah,” I stammered, “That’s not it! I just . . . Uh, fine! I’ll stay too!”“You don’t have to do that John.” Ashley said, “I’ll be fine here alone.”“No you won’t!” I wanted to scream, but I had to calm my nerves. “Naw, I didn’t wanna go on this dumb hike anyway.” I laughed, “You guys have fun though!”Everyone looked at me weirdly, and then glanced at each other, before shrugging and heading off into the woods. I wasn’t sure if we would be any safer with just the two of us, but what else could I have done? We would just have to buckle down inside the cabin and hope for the best. As soon as the others disappeared out of sight I turned to Ashley and said, “Alright, we need to get inside the cabin now.”“I appreciate you staying with me and all . . . but you’re kinda freakin me out.” She said.“Haha, sorry,” I awkwardly laughed, “It’s pretty damn wet out here though, we should really inside?”“Yeah, that’s a good plan,” She stated slowly, “I better lay down for a bit.”That’s when I saw him, or . . . It . . . standing twenty or so feet behind Ashley. Josh’s decaying corpse; horribly stretched and disfigured in order to cover whatever thing was wearing it. Ashley saw me looking and turned around to let out a strangled squeak. “Wha . . . What the fuck is that?!” She screamed. I said nothing and simply grabbed her arm, taking off running to the cabin, slamming the door behind us. The thing didn’t run after us, rather, it began slowly walking towards the cabin. It knew we had nowhere to go. I locked the door and scrambled to barricade it with anything I could find.Now there was nothing to do but watch its demented impression of a person as it crawled ever so slowly towards the door. Its hands dragged along to muddy ground and its fleshy skin hide swayed ever so softly as it staggered.“What the hell is that?” Ashley kept repeating over and over between her ragged breaths.“I don’t know,” I stammered, “I just don’t know.”“What does it want?!” She screamed as it reached the door and tried the handle.“I assume, it wants a new . . . Coat.” I said through clenched teeth.She drew a breath and fell to the ground before looking up at me, horrified. The thing moved away from the door and now stood a few inches behind one of the windows, staring in at us. Its cold gaze could be felt from behind the dead eyes of Josh’s face and we could hear skin widening as it smiled. It was messing with us.Ashley broke down and began weeping, “Leave us alone!” She cried, “Get the hell away!”The thing did nothing and simply stood there motionless. Then, it slowly lifted up one of its hands and began lightly rapping on the window.Knock, knock, knock. A slow steady rhythm.It had no intention of breaking the window or anything. It just wanted to let us know that it was there.Not that we needed the reminder. I couldn’t take my eyes off it. This continued for several hours as the sunlight slowly faded and the rain and wind picked up. Soon the sound of it knocking was almost drowned out and I was having to strain to see it in the dim light. Heavy sheets of water whipped around and obscured its form. At one point I let my eyes wander for too long, and when I looked back, it was gone. The knocking had stopped. I bolted upright just in time to barely catch a glimpse of it disappearing around the side of the cabin.“This is bad.” I said, “I think it’s tired of waiting.”Ashley let out a squeal and buried her face in her hands. I wasn’t sure if it could get in from somewhere else but it clearly knew something we didn’t.“It’s ok,” I said, thinking fast, trying to pep talk myself more than anything, “all we need to do is wait for the others to get back! They should be here any minute now!”“Who?” Ashley asked.“The rest of our group!” I said, “Kevin, Lauren, Pam? Those guys! Remember?”“I- . . . I Don’t know who you’re talking about.” She stated, looking at me puzzled, “It’s always been just the two of us.”My heart practically stopped, and as I sunk to the ground in despair, I began to hear knocks . . . all around the cabin.\u003cbr\u003eHope you love my story \u0026lt;3\u0026nbsp;\u003cbr\u003e\u0026nbsp;Credit To –\u0026nbsp;liam vickers you happy now\u0026nbsp;FrozenSolstice","body_tagged":"Two years ago, a bunch of my friends and I went on a school sponsored trip to Alaska set up by the Pursuit Institute. I was placed in a group with nine, no, ten other students, and two adult chaperones. Another group was also made up of similar numbers, and each group would start at one location and then we would switch places halfway through. The trip would consist mostly of hiking and backpacking in Denali where we would camp in tents and then hiking near the Kenai Peninsula where we would stay in a cabin.We arrived in Anchorage at about 2:00 in the morning, but it was still light out as Alaska never really got dark that time of year. Our groups parted ways after claiming our baggage, and my group began our trip by driving to Denali National Park where we would be spending the next several days. We all had a great time and before we knew it, it was time to meet up with the other group and trade places for the second half of our trip.We converged in front of a supermarket and the two groups swapped stories and shared some laughs. It was all fun, but I couldn’t shake the feeling that something was . . . wrong with the other group. Their stories would be incredibly vague or they would just stop halfway through as if they caught themselves from mentioning something without even realizing it.It was all incredibly eerie but no one but me seemed to notice. When I tried to question them further or go into detail about their trip they would simply become dazed and say that it was really all just a blur. Then, getting defensive, they would ask me details about our trip so far. I scoffed and tried to remember a specific event only to find that . . . I really didn’t remember much either. In fact, as I began listening to my groups own stories, we were being just as vague as them! It was all so strange that no one, not even I, immediately noticed that the other group was short one kid.Suddenly though, it hit me.“Where’s Josh?” I asked the group. Everyone turned to face me, their eyes seemed glazed and cloudy as their faces reflected my own confusion right back at me. What they said next made my blood run cold.With such genuine seriousness that it couldn’t have possibly been a joke, one by one, they asked, “Who the hell is Josh?” Even the adults looked puzzled.Giving a nervous laugh, I turned to my own group for support only to see that they were looking at me with the same expressions. Confusion was plastered across every one of their faces, looking at me with blank eyes. Then, suddenly, confusion turned to laughter as if they realized that I had been joking.“Haha! Nice man! You had me goin’ for a second there!” Matt said as the mood quickly lightened back up. I laughed with them and pretended that it had been a joke, but all I felt was a horrible sickness rising up inside me.That’s when a kid from the other group said, “Haha, but seriously, what’s with YOUR group? You guys are acting all weird and . . . where is Sarah?”“Haha, very funny.”“Yeah real original.” Members of both groups snapped back at him, almost in unison. No one named Sarah had even been in our group, and even I was pissed that he was making fun of me. That is, until I saw the look on his face.When no one took him seriously, his appearance was bleached to a deathly pale tone and his eyes widened, shifting from side to side nervously. Then he looked at me. Our eyes met and we both knew that something was horribly wrong. Although we couldn’t really be sure that the other was telling the truth, we both seemingly knew someone who was now forgotten. We simply stood there for what felt like forever, staring at each other.He looked horrified, I’m sure I did too. Before I got a chance to talk to him however, we were shoved into our separate cars and were on our way to our new destinations, their group to Denali, ours to the Cabin. I doubted talking to him would’ve done any good anyway though. What could either of us have said? He didn’t remember Josh and I sure as hell didn’t know anyone named Sarah.The more I thought about it, the more I began to convince myself that it must have been a joke by everyone to screw with me. A group joke that everyone was in on except for me. Josh was probably just hiding in the car, laughing his ass off. I felt like such an idiot for believing that that another kid had experienced what I had when he was really just flat out mocking me in front of everyone! I buried my face in my hands. Part of me was angry, but I was mostly relieved. It certainly made more sense to think that it was all just a joke on me. I was actually impressed that they’d got the adults in on it too.But, overall, I was still pretty pissed and I decided that the next time I saw the kid who mocked me; I would punch him straight in the face! How dare he mess with me by making up someone! Sarah Duffy, yeah right!My mind froze . . . Duffy? He had never said a last name. Where did I get that from? And why did it sound so familiar?! What startled me was that I even had a face to put with the name! My mind suddenly exploded with pictures and memories.Sarah! She was my best god damn friend! How the hell did I forget about her?! I was clutching my head and gasping for air as everyone in the car looked at me and began yelling for me to calm the hell down. I couldn’t calm down though, my mind felt like it was being smashed with a sledge hammer and the more my memory cleared, the worse it got. Pain, the likes of which I had never experienced before, racked my body as I curled into a ball shivering and straining to maintain consciousness. The memories continued rushing back into my head, threatening to split my mind in two until, suddenly, it was over.I sat up, and, bleary eyed, looked around me. Everyone stared right back at me, terrified.“Guys, Sarah! Sarah Duffy! Please, dear God, tell me you remember her!” I practically screamed.Their faces once again switched to anger.“God damnit John!” One of the adult chaperons yelled, “We thought you were having a seizer or something! If you pull one more stunt like that for the sake of a joke, we’ll send you straight home! Are you okay? What the hell was that?”I began tearing up, “You guys don’t know Sarah? She- . . . she was my friend! She was YOUR friend for Christ’s sake!” I began searching for a specific memory. “Kevin, you made fun of her goofy hair right when we got off of the plane in Anchorage!” I cried, “Please, for the love of god, tell me you remember that!”No one said a thing. They all just stared at me with judgmental expressions.“That joke has run its course.” Kevin said coldly.Not a one of them showed any signs of recognition, but I knew she was real! Or had been anyway. What the hell had happened to her? I strained and tried to remember the last time I had seen her, but any recent memories were still illusive and blurry.No matter how hard I tried, all thinking about it did was bring back the headaches and pain. Finally, I was forced to stop or everyone would begin to seriously worry about me again.I just sat in the car for the next several hours of the drive and stared out the window at the bleak, grey surroundings, as rain ran down the glass. It had been raining since we arrived in Alaska, and it showed no signs of letting up for the next couple of days at least.Finally, we arrived at the entrance to the trail that would take us to the cabin the other group had stayed at. We unloaded our packs, strapped them on, and set out on our 7 mile hike to where the secluded lakeside cabin lay. It was about 2:00 in the morning, but since it never really got dark out, our plan was to hike in immediately and get there by 5:00 so as to have a full day ahead of us.That being said however, the constant rain and low-set clouds made for poor visibility and the hike in was a struggle to say the least. Through the thick fog, it was near impossible to even make out a tree branch before it struck you in the face, seemingly out of nowhere. Being mindful of possible grizzly bears, we took care to keep our group loud so as to scare them off. About an hour in, we were all singing “Journey” at the top of our lungs when I suddenly fell to my knees, and then collapsed to the muddy ground, clutching my head. I had once again been trying to remember when I had last seen Sarah when it all came flooding back in a horrific wave of grotesque images and unimaginable terrors.There we were, at the Denali campground. The torrential rain pelted down and the sky was so dark that for the first time since we had been there, it actually seemed like night. Everyone was settling down under the tarp around the campfire, and many people were already asleep in their tents. That’s when Jenna asked if anyone had seen Sarah as she still hadn’t washed her dishes.“I’m pretty sure she went to bed already,” I said, “I don’t want to be creepy, but I’ll go check to be sure.”I reluctantly walked away from the warmth of the fire and into the oppressive darkness and driving cold rain. As I approached her tent, I could tell that she wasn’t inside as it was unzipped with the door lying wide open. I immediately ran to close it.What an idiot! I thought to myself, the tent is completely soaked inside now!That’s when I heard her muffled, agonizing scream. It came from somewhere in the woods surrounding the campground and I, without thinking, immediately ran off into the forest after her. After shoving my way through thick spruce and willows, I reached a clearing where I could barely see Sarah’s body on the ground as some . . . thing, which was mostly obscured by trees and underbrush, was ripping her open. She was screaming with all of her might but the thing’s bony hooked hand was covering her mouth. Its long fingers curled almost all the way around her head. The sound of her death was horrendous as bones snapped and skin was peeled away. I wanted to help, but couldn’t bring myself to move.Sarah was long dead by the time I realized that the creature, was beginning to . . . wear her. It had hallowed her out and was now sewing her lifeless corpse onto itself. I was still paralyzed with fear when it suddenly turned towards me.Sarah’s grotesque, shredded carcass was now horribly reanimated, and it began crawling towards me like some kind of broken marionette as her dead eyes looked straight ahead, yet saw nothing.I finally broke out of my trance and began frantically sprinting back towards camp. Sarah’s corpse could’ve easily caught me crawling, but the thick underbrush forced it to stand up awkwardly and begin a demented walk in which everything moved all wrong. This fortunately gave me enough time to reach the safety of the campfire, although, when I arrived, I had no idea what I had been running from . . . or really any of what I had just done.No one asked me if Sarah had really been asleep, because none of us knew a “Sarah.”And that thing, pretending to be her, cringing at the light of the fire, slowly slunk back into the dark of the forest.I bolted upright to people yelling, cursing, and struggling to their feet. I had been near the front if the group, so when I feel to ground, many people behind me tripped over my body and then tripped the people behind them.\u003cspan\u003e“Oh God! I’m sorry you guys!” I cried, “The uh, the ground is really slick here!”\u003cbr\u003eGrumbles were heard and several insults flew my way but we all eventually got up and continued moving. My mind was racing. The fact that I could remember Sarah when no one else could must have had something to with seeing the creature before it stole her skin.\u003cbr\u003eFor me, it must have just been the initial shock that caused the lapse in memory. It was for this same reason that I could remember Josh while the other kid didn’t.\u003c/span\u003eMy blood froze. He didn’t remember Josh because his memory had blocked the horror from him . . . because he had seen Josh being taken in the exact same area in which we were now hiking! And our bear calls were bringing it right to us!Breathing heavy, I slowly turned my head around to look behind me.Sure enough, following from quite a distance, and just barely visible in the bleak grey fog, I could see the silhouette of some sort of fucked-up human impersonation; grotesquely stumbling along just behind our group . . . wearing the decaying face of Josh. Its limbs swayed and bent in directions impossible for a human to imitate, and there were seams where the skin split away and was held together with nothing but a few fleshy strands. When the creature saw me looking, it darted away off the path, but I could tell that it was still following us. It was waiting for something.I doubted it would attack us with such a large group and I was sure that no one would believe me, and so I was forced to simply continue hiking.Finally, we reached the cabin and everyone tried to get some last minute sleep before we started our day. Everyone but me. I KNEW that thing was sulking around in the darkness of the woods surrounding the cabin, waiting for one of us to go out alone.Morning came and everyone quickly prepared for our hike of the day. We would be hiking up a mountain which required some intense bush-whacking just to reach the base thus realistically making the trip at least 4 hours both ways. We packed our lunches, consisting of nothing but protein bars and water, and zipped up our raingear as the weather was still nothing short of a downpour. The sky remained a depressing grey and light thunder could be heard rumbling in the distance.That’s when someone said what I had been dreading. The worst case scenario.Ashley stepped forward and apologetically said, “Sorry everyone, but I feel . . . just terrible, I think I’ll stay behind on this one, you guys go on ahead, I’ll stay here at the cabin.”“No!” I cried, “You have to come with us! We have to stay together!” Everyone turned and looked at me.“Jesus John, if she’s not feeling well, let her stay.” Pam scorned.“Ah,” I stammered, “That’s not it! I just . . . Uh, fine! I’ll stay too!”“You don’t have to do that John.” Ashley said, “I’ll be fine here alone.”“No you won’t!” I wanted to scream, but I had to calm my nerves. “Naw, I didn’t wanna go on this dumb hike anyway.” I laughed, “You guys have fun though!”Everyone looked at me weirdly, and then glanced at each other, before shrugging and heading off into the woods. I wasn’t sure if we would be any safer with just the two of us, but what else could I have done? We would just have to buckle down inside the cabin and hope for the best. As soon as the others disappeared out of sight I turned to Ashley and said, “Alright, we need to get inside the cabin now.”“I appreciate you staying with me and all . . . but you’re kinda freakin me out.” She said.“Haha, sorry,” I awkwardly laughed, “It’s pretty damn wet out here though, we should really inside?”“Yeah, that’s a good plan,” She stated slowly, “I better lay down for a bit.”That’s when I saw him, or . . . It . . . standing twenty or so feet behind Ashley. Josh’s decaying corpse; horribly stretched and disfigured in order to cover whatever thing was wearing it. Ashley saw me looking and turned around to let out a strangled squeak. “Wha . . . What the fuck is that?!” She screamed. I said nothing and simply grabbed her arm, taking off running to the cabin, slamming the door behind us. The thing didn’t run after us, rather, it began slowly walking towards the cabin. It knew we had nowhere to go. I locked the door and scrambled to barricade it with anything I could find.Now there was nothing to do but watch its demented impression of a person as it crawled ever so slowly towards the door. Its hands dragged along to muddy ground and its fleshy skin hide swayed ever so softly as it staggered.“What the hell is that?” Ashley kept repeating over and over between her ragged breaths.“I don’t know,” I stammered, “I just don’t know.”“What does it want?!” She screamed as it reached the door and tried the handle.“I assume, it wants a new . . . Coat.” I said through clenched teeth.She drew a breath and fell to the ground before looking up at me, horrified. The thing moved away from the door and now stood a few inches behind one of the windows, staring in at us. Its cold gaze could be felt from behind the dead eyes of Josh’s face and we could hear skin widening as it smiled. It was messing with us.Ashley broke down and began weeping, “Leave us alone!” She cried, “Get the hell away!”The thing did nothing and simply stood there motionless. Then, it slowly lifted up one of its hands and began lightly rapping on the window.Knock, knock, knock. A slow steady rhythm.It had no intention of breaking the window or anything. It just wanted to let us know that it was there.Not that we needed the reminder. I couldn’t take my eyes off it. This continued for several hours as the sunlight slowly faded and the rain and wind picked up. Soon the sound of it knocking was almost drowned out and I was having to strain to see it in the dim light. Heavy sheets of water whipped around and obscured its form. At one point I let my eyes wander for too long, and when I looked back, it was gone. The knocking had stopped. I bolted upright just in time to barely catch a glimpse of it disappearing around the side of the cabin.“This is bad.” I said, “I think it’s tired of waiting.”Ashley let out a squeal and buried her face in her hands. I wasn’t sure if it could get in from somewhere else but it clearly knew something we didn’t.“It’s ok,” I said, thinking fast, trying to pep talk myself more than anything, “all we need to do is wait for the others to get back! They should be here any minute now!”“Who?” Ashley asked.“The rest of our group!” I said, “Kevin, Lauren, Pam? Those guys! Remember?”“I- . . . I Don’t know who you’re talking about.” She stated, looking at me puzzled, “It’s always been just the two of us.”My heart practically stopped, and as I sunk to the ground in despair, I began to hear knocks . . . all around the cabin.\u003cbr\u003eHope you love my story \u0026lt;3\u0026nbsp;\u003cbr\u003e\u0026nbsp;Credit To –\u0026nbsp;liam vickers you happy now\u0026nbsp;FrozenSolstice","created_at":"2015/02/15 10:20:04 +0000","created_at_human":"February 15, 2015 at 10:02 AM UTC"}},{"id":153254,"unique_id":"153254-962","author":{"id":443064,"username":"Blacksmiths","avatar":"https://crafatar.com/avatars/6c3685b6fb5043e0af3c93b51c28364f?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"CHANGE MY MIND! KILL HIM","body_tagged":"CHANGE MY MIND! KILL HIM","created_at":"2015/02/15 10:30:48 +0000","created_at_human":"February 15, 2015 at 10:02 AM UTC"},{"id":153263,"unique_id":"153263-401","author":{"id":292963,"username":"FrozenSolstice","avatar":"https://crafatar.com/avatars/8bacbc710bf84a1fa8fa71453487cd89?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"It's alright now, he's credited the author :)","body_tagged":"It's alright now, he's credited the author :)","created_at":"2015/02/15 10:44:00 +0000","created_at_human":"February 15, 2015 at 10:02 AM UTC","reply_to":{"id":153251,"unique_id":"153251-1596","author":{"id":441993,"username":"Aphelion","avatar":"https://crafatar.com/avatars/a134e3bb0631417784bf4f64751eb1b0?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Hahahaha, you know scamming is not allowed :)\u003cbr\u003e\u003cbr\u003e\u003ca href=\"http://www.creepypasta.com/pursuit-institute/\" rel=\"nofollow\" target=\"_blank\"\u003ehttp://www.creepypasta.com/pursuit-institute/\u003c/a\u003e","body_tagged":"Hahahaha, you know scamming is not allowed :)\u003cbr\u003e\u003cbr\u003e\u003ca href=\"http://www.creepypasta.com/pursuit-institute/\" rel=\"nofollow\" target=\"_blank\"\u003ehttp://www.creepypasta.com/pursuit-institute/\u003c/a\u003e","created_at":"2015/02/15 10:29:28 +0000","created_at_human":"February 15, 2015 at 10:02 AM UTC"}},{"id":153324,"unique_id":"153324-139","author":{"id":70509,"username":"Tarheelkiwi","avatar":"https://www.gravatar.com/avatar/200fddcac10d814c548e2864041d5d42?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"I will make one up:\u003cbr\u003e\u003cbr\u003eOnce upon a time, there was a little kiwi who wanted to learn how to fly.\u0026nbsp; So he went to flight school where he was taught the basics of flight.\u0026nbsp; He practiced so hard, he went to bed exhausted.\u0026nbsp; One day, he decided to test this flight skills by climbing a mountain and jumping off.\u0026nbsp; He was able to glide, but when he tried to gain altitude, he ended up going into a nose dive and smacked onto the hard ground below.\u0026nbsp; It was safe to say, he didn't make it.\u0026nbsp; The doctors tired everything, but we unsuccessful.\u0026nbsp; His family decided to bury him at the sight where he jumped.\u0026nbsp; Legend has it that during the night, his spirit awakens and he continues to learn how to fly.\u0026nbsp; He also will haunts anyone who can fly or attempts and is successful.\u0026nbsp; \u003cbr\u003e\u003cbr\u003e-Tarheelkiwi","body_tagged":"I will make one up:\u003cbr\u003e\u003cbr\u003eOnce upon a time, there was a little kiwi who wanted to learn how to fly.\u0026nbsp; So he went to flight school where he was taught the basics of flight.\u0026nbsp; He practiced so hard, he went to bed exhausted.\u0026nbsp; One day, he decided to test this flight skills by climbing a mountain and jumping off.\u0026nbsp; He was able to glide, but when he tried to gain altitude, he ended up going into a nose dive and smacked onto the hard ground below.\u0026nbsp; It was safe to say, he didn't make it.\u0026nbsp; The doctors tired everything, but we unsuccessful.\u0026nbsp; His family decided to bury him at the sight where he jumped.\u0026nbsp; Legend has it that during the night, his spirit awakens and he continues to learn how to fly.\u0026nbsp; He also will haunts anyone who can fly or attempts and is successful.\u0026nbsp; \u003cbr\u003e\u003cbr\u003e-Tarheelkiwi","created_at":"2015/02/15 15:16:38 +0000","created_at_human":"February 15, 2015 at  3:02 PM UTC"},{"id":153331,"unique_id":"153331-4612","author":{"id":163667,"username":"goldenwalrus909","avatar":"https://www.gravatar.com/avatar/d27d79b3a7444e15bc68cf75e9ebcb97?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"i cri evrytim\u003cbr\u003everee bootiful","body_tagged":"i cri evrytim\u003cbr\u003everee bootiful","created_at":"2015/02/15 15:31:12 +0000","created_at_human":"February 15, 2015 at  3:02 PM UTC","reply_to":{"id":153324,"unique_id":"153324-4316","author":{"id":70509,"username":"Tarheelkiwi","avatar":"https://www.gravatar.com/avatar/200fddcac10d814c548e2864041d5d42?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"I will make one up:\u003cbr\u003e\u003cbr\u003eOnce upon a time, there was a little kiwi who wanted to learn how to fly.\u0026nbsp; So he went to flight school where he was taught the basics of flight.\u0026nbsp; He practiced so hard, he went to bed exhausted.\u0026nbsp; One day, he decided to test this flight skills by climbing a mountain and jumping off.\u0026nbsp; He was able to glide, but when he tried to gain altitude, he ended up going into a nose dive and smacked onto the hard ground below.\u0026nbsp; It was safe to say, he didn't make it.\u0026nbsp; The doctors tired everything, but we unsuccessful.\u0026nbsp; His family decided to bury him at the sight where he jumped.\u0026nbsp; Legend has it that during the night, his spirit awakens and he continues to learn how to fly.\u0026nbsp; He also will haunts anyone who can fly or attempts and is successful.\u0026nbsp; \u003cbr\u003e\u003cbr\u003e-Tarheelkiwi","body_tagged":"I will make one up:\u003cbr\u003e\u003cbr\u003eOnce upon a time, there was a little kiwi who wanted to learn how to fly.\u0026nbsp; So he went to flight school where he was taught the basics of flight.\u0026nbsp; He practiced so hard, he went to bed exhausted.\u0026nbsp; One day, he decided to test this flight skills by climbing a mountain and jumping off.\u0026nbsp; He was able to glide, but when he tried to gain altitude, he ended up going into a nose dive and smacked onto the hard ground below.\u0026nbsp; It was safe to say, he didn't make it.\u0026nbsp; The doctors tired everything, but we unsuccessful.\u0026nbsp; His family decided to bury him at the sight where he jumped.\u0026nbsp; Legend has it that during the night, his spirit awakens and he continues to learn how to fly.\u0026nbsp; He also will haunts anyone who can fly or attempts and is successful.\u0026nbsp; \u003cbr\u003e\u003cbr\u003e-Tarheelkiwi","created_at":"2015/02/15 15:16:38 +0000","created_at_human":"February 15, 2015 at  3:02 PM UTC"}},{"id":153347,"unique_id":"153347-3518","author":{"id":70509,"username":"Tarheelkiwi","avatar":"https://www.gravatar.com/avatar/200fddcac10d814c548e2864041d5d42?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"Now time for a real story.\u0026nbsp; HEHE\u003cbr\u003e\u003ci\u003eNote this is also fictional.\u0026nbsp; Characters in this story are completely made and the story itself should be taken literally!\u003cbr\u003e\u003cbr\u003e\u003c/i\u003eMe and three other friends were going to hang out together.\u0026nbsp; We decided to meet at the local cemetery.\u0026nbsp; We brought snacks and drinks and hung out next to Henry Williams' grave.\u0026nbsp; We didn't know who he was, but we noticed that he died three years ago.\u0026nbsp; We thought it was funny to play around with the grave and said stuff like, \"Oh you don' mind right Mr. Williams\" \"Is it OK that we stay here.\"\u0026nbsp; We were joking around and having a good time.\u0026nbsp; It was 12 p.m. when we decided to head home.\u0026nbsp; Right as we were packing up, my friend, Sara, said to the grave, \"I wish you could come home with me.\"\u0026nbsp; We laughed and joked that Mr. Williams was coming with us.\u0026nbsp; A couple days later, Sara noticed some paranormal activity happening around her house.\u0026nbsp; Some of these events were, objects disappearing, doors shutting by themselves, lights coming on and off, and hearing spooky sounds like footsteps and even whispering.\u0026nbsp; She became very scared but didn't tell anyone.\u0026nbsp; The final straw was 2 a.m.\u0026nbsp; She and her family were sleeping when the t.v. came on.\u0026nbsp; The sound was all the way up and the show was Ghost Busters.\u0026nbsp; She had enough and called your boyfriend, Alex.\u0026nbsp; She told him about the creepy events and the t.v.\u0026nbsp; We all got together at Sara's house and tried something.\u0026nbsp; Since the ghost followed Sara when she wanted him to come home with her, we decided to try to get the ghost to follow her back to the grave.\u0026nbsp; We beckoned him to come.\u0026nbsp; When we arrived at his grave, we told Mr. Williams that he was home.\u0026nbsp; About a week passed and Sara nor any of us experienced any sort of paranormal activity.\u0026nbsp; Some paranormal detectives went to the grave and told us that Mr. Williams' spirit was still active.\u0026nbsp; We were very shocked to hear this.\u0026nbsp; We were just trying to be funny and never thought that the ghost was really going to follow us.\u0026nbsp; We learned our lesson, think before you act.\u003cbr\u003e\u003cbr\u003eWhat did you guys think.\u0026nbsp; Spooky right.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cimg src=\"http://fc04.deviantart.net/fs71/f/2013/295/2/8/jump_by_thedrowwarrior1-d6rf2qo.gif\" alt=\"\" height=\"240\" width=\"550\"\u003e\u003ci\u003e\u003cbr\u003e\u003c/i\u003e","body_tagged":"Now time for a real story.\u0026nbsp; HEHE\u003cbr\u003e\u003ci\u003eNote this is also fictional.\u0026nbsp; Characters in this story are completely made and the story itself should be taken literally!\u003cbr\u003e\u003cbr\u003e\u003c/i\u003eMe and three other friends were going to hang out together.\u0026nbsp; We decided to meet at the local cemetery.\u0026nbsp; We brought snacks and drinks and hung out next to Henry Williams' grave.\u0026nbsp; We didn't know who he was, but we noticed that he died three years ago.\u0026nbsp; We thought it was funny to play around with the grave and said stuff like, \"Oh you don' mind right Mr. Williams\" \"Is it OK that we stay here.\"\u0026nbsp; We were joking around and having a good time.\u0026nbsp; It was 12 p.m. when we decided to head home.\u0026nbsp; Right as we were packing up, my friend, Sara, said to the grave, \"I wish you could come home with me.\"\u0026nbsp; We laughed and joked that Mr. Williams was coming with us.\u0026nbsp; A couple days later, Sara noticed some paranormal activity happening around her house.\u0026nbsp; Some of these events were, objects disappearing, doors shutting by themselves, lights coming on and off, and hearing spooky sounds like footsteps and even whispering.\u0026nbsp; She became very scared but didn't tell anyone.\u0026nbsp; The final straw was 2 a.m.\u0026nbsp; She and her family were sleeping when the t.v. came on.\u0026nbsp; The sound was all the way up and the show was Ghost Busters.\u0026nbsp; She had enough and called your boyfriend, Alex.\u0026nbsp; She told him about the creepy events and the t.v.\u0026nbsp; We all got together at Sara's house and tried something.\u0026nbsp; Since the ghost followed Sara when she wanted him to come home with her, we decided to try to get the ghost to follow her back to the grave.\u0026nbsp; We beckoned him to come.\u0026nbsp; When we arrived at his grave, we told Mr. Williams that he was home.\u0026nbsp; About a week passed and Sara nor any of us experienced any sort of paranormal activity.\u0026nbsp; Some paranormal detectives went to the grave and told us that Mr. Williams' spirit was still active.\u0026nbsp; We were very shocked to hear this.\u0026nbsp; We were just trying to be funny and never thought that the ghost was really going to follow us.\u0026nbsp; We learned our lesson, think before you act.\u003cbr\u003e\u003cbr\u003eWhat did you guys think.\u0026nbsp; Spooky right.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cimg src=\"http://fc04.deviantart.net/fs71/f/2013/295/2/8/jump_by_thedrowwarrior1-d6rf2qo.gif\" alt=\"\" height=\"240\" width=\"550\"\u003e\u003ci\u003e\u003cbr\u003e\u003c/i\u003e","created_at":"2015/02/15 16:26:32 +0000","created_at_human":"February 15, 2015 at  4:02 PM UTC"},{"id":153356,"unique_id":"153356-3885","author":{"id":437157,"username":"Newcleus","avatar":"https://www.gravatar.com/avatar/e0a8ea3a16343b1e99b507e2d342e8bb?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"Peter Venkman, Ray Stantz, and Egon Spengler are three scientists at Columbia University in New York City. When their grant expires, the guys are fired and they go into business as a ghost extermination company called \"Ghostbusters\". Their first customer is orchestra cello player Dana Barrett, who was scared out of her apartment on the 22nd floor of a high rise apartment building on Central Park West. It seems that Dana's neighbor, Louis Tully, is also being affected by the strange happenings in the apartment building. Armed with proton guns, the Ghostbusters become wildly popular, and they are joined by Winston Zeddmore, who is looking for a job with good pay. Overzealous Environmental Protection Agency (EPA) agent Walter Peck thinks the Ghostbusters are frauds, and he has the Ghostbusters put in jail. Peck is forced to believe the Ghostbusters when New York City is put under siege by an ancient Sumerian God named Gozer the Gozerian, who is channeled through the apartment building that Dana and Louis live in, and the mayor has no choice but to let the Ghostbusters out of jail to face Gozer.","body_tagged":"Peter Venkman, Ray Stantz, and Egon Spengler are three scientists at Columbia University in New York City. When their grant expires, the guys are fired and they go into business as a ghost extermination company called \"Ghostbusters\". Their first customer is orchestra cello player Dana Barrett, who was scared out of her apartment on the 22nd floor of a high rise apartment building on Central Park West. It seems that Dana's neighbor, Louis Tully, is also being affected by the strange happenings in the apartment building. Armed with proton guns, the Ghostbusters become wildly popular, and they are joined by Winston Zeddmore, who is looking for a job with good pay. Overzealous Environmental Protection Agency (EPA) agent Walter Peck thinks the Ghostbusters are frauds, and he has the Ghostbusters put in jail. Peck is forced to believe the Ghostbusters when New York City is put under siege by an ancient Sumerian God named Gozer the Gozerian, who is channeled through the apartment building that Dana and Louis live in, and the mayor has no choice but to let the Ghostbusters out of jail to face Gozer.","created_at":"2015/02/15 17:30:19 +0000","created_at_human":"February 15, 2015 at  5:02 PM UTC"},{"id":153363,"unique_id":"153363-3531","author":{"id":29559,"username":"Rainstruck","avatar":"https://crafatar.com/avatars/b7b0e6ee22a3459fa9aafed3ee3d5338?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Tons of spooky scary skeletons!!!!! XD","body_tagged":"Tons of spooky scary skeletons!!!!! XD","created_at":"2015/02/15 17:38:54 +0000","created_at_human":"February 15, 2015 at  5:02 PM UTC"},{"id":153371,"unique_id":"153371-1286","author":{"id":412112,"username":"_Jupiter","avatar":"https://crafatar.com/avatars/666a363d92304924827909c05576d7c0?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"\u003cspan\u003e\u003ca target=\"_blank\" rel=\"nofollow\" href=\"http://comic.naver.com/webtoon/detail.nhn?titleId=350217\u0026amp;no=31\u0026amp;weekday=tue/\"\u003ehttp://comic.naver.com/webtoon/detail.nhn?titleId=350217\u0026amp;no=31\u0026amp;weekday=tue/\u003c/a\u003e\u003cbr\u003eso scary. My korean friend sent it to me :D\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003c/span\u003e","body_tagged":"\u003cspan\u003e\u003ca target=\"_blank\" rel=\"nofollow\" href=\"http://comic.naver.com/webtoon/detail.nhn?titleId=350217\u0026amp;no=31\u0026amp;weekday=tue/\"\u003ehttp://comic.naver.com/webtoon/detail.nhn?titleId=350217\u0026amp;no=31\u0026amp;weekday=tue/\u003c/a\u003e\u003cbr\u003eso scary. My korean friend sent it to me :D\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003c/span\u003e","created_at":"2015/02/15 18:04:02 +0000","created_at_human":"February 15, 2015 at  6:02 PM UTC"},{"id":153390,"unique_id":"153390-2754","author":{"id":263841,"username":"Myv","avatar":"https://crafatar.com/avatars/68cfe240d81c46ae8a939e3eb5d71e3e?helm\u0026size=$SIZE$","color":"#2980b9","staff":true},"body":"woe.","body_tagged":"woe.","created_at":"2015/02/15 18:35:15 +0000","created_at_human":"February 15, 2015 at  6:02 PM UTC","reply_to":{"id":153347,"unique_id":"153347-4394","author":{"id":70509,"username":"Tarheelkiwi","avatar":"https://www.gravatar.com/avatar/200fddcac10d814c548e2864041d5d42?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"Now time for a real story.\u0026nbsp; HEHE\u003cbr\u003e\u003ci\u003eNote this is also fictional.\u0026nbsp; Characters in this story are completely made and the story itself should be taken literally!\u003cbr\u003e\u003cbr\u003e\u003c/i\u003eMe and three other friends were going to hang out together.\u0026nbsp; We decided to meet at the local cemetery.\u0026nbsp; We brought snacks and drinks and hung out next to Henry Williams' grave.\u0026nbsp; We didn't know who he was, but we noticed that he died three years ago.\u0026nbsp; We thought it was funny to play around with the grave and said stuff like, \"Oh you don' mind right Mr. Williams\" \"Is it OK that we stay here.\"\u0026nbsp; We were joking around and having a good time.\u0026nbsp; It was 12 p.m. when we decided to head home.\u0026nbsp; Right as we were packing up, my friend, Sara, said to the grave, \"I wish you could come home with me.\"\u0026nbsp; We laughed and joked that Mr. Williams was coming with us.\u0026nbsp; A couple days later, Sara noticed some paranormal activity happening around her house.\u0026nbsp; Some of these events were, objects disappearing, doors shutting by themselves, lights coming on and off, and hearing spooky sounds like footsteps and even whispering.\u0026nbsp; She became very scared but didn't tell anyone.\u0026nbsp; The final straw was 2 a.m.\u0026nbsp; She and her family were sleeping when the t.v. came on.\u0026nbsp; The sound was all the way up and the show was Ghost Busters.\u0026nbsp; She had enough and called your boyfriend, Alex.\u0026nbsp; She told him about the creepy events and the t.v.\u0026nbsp; We all got together at Sara's house and tried something.\u0026nbsp; Since the ghost followed Sara when she wanted him to come home with her, we decided to try to get the ghost to follow her back to the grave.\u0026nbsp; We beckoned him to come.\u0026nbsp; When we arrived at his grave, we told Mr. Williams that he was home.\u0026nbsp; About a week passed and Sara nor any of us experienced any sort of paranormal activity.\u0026nbsp; Some paranormal detectives went to the grave and told us that Mr. Williams' spirit was still active.\u0026nbsp; We were very shocked to hear this.\u0026nbsp; We were just trying to be funny and never thought that the ghost was really going to follow us.\u0026nbsp; We learned our lesson, think before you act.\u003cbr\u003e\u003cbr\u003eWhat did you guys think.\u0026nbsp; Spooky right.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cimg src=\"http://fc04.deviantart.net/fs71/f/2013/295/2/8/jump_by_thedrowwarrior1-d6rf2qo.gif\" alt=\"\" height=\"240\" width=\"550\"\u003e\u003ci\u003e\u003cbr\u003e\u003c/i\u003e","body_tagged":"Now time for a real story.\u0026nbsp; HEHE\u003cbr\u003e\u003ci\u003eNote this is also fictional.\u0026nbsp; Characters in this story are completely made and the story itself should be taken literally!\u003cbr\u003e\u003cbr\u003e\u003c/i\u003eMe and three other friends were going to hang out together.\u0026nbsp; We decided to meet at the local cemetery.\u0026nbsp; We brought snacks and drinks and hung out next to Henry Williams' grave.\u0026nbsp; We didn't know who he was, but we noticed that he died three years ago.\u0026nbsp; We thought it was funny to play around with the grave and said stuff like, \"Oh you don' mind right Mr. Williams\" \"Is it OK that we stay here.\"\u0026nbsp; We were joking around and having a good time.\u0026nbsp; It was 12 p.m. when we decided to head home.\u0026nbsp; Right as we were packing up, my friend, Sara, said to the grave, \"I wish you could come home with me.\"\u0026nbsp; We laughed and joked that Mr. Williams was coming with us.\u0026nbsp; A couple days later, Sara noticed some paranormal activity happening around her house.\u0026nbsp; Some of these events were, objects disappearing, doors shutting by themselves, lights coming on and off, and hearing spooky sounds like footsteps and even whispering.\u0026nbsp; She became very scared but didn't tell anyone.\u0026nbsp; The final straw was 2 a.m.\u0026nbsp; She and her family were sleeping when the t.v. came on.\u0026nbsp; The sound was all the way up and the show was Ghost Busters.\u0026nbsp; She had enough and called your boyfriend, Alex.\u0026nbsp; She told him about the creepy events and the t.v.\u0026nbsp; We all got together at Sara's house and tried something.\u0026nbsp; Since the ghost followed Sara when she wanted him to come home with her, we decided to try to get the ghost to follow her back to the grave.\u0026nbsp; We beckoned him to come.\u0026nbsp; When we arrived at his grave, we told Mr. Williams that he was home.\u0026nbsp; About a week passed and Sara nor any of us experienced any sort of paranormal activity.\u0026nbsp; Some paranormal detectives went to the grave and told us that Mr. Williams' spirit was still active.\u0026nbsp; We were very shocked to hear this.\u0026nbsp; We were just trying to be funny and never thought that the ghost was really going to follow us.\u0026nbsp; We learned our lesson, think before you act.\u003cbr\u003e\u003cbr\u003eWhat did you guys think.\u0026nbsp; Spooky right.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003cimg src=\"http://fc04.deviantart.net/fs71/f/2013/295/2/8/jump_by_thedrowwarrior1-d6rf2qo.gif\" alt=\"\" height=\"240\" width=\"550\"\u003e\u003ci\u003e\u003cbr\u003e\u003c/i\u003e","created_at":"2015/02/15 16:26:32 +0000","created_at_human":"February 15, 2015 at  4:02 PM UTC"}},{"id":153392,"unique_id":"153392-2799","author":{"id":296441,"username":"StewieFG","avatar":"https://crafatar.com/avatars/3b4ae06a9c854f7abe666fcf82e049ea?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Somewhy it made the sound effect for me too\u003cbr\u003eI just like broke my keyboard, chair, table, etc, as I wasn't expecting a sound effect and my sound was on 70% since I watched a YouTube video before, I'm Rest In PeachyYas.","body_tagged":"Somewhy it made the sound effect for me too\u003cbr\u003eI just like broke my keyboard, chair, table, etc, as I wasn't expecting a sound effect and my sound was on 70% since I watched a YouTube video before, I'm Rest In PeachyYas.","created_at":"2015/02/15 18:51:03 +0000","created_at_human":"February 15, 2015 at  6:02 PM UTC","reply_to":{"id":153371,"unique_id":"153371-2866","author":{"id":412112,"username":"_Jupiter","avatar":"https://crafatar.com/avatars/666a363d92304924827909c05576d7c0?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"\u003cspan\u003e\u003ca target=\"_blank\" rel=\"nofollow\" href=\"http://comic.naver.com/webtoon/detail.nhn?titleId=350217\u0026amp;no=31\u0026amp;weekday=tue/\"\u003ehttp://comic.naver.com/webtoon/detail.nhn?titleId=350217\u0026amp;no=31\u0026amp;weekday=tue/\u003c/a\u003e\u003cbr\u003eso scary. My korean friend sent it to me :D\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003c/span\u003e","body_tagged":"\u003cspan\u003e\u003ca target=\"_blank\" rel=\"nofollow\" href=\"http://comic.naver.com/webtoon/detail.nhn?titleId=350217\u0026amp;no=31\u0026amp;weekday=tue/\"\u003ehttp://comic.naver.com/webtoon/detail.nhn?titleId=350217\u0026amp;no=31\u0026amp;weekday=tue/\u003c/a\u003e\u003cbr\u003eso scary. My korean friend sent it to me :D\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003c/span\u003e","created_at":"2015/02/15 18:04:02 +0000","created_at_human":"February 15, 2015 at  6:02 PM UTC"}},{"id":153547,"unique_id":"153547-276","author":{"id":29263,"username":"Trexychan","avatar":"https://www.gravatar.com/avatar/1acfdd6481b0bcc76a5cf25fd55ff8a6?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"I saw that once before, it's the sound that's scary as hell","body_tagged":"I saw that once before, it's the sound that's scary as hell","created_at":"2015/02/16 01:39:50 +0000","created_at_human":"February 16, 2015 at  1:02 AM UTC","reply_to":{"id":153371,"unique_id":"153371-2692","author":{"id":412112,"username":"_Jupiter","avatar":"https://crafatar.com/avatars/666a363d92304924827909c05576d7c0?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"\u003cspan\u003e\u003ca target=\"_blank\" rel=\"nofollow\" href=\"http://comic.naver.com/webtoon/detail.nhn?titleId=350217\u0026amp;no=31\u0026amp;weekday=tue/\"\u003ehttp://comic.naver.com/webtoon/detail.nhn?titleId=350217\u0026amp;no=31\u0026amp;weekday=tue/\u003c/a\u003e\u003cbr\u003eso scary. My korean friend sent it to me :D\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003c/span\u003e","body_tagged":"\u003cspan\u003e\u003ca target=\"_blank\" rel=\"nofollow\" href=\"http://comic.naver.com/webtoon/detail.nhn?titleId=350217\u0026amp;no=31\u0026amp;weekday=tue/\"\u003ehttp://comic.naver.com/webtoon/detail.nhn?titleId=350217\u0026amp;no=31\u0026amp;weekday=tue/\u003c/a\u003e\u003cbr\u003eso scary. My korean friend sent it to me :D\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003c/span\u003e","created_at":"2015/02/15 18:04:02 +0000","created_at_human":"February 15, 2015 at  6:02 PM UTC"}}]}