{"id":16832,"unique_id":"16832-2098","author":{"id":457085,"username":"Subscriptor","avatar":"https://crafatar.com/avatars/3eb9879370da4ca0b20499a1465e8446?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"\u003cdiv\u003e\u003cb\u003e\u003cu\u003eBasic explaination\u003c/u\u003e\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eThis is a fan fiction I will be writing for a while. I enjoy writing and I like making stories etc. This will be a story about an Avicus tourney and how the teams compete. I'm going to try to make an actual long story from it. I'm going to write it in pastebin and update and bump this post once a new chapter comes out. Excuse me for grammar mistakes (English is not my first language). If you have a valid reason (staff) to make it on paste-bin I will move it to there. I'm taking the names in the story pretty randomally so if you see a character in the story being kind of butthurt, salty, or cocky don't be offended. Also this will be kinda based on the reality, I don't mean to present any team/player in a bad light, but in every story there must be the \"bad guys\", i honestly chose a random team and made them the \"bad guys\" in the story, so don't get offended if you or your team are represented in a bad light. Yes, I know this story will be such a drama out of simple tourney fan fiction, but thats my writing style, and yes, I know im not the best writer, im just doing these for fun 'cause i enjoy them. I also dont see a reason to post that on pastebin and I assume this being in the forums insteaf pastebin is better, if you find this not good tell me and ill make a pastebin thingy to that.\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cb\u003e\u003cu\u003eShort explaination about the story\u003c/u\u003e\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eAvicus' 4th official tournament, 'Captured' is about to start! All teams prepare yourselves for the best tourney you've ever experienced.\u003c/div\u003e\u003cdiv\u003eAll teams were scared yet ready.\u003c/div\u003e\u003cdiv\u003e\"This is going to be an interesting tournament\" - Said PelThePenguin, and sent a global message in the chat; \"Start the first game!\", and the first game started. Who will win? Who will advance levels till the big final and win it? Who is going to be the best team?\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cb\u003e\u003cu\u003eChapter #1: The Beginning\u003c/u\u003e\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\"We are sure going to win that, easily!\" Said GigoTheGorila, and his team agreed with him.\u003c/div\u003e\u003cdiv\u003eAll rooms in TeamSpeak were loud, till PelThePenguin connected to the lobby. All teams felt its going to start. They were scared, but felt prepared and each one of the teams was confident and wanted to win the tourney.\u003c/div\u003e\u003cdiv\u003ePelThePenguin moved everybody the a big channel, muted everybody - so only he has the ability to speak. Everything was quiet for around 4 minutes. After some time, Pelp decided to talk. He said; \"Good luck everybody, we all hope this will be a fun and orginized tourney! I wish you good luck!\", and right after, the chat was flooded by \"Thanks pelp!\". Pelp moved everybody back, and was about to start the first match.\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eBerzerk and Patchi were the first teams to play the first match. All players on these teams were so scared, because they were the first and they needed to prove to the others they are good by winning the first game. Both teams are ready. 99250 said \"I don't like Rendezvous3CTW! It's such a bad map! :(\", \u0026nbsp;\"We will have to play it, we will have to prove our power\" Said Kycrafft.\u003c/div\u003e\u003cdiv\u003eWhile on the other team, Patchi, the players were a lot more confident. \"We are going to shrek them to pieces\" said Ambivalence, \"Yeah, it's Berzerk, what can they do?\" -Replied Jiim, and the room became quiet again.\u003c/div\u003e\u003cdiv\u003eBoth teams were ready, and both wanted to prove that they can win. Everyone thinks of his position and his skills, however they had no time.\u003c/div\u003e\u003cdiv\u003e\"The match in RendezvousNewCTW will begin in 30 seconds\"\u003c/div\u003e\u003cdiv\u003eBoth rooms were quiet, there was literally no noise except Administrafer's background noise.\u003c/div\u003e\u003cdiv\u003e\"The match in RendezvousNewCTW will begin in 5 seconds\"\u003c/div\u003e\u003cdiv\u003e\"Oh no, oh god\" said MasterProX.\u003c/div\u003e\u003cdiv\u003e\"The match has started!\"\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cb\u003e2 DAYS BEFORE\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\"Ambi, should we practice? I don't think we need to be that confident, who knows, berzerk may suprise us..\" said Stimulating. Ambivalence dissagreed and said \"LOL Stim, it's only berzerk. Their players are completely crap..\" But he didn't know what is going to wait for him on the match.\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cu\u003e*Berzerk Skype Chat*\u003c/u\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\"OMG WE GOT PATCHI RIP US :(\" said Spookeh\u003c/div\u003e\u003cdiv\u003e\"OMG IKR HOLY CRAP LOOK AT THEIR ROSTER, WOW\" VenomousViper replied to spooks.\u003c/div\u003e\u003cdiv\u003e\"Guys, we have to stay confident to win, but not too cocky or too confident\" -Said kycrafft, and the team followed his instructions.\u003c/div\u003e\u003cdiv\u003e\"I hope the match will go well..\" -Said Pelp, and the rest of the Officials team agreed\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cb\u003e\u003cu\u003eChapter #2, Part 1 : The Match\u003c/u\u003e\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eThe match has started. Referees are also excited for the new tourney. They are looking forward to ref well and hope to not make any mistakes. The match was 9v9, both teams decided to put only 1 defender on each wool.\u003c/div\u003e\u003cdiv\u003eThe referees talk with eachother about the positions of the players that are playing, and surprised about couple. In patchi, Jiim, their best offender, played defence. Their \u0026nbsp;best support player, Hola, was on skybridge and rushed. \"We dont even need to care about positions in this match, we will take it easyyyyy\" Said Ambivalence. All referees were bored. \"This match will be boring as hell, I already can see patchi will win that easy, lol, look at their roster..\" Said Fuseh \"Lmao, I agree, patchi will win for sure\" Said Yunooo. Berzerk decided to make an early push on left side, with 4 full iron armor players, MasterProX, Spoookeh, Spizy and _Phyre. Once they crossed the flat bridge Spoookeh made using his 'Ultra-Super-Duper' Ninja bridging skills, _Phyre and Spizy got shot off by GigoTheGorilla. \"Yeah! Got'em!\" Said ingigo, and they laughed, But they forgot about that MasterProX and Spoookeh are still alive. MasterPro, being a good pvper, went up to the 'above' ground level, and took out a 2v1, and died. Patchi were happy about taking the push in a good way and taking a four people push. What Patchi didn't know, is that Master was just a distraction for spooks. Spooks went tunneling, and kept advancing. While the lovely spooks is tunneling, Patchi is getting ready for a major push from both sides, 3 people on left and 3 on right. Patchi makes the armor and takes lots of players from their positions to succeed the push, and taking some of their support players. Patchi successfully crosses both sides to Berzerk's frontlines, and holding them and shooting with the bow. AtditC, which is good with the bow, got a huge amout of accurate shots in a row, and got 2 kills. Just about Patchi was ready to advance in the push and get into berzerk's defences, their defender Jiim started screaming in the teamspeak \"SUPPORTERS THERE IS A TUNNELER AND HES MAKING HIS WAY TO THE WOOL ROOM\". Patchi was mad. How could they take their support players, such a stupid move.. While Patchi's other defender, wikki24, yells \"Come on guys, I need wood as soon as possible for my crafting table huge wall!\" Patchi didn't have support players at the time, they were all ready to push. AtditC and SilverFox decided to come back to help the defenders. Spoookeh was shifting underground, Jiim and AtditC couldnt find him. Spooks kept tunneling, and he reached the bedrock wall. He doesnt know what to do. If he stays for too long they will find him, and kill him, but if he goes back he loses his advantage. Spooks tries to think in creativity as fast as possible, and finds a good way. He thinks *\"That might be really risky, but that's my only option now is too circle jump the wall. That might be very hard, but I have to do that, for my team, for the win!\"* Spookeh mines the blocks, he is ready for the jump, Spookeh is holding the controls and the space bar, ready, goes out of the tunnel for a bit to see if he can make it. The defender Jiim notices him and runs to kill him! Spookeh saw jim coming, and thought \"It's not or never..\" And spooks jumped. He saw the void under his legs, and jim was ready to shoot him, Jiim missed the shot and spooks made the jump! \"HOORAY\" Screams spooks! I'm in the wool room! Everyone is congratulating spooks on his great job. While Patchi, is yelling at their defender Jiim, for missing such an easy shot. \"How could you miss such a shot..\" Said splade. Jiim was sad and sorry. Patchi was surprised on berzerk even getting a single touch. But patchi didn't give up, they still had players on berzerk's frontlines. Ambivalence decided to push the left side, so they had 4 players in one frontline, that are really good PvP wise. Ambi said; \"Push!\" And they did. They killed everybody on their way, and destroyed completely 99250's defense. They got into the wool room. Now 4 players in one room? Thats completely impossible to stop! Referees were surprised about the game situation. \"I knew they would make it to the wool!\" Said Eako, being excited for spooks performing such a great jump. Patchi focuses more on their push and stays in the wool room for a while, while in their wool-room, spooks is still there. And all players calmed down a bit, holding the enemies in the wool room.\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cu\u003e\u003cb\u003eChapter #2, Part 2 : Wool Rooms\u003c/b\u003e\u003c/u\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eSad spookeh saying \"I'm alone in the wool room, and 2 defenders are not letting me out! Come push and help me to get out!\". \"We can't..\", \"They got into my defense! :(\" said ky. Patchi decided to go on a really weird tactic. All 4 players build a skybridge from the wool to ther stracture, planning on water dropping around there. While building the skybridge, Ambivalence got shot off the skybridge and said \"Oh no, ok, i'm sure you guys can do that!\" And they did. GigoTheGorilla, Administrafer and Splades built a bridge to the stracture. GigoTheGorilla failed the waterdrop, and sighed, \"Wow, that was such a fail xD!\" Administrafer and Splades are holding the roof and ready to run back with the wool. Berzerk realizes that if they dont take an action immediately, Patchi will get the wool.\u003c/div\u003e\u003cdiv\u003eBerzerk orginized 4 man push, and goes up to the roof. The battle was really intense. Splades got 2 players and Jozz got 1. The last player of berzerk that stayed alive was TheMasterClock, it was all on him. Jozz and Splade were both on 2 hearts, and Clock was on 5. He said, \"I can make it!\". He knew that if he doesnt kill them, Patchi will get a wool. He goes up, and gets shot. He doesn't give up. He goes up again, and spams blockhit, and knocks jozz out of the world. It's Splade vs Clock. Splade of course has the advantage of the better gear from the wool room, however he had less health than Clock. Clock decides to circle strafe, and he kills Splade! Berzerk are really happy about that. \"How could we lose that push..\" Said Ingigo. Berzerk were getting ready for pushing out spooks. Berzerk tells spooks to stay there and be patient. Spooks doesnt listen. He is very tired of following instructions, and he wanted to try out something really risky. On the other defense of Patchi stands wikki24 with a huge and high craftingtable wall! Spooks sees that, and says, \"I can do that!\" And goes #YOLO. Spooks blockspams out of the wool. Atdit and Jim got to hit him few times, and they bring spooks to 4 hearts. Spooks doesnt stop, and keeps blockspamming. He decides to try to double touch. He is screaming \"IM DOING A DOUBLE TOUCH\", and the rest of berzerk are annoyed of spooks not following instructions. But they give him a try. He sees a big wall. He understands that if he builds up he will get shot. Spooks covers himself very fast and breaks the wall instead of climbng up. \"I Didn't think he can do that... my fault, crap!!!!\" Said Wikki. Spooks did it! \u0026nbsp;A double touch!.\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cb\u003e\u003cu\u003eChapter #2, Part 3 : Surprise!\u003c/u\u003e\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e10 minutes left. Berzerk has 2 touches. Patchi has one touch. Patchi doesn't give up. Patchi orginizes a big push, they take 5 players and going to the second wool. Berzerk handles the push easily, master gets up, looks around him, and discoveres that al 5 patchi offenders are gone to tunnels. Master kills 2 and dies. Patchi defenders keep tunnelling, till the bedrock wall. \"We must go up\" said Ambi, ambi and splades went up and quickly got knocked off by VenomousViper.\u0026nbsp;\u003cbr\u003e\"Berzerk is going crazy\" the referees said, \"they are making a 7 man push.. thats everybody except the defenders..\".\u0026nbsp;\u003cbr\u003eBerzerk takes 7 iron guys. They decide, it's now or never, they must do that. They leave their defences, and let patchi on the second wool, while venomous is holding them back. \"Let's go!\" said clock. all 7 players crossed the bridge successfully, and here they are. 7 players of berzerk, in patchi's defence. \"7 MAN PUSH ON LEFT\" said Jim, \"WHAT!?!?\" said Ingigo, \"WOW!\" \"EVERYONE FALL BACK, NOW!\". Patchi weren't ready for such a push. 5 Berzerk players distracted and killed all patchi players that were coming, and another 2 went to the wool room with spooks. Patchi just couldnt do anything but one thing. \"our only option is getting back with the wool before they do.\" \"Ok\" says Splades, which was in the wool room. 7 Players of bezerk vs 1 of patchi running back. In the way back, clock noticed splades running back, and they took 4 players to go on splades, and 2 with spooks back. Both splades and spooks running back, thinking, \"This is our chance. We need to win that\". Splade was faster, but second before, patchi discovered that berzerk put a special sneaky player behind the bedrock wall (*yes, thats a legit tactic and ive seen that before), and he killed splade right before he could place it. That was awesome. Spooks ran back, and noticed that he has both wools. All referees were amazed, they didn't expect that. All berzerk are happy that spooks succeeded his rush, and all berzerk gets near him to screenshot. That was exciting. Spookeh places both wools in the victory monument, and the chat gets flooded by \"gg\"s and few \"WHAT?!?\"s. Spoookeh is happy like he never was. Berzerk are happy that they won. Patchi are surprised by what berzerk has done, and from now on no one judges teams by their roster, since that match. PelThePenguin moves everybody to a big room and says \"That was a great game guys! I enjoyed spectating it. The first match on the \"Captured\" tournament has been successful. We are looking forward for more good matches!\" And everyone couldnt wait to see what will happen in the next match..\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eThat's all for today! I hope you like it since it's really detailed and I wrote that by imagining what will happen next tourney, but most of that isnt reality. In this chapter I kinda represented patchi in a bad light but thats just for the sake of the story, so sorry if you're offended.\u003cbr\u003eI will be making more of these tomorrow.\u003cbr\u003eBye and good night :D\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003c/div\u003e","body_tagged":"\u003cdiv\u003e\u003cb\u003e\u003cu\u003eBasic explaination\u003c/u\u003e\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eThis is a fan fiction I will be writing for a while. I enjoy writing and I like making stories etc. This will be a story about an Avicus tourney and how the teams compete. I'm going to try to make an actual long story from it. I'm going to write it in pastebin and update and bump this post once a new chapter comes out. Excuse me for grammar mistakes (English is not my first language). If you have a valid reason (staff) to make it on paste-bin I will move it to there. I'm taking the names in the story pretty randomally so if you see a character in the story being kind of butthurt, salty, or cocky don't be offended. Also this will be kinda based on the reality, I don't mean to present any team/player in a bad light, but in every story there must be the \"bad guys\", i honestly chose a random team and made them the \"bad guys\" in the story, so don't get offended if you or your team are represented in a bad light. Yes, I know this story will be such a drama out of simple tourney fan fiction, but thats my writing style, and yes, I know im not the best writer, im just doing these for fun 'cause i enjoy them. I also dont see a reason to post that on pastebin and I assume this being in the forums insteaf pastebin is better, if you find this not good tell me and ill make a pastebin thingy to that.\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cb\u003e\u003cu\u003eShort explaination about the story\u003c/u\u003e\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eAvicus' 4th official tournament, 'Captured' is about to start! All teams prepare yourselves for the best tourney you've ever experienced.\u003c/div\u003e\u003cdiv\u003eAll teams were scared yet ready.\u003c/div\u003e\u003cdiv\u003e\"This is going to be an interesting tournament\" - Said PelThePenguin, and sent a global message in the chat; \"Start the first game!\", and the first game started. Who will win? Who will advance levels till the big final and win it? Who is going to be the best team?\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cb\u003e\u003cu\u003eChapter #1: The Beginning\u003c/u\u003e\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\"We are sure going to win that, easily!\" Said GigoTheGorila, and his team agreed with him.\u003c/div\u003e\u003cdiv\u003eAll rooms in TeamSpeak were loud, till PelThePenguin connected to the lobby. All teams felt its going to start. They were scared, but felt prepared and each one of the teams was confident and wanted to win the tourney.\u003c/div\u003e\u003cdiv\u003ePelThePenguin moved everybody the a big channel, muted everybody - so only he has the ability to speak. Everything was quiet for around 4 minutes. After some time, Pelp decided to talk. He said; \"Good luck everybody, we all hope this will be a fun and orginized tourney! I wish you good luck!\", and right after, the chat was flooded by \"Thanks pelp!\". Pelp moved everybody back, and was about to start the first match.\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eBerzerk and Patchi were the first teams to play the first match. All players on these teams were so scared, because they were the first and they needed to prove to the others they are good by winning the first game. Both teams are ready. 99250 said \"I don't like Rendezvous3CTW! It's such a bad map! :(\", \u0026nbsp;\"We will have to play it, we will have to prove our power\" Said Kycrafft.\u003c/div\u003e\u003cdiv\u003eWhile on the other team, Patchi, the players were a lot more confident. \"We are going to shrek them to pieces\" said Ambivalence, \"Yeah, it's Berzerk, what can they do?\" -Replied Jiim, and the room became quiet again.\u003c/div\u003e\u003cdiv\u003eBoth teams were ready, and both wanted to prove that they can win. Everyone thinks of his position and his skills, however they had no time.\u003c/div\u003e\u003cdiv\u003e\"The match in RendezvousNewCTW will begin in 30 seconds\"\u003c/div\u003e\u003cdiv\u003eBoth rooms were quiet, there was literally no noise except Administrafer's background noise.\u003c/div\u003e\u003cdiv\u003e\"The match in RendezvousNewCTW will begin in 5 seconds\"\u003c/div\u003e\u003cdiv\u003e\"Oh no, oh god\" said MasterProX.\u003c/div\u003e\u003cdiv\u003e\"The match has started!\"\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cb\u003e2 DAYS BEFORE\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\"Ambi, should we practice? I don't think we need to be that confident, who knows, berzerk may suprise us..\" said Stimulating. Ambivalence dissagreed and said \"LOL Stim, it's only berzerk. Their players are completely crap..\" But he didn't know what is going to wait for him on the match.\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cu\u003e*Berzerk Skype Chat*\u003c/u\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\"OMG WE GOT PATCHI RIP US :(\" said Spookeh\u003c/div\u003e\u003cdiv\u003e\"OMG IKR HOLY CRAP LOOK AT THEIR ROSTER, WOW\" VenomousViper replied to spooks.\u003c/div\u003e\u003cdiv\u003e\"Guys, we have to stay confident to win, but not too cocky or too confident\" -Said kycrafft, and the team followed his instructions.\u003c/div\u003e\u003cdiv\u003e\"I hope the match will go well..\" -Said Pelp, and the rest of the Officials team agreed\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cb\u003e\u003cu\u003eChapter #2, Part 1 : The Match\u003c/u\u003e\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eThe match has started. Referees are also excited for the new tourney. They are looking forward to ref well and hope to not make any mistakes. The match was 9v9, both teams decided to put only 1 defender on each wool.\u003c/div\u003e\u003cdiv\u003eThe referees talk with eachother about the positions of the players that are playing, and surprised about couple. In patchi, Jiim, their best offender, played defence. Their \u0026nbsp;best support player, Hola, was on skybridge and rushed. \"We dont even need to care about positions in this match, we will take it easyyyyy\" Said Ambivalence. All referees were bored. \"This match will be boring as hell, I already can see patchi will win that easy, lol, look at their roster..\" Said Fuseh \"Lmao, I agree, patchi will win for sure\" Said Yunooo. Berzerk decided to make an early push on left side, with 4 full iron armor players, MasterProX, Spoookeh, Spizy and _Phyre. Once they crossed the flat bridge Spoookeh made using his 'Ultra-Super-Duper' Ninja bridging skills, _Phyre and Spizy got shot off by GigoTheGorilla. \"Yeah! Got'em!\" Said ingigo, and they laughed, But they forgot about that MasterProX and Spoookeh are still alive. MasterPro, being a good pvper, went up to the 'above' ground level, and took out a 2v1, and died. Patchi were happy about taking the push in a good way and taking a four people push. What Patchi didn't know, is that Master was just a distraction for spooks. Spooks went tunneling, and kept advancing. While the lovely spooks is tunneling, Patchi is getting ready for a major push from both sides, 3 people on left and 3 on right. Patchi makes the armor and takes lots of players from their positions to succeed the push, and taking some of their support players. Patchi successfully crosses both sides to Berzerk's frontlines, and holding them and shooting with the bow. AtditC, which is good with the bow, got a huge amout of accurate shots in a row, and got 2 kills. Just about Patchi was ready to advance in the push and get into berzerk's defences, their defender Jiim started screaming in the teamspeak \"SUPPORTERS THERE IS A TUNNELER AND HES MAKING HIS WAY TO THE WOOL ROOM\". Patchi was mad. How could they take their support players, such a stupid move.. While Patchi's other defender, wikki24, yells \"Come on guys, I need wood as soon as possible for my crafting table huge wall!\" Patchi didn't have support players at the time, they were all ready to push. AtditC and SilverFox decided to come back to help the defenders. Spoookeh was shifting underground, Jiim and AtditC couldnt find him. Spooks kept tunneling, and he reached the bedrock wall. He doesnt know what to do. If he stays for too long they will find him, and kill him, but if he goes back he loses his advantage. Spooks tries to think in creativity as fast as possible, and finds a good way. He thinks *\"That might be really risky, but that's my only option now is too circle jump the wall. That might be very hard, but I have to do that, for my team, for the win!\"* Spookeh mines the blocks, he is ready for the jump, Spookeh is holding the controls and the space bar, ready, goes out of the tunnel for a bit to see if he can make it. The defender Jiim notices him and runs to kill him! Spookeh saw jim coming, and thought \"It's not or never..\" And spooks jumped. He saw the void under his legs, and jim was ready to shoot him, Jiim missed the shot and spooks made the jump! \"HOORAY\" Screams spooks! I'm in the wool room! Everyone is congratulating spooks on his great job. While Patchi, is yelling at their defender Jiim, for missing such an easy shot. \"How could you miss such a shot..\" Said splade. Jiim was sad and sorry. Patchi was surprised on berzerk even getting a single touch. But patchi didn't give up, they still had players on berzerk's frontlines. Ambivalence decided to push the left side, so they had 4 players in one frontline, that are really good PvP wise. Ambi said; \"Push!\" And they did. They killed everybody on their way, and destroyed completely 99250's defense. They got into the wool room. Now 4 players in one room? Thats completely impossible to stop! Referees were surprised about the game situation. \"I knew they would make it to the wool!\" Said Eako, being excited for spooks performing such a great jump. Patchi focuses more on their push and stays in the wool room for a while, while in their wool-room, spooks is still there. And all players calmed down a bit, holding the enemies in the wool room.\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cu\u003e\u003cb\u003eChapter #2, Part 2 : Wool Rooms\u003c/b\u003e\u003c/u\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eSad spookeh saying \"I'm alone in the wool room, and 2 defenders are not letting me out! Come push and help me to get out!\". \"We can't..\", \"They got into my defense! :(\" said ky. Patchi decided to go on a really weird tactic. All 4 players build a skybridge from the wool to ther stracture, planning on water dropping around there. While building the skybridge, Ambivalence got shot off the skybridge and said \"Oh no, ok, i'm sure you guys can do that!\" And they did. GigoTheGorilla, Administrafer and Splades built a bridge to the stracture. GigoTheGorilla failed the waterdrop, and sighed, \"Wow, that was such a fail xD!\" Administrafer and Splades are holding the roof and ready to run back with the wool. Berzerk realizes that if they dont take an action immediately, Patchi will get the wool.\u003c/div\u003e\u003cdiv\u003eBerzerk orginized 4 man push, and goes up to the roof. The battle was really intense. Splades got 2 players and Jozz got 1. The last player of berzerk that stayed alive was TheMasterClock, it was all on him. Jozz and Splade were both on 2 hearts, and Clock was on 5. He said, \"I can make it!\". He knew that if he doesnt kill them, Patchi will get a wool. He goes up, and gets shot. He doesn't give up. He goes up again, and spams blockhit, and knocks jozz out of the world. It's Splade vs Clock. Splade of course has the advantage of the better gear from the wool room, however he had less health than Clock. Clock decides to circle strafe, and he kills Splade! Berzerk are really happy about that. \"How could we lose that push..\" Said Ingigo. Berzerk were getting ready for pushing out spooks. Berzerk tells spooks to stay there and be patient. Spooks doesnt listen. He is very tired of following instructions, and he wanted to try out something really risky. On the other defense of Patchi stands wikki24 with a huge and high craftingtable wall! Spooks sees that, and says, \"I can do that!\" And goes #YOLO. Spooks blockspams out of the wool. Atdit and Jim got to hit him few times, and they bring spooks to 4 hearts. Spooks doesnt stop, and keeps blockspamming. He decides to try to double touch. He is screaming \"IM DOING A DOUBLE TOUCH\", and the rest of berzerk are annoyed of spooks not following instructions. But they give him a try. He sees a big wall. He understands that if he builds up he will get shot. Spooks covers himself very fast and breaks the wall instead of climbng up. \"I Didn't think he can do that... my fault, crap!!!!\" Said Wikki. Spooks did it! \u0026nbsp;A double touch!.\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cb\u003e\u003cu\u003eChapter #2, Part 3 : Surprise!\u003c/u\u003e\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e10 minutes left. Berzerk has 2 touches. Patchi has one touch. Patchi doesn't give up. Patchi orginizes a big push, they take 5 players and going to the second wool. Berzerk handles the push easily, master gets up, looks around him, and discoveres that al 5 patchi offenders are gone to tunnels. Master kills 2 and dies. Patchi defenders keep tunnelling, till the bedrock wall. \"We must go up\" said Ambi, ambi and splades went up and quickly got knocked off by VenomousViper.\u0026nbsp;\u003cbr\u003e\"Berzerk is going crazy\" the referees said, \"they are making a 7 man push.. thats everybody except the defenders..\".\u0026nbsp;\u003cbr\u003eBerzerk takes 7 iron guys. They decide, it's now or never, they must do that. They leave their defences, and let patchi on the second wool, while venomous is holding them back. \"Let's go!\" said clock. all 7 players crossed the bridge successfully, and here they are. 7 players of berzerk, in patchi's defence. \"7 MAN PUSH ON LEFT\" said Jim, \"WHAT!?!?\" said Ingigo, \"WOW!\" \"EVERYONE FALL BACK, NOW!\". Patchi weren't ready for such a push. 5 Berzerk players distracted and killed all patchi players that were coming, and another 2 went to the wool room with spooks. Patchi just couldnt do anything but one thing. \"our only option is getting back with the wool before they do.\" \"Ok\" says Splades, which was in the wool room. 7 Players of bezerk vs 1 of patchi running back. In the way back, clock noticed splades running back, and they took 4 players to go on splades, and 2 with spooks back. Both splades and spooks running back, thinking, \"This is our chance. We need to win that\". Splade was faster, but second before, patchi discovered that berzerk put a special sneaky player behind the bedrock wall (*yes, thats a legit tactic and ive seen that before), and he killed splade right before he could place it. That was awesome. Spooks ran back, and noticed that he has both wools. All referees were amazed, they didn't expect that. All berzerk are happy that spooks succeeded his rush, and all berzerk gets near him to screenshot. That was exciting. Spookeh places both wools in the victory monument, and the chat gets flooded by \"gg\"s and few \"WHAT?!?\"s. Spoookeh is happy like he never was. Berzerk are happy that they won. Patchi are surprised by what berzerk has done, and from now on no one judges teams by their roster, since that match. PelThePenguin moves everybody to a big room and says \"That was a great game guys! I enjoyed spectating it. The first match on the \"Captured\" tournament has been successful. We are looking forward for more good matches!\" And everyone couldnt wait to see what will happen in the next match..\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eThat's all for today! I hope you like it since it's really detailed and I wrote that by imagining what will happen next tourney, but most of that isnt reality. In this chapter I kinda represented patchi in a bad light but thats just for the sake of the story, so sorry if you're offended.\u003cbr\u003eI will be making more of these tomorrow.\u003cbr\u003eBye and good night :D\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e\u003c/div\u003e","created_at":"2015/09/22 19:58:35 +0000","created_at_human":"September 22, 2015 at  7:09 PM UTC","title":"Avicus - Fan Fiction - Tourney","replies":[{"id":231960,"unique_id":"231960-3540","author":{"id":441165,"username":"Indicado","avatar":"https://crafatar.com/avatars/9b4fbb38ed5544adb5109f0197433f93?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Loved it! Just loved it! Do more like that! :DDDD\u003cbr\u003e\u003cbr\u003eSeriosly,loved it,It is full of feelings, surprises!","body_tagged":"Loved it! Just loved it! Do more like that! :DDDD\u003cbr\u003e\u003cbr\u003eSeriosly,loved it,It is full of feelings, surprises!","created_at":"2015/09/22 20:26:58 +0000","created_at_human":"September 22, 2015 at  8:09 PM UTC"},{"id":231969,"unique_id":"231969-2293","author":{"id":215946,"username":"PokerFace","avatar":"https://www.gravatar.com/avatar/d2124417da55a6c5feacfe0c5b4b9bc0?s=$SIZE$\u0026default=mm","color":"Gray","staff":true},"body":"GG","body_tagged":"GG","created_at":"2015/09/22 20:32:04 +0000","created_at_human":"September 22, 2015 at  8:09 PM UTC"},{"id":231976,"unique_id":"231976-4779","author":{"id":19112,"username":"Numberz_","avatar":"https://crafatar.com/avatars/e16d067223c74a02bd22965e38521c35?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Mfw im not even part of Berzerk anymore... Nice story though.","body_tagged":"Mfw im not even part of Berzerk anymore... Nice story though.","created_at":"2015/09/22 20:36:49 +0000","created_at_human":"September 22, 2015 at  8:09 PM UTC"},{"id":231977,"unique_id":"231977-3900","author":{"id":28438,"username":"Ingigo","avatar":"https://www.gravatar.com/avatar/33a160bfe5731fcd7a933d8e3f89828c?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"Or you just hate Patchi and you wanted to annoy me!!1111!!!\u003cbr\u003eScrub xD","body_tagged":"Or you just hate Patchi and you wanted to annoy me!!1111!!!\u003cbr\u003eScrub xD","created_at":"2015/09/22 20:37:13 +0000","created_at_human":"September 22, 2015 at  8:09 PM UTC"},{"id":231978,"unique_id":"231978-3246","author":{"id":457085,"username":"Subscriptor","avatar":"https://crafatar.com/avatars/3eb9879370da4ca0b20499a1465e8446?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"oh lol I didn't see, sorry","body_tagged":"oh lol I didn't see, sorry","created_at":"2015/09/22 20:37:51 +0000","created_at_human":"September 22, 2015 at  8:09 PM UTC","reply_to":{"id":231976,"unique_id":"231976-4748","author":{"id":19112,"username":"Numberz_","avatar":"https://crafatar.com/avatars/e16d067223c74a02bd22965e38521c35?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Mfw im not even part of Berzerk anymore... Nice story though.","body_tagged":"Mfw im not even part of Berzerk anymore... Nice story though.","created_at":"2015/09/22 20:36:49 +0000","created_at_human":"September 22, 2015 at  8:09 PM UTC"}},{"id":231979,"unique_id":"231979-4399","author":{"id":8247,"username":"Zlik","avatar":"https://crafatar.com/avatars/db30b625ef2a4e5799d1be06e709547e?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Nice","body_tagged":"Nice","created_at":"2015/09/22 20:38:06 +0000","created_at_human":"September 22, 2015 at  8:09 PM UTC"},{"id":231981,"unique_id":"231981-2600","author":{"id":457085,"username":"Subscriptor","avatar":"https://crafatar.com/avatars/3eb9879370da4ca0b20499a1465e8446?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Nope, I just randomly chose a team to annoy.\u003cbr\u003ejk lol I hate u bad \u0026lt;3\u003cbr\u003ejk #2 plot twist I love you!!!!!1","body_tagged":"Nope, I just randomly chose a team to annoy.\u003cbr\u003ejk lol I hate u bad \u0026lt;3\u003cbr\u003ejk #2 plot twist I love you!!!!!1","created_at":"2015/09/22 20:38:43 +0000","created_at_human":"September 22, 2015 at  8:09 PM UTC","reply_to":{"id":231977,"unique_id":"231977-2925","author":{"id":28438,"username":"Ingigo","avatar":"https://www.gravatar.com/avatar/33a160bfe5731fcd7a933d8e3f89828c?s=$SIZE$\u0026default=mm","color":"none","staff":false},"body":"Or you just hate Patchi and you wanted to annoy me!!1111!!!\u003cbr\u003eScrub xD","body_tagged":"Or you just hate Patchi and you wanted to annoy me!!1111!!!\u003cbr\u003eScrub xD","created_at":"2015/09/22 20:37:13 +0000","created_at_human":"September 22, 2015 at  8:09 PM UTC"}},{"id":231987,"unique_id":"231987-1083","author":{"id":11163,"username":"HotAndCrunch","avatar":"https://crafatar.com/avatars/4a11e1c99e15484ebcf47d1873c94c4e?helm\u0026size=$SIZE$","color":"none","staff":false},"body":"Nailed the personalities","body_tagged":"Nailed the personalities","created_at":"2015/09/22 20:42:29 +0000","created_at_human":"September 22, 2015 at  8:09 PM UTC"}]}